Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# err_dependent_tag_decl
source: %select{declaration|definition}0 of %select{struct|interface|union|class|enum}1 in a dependent scope
root: {$arg0 :select s0=|declaration| s1=|definition|} of {$arg1 :select s0=|struct| s1=|interface| s2=|union| s3=|class| s4=|enum|} in a dependent scope

# err_dependent_typed_non_type_arg_in_partial_spec
source: non-type template argument specializes a template parameter with dependent type %0
root: non-type template argument specializes a template parameter with dependent type {$arg0}

# err_dereference_incomplete_type
source: dereference of pointer to incomplete type %0
root: dereference of pointer to incomplete type {$arg0}

# err_designated_init_for_non_aggregate
source: initialization of non-aggregate type %0 with a designated initializer list
root: initialization of non-aggregate type {$arg0} with a designated initializer list

# err_designator_for_scalar_or_sizeless_init
source: designator in initializer for %select{scalar|indivisible sizeless}0 type %1
root: designator in initializer for {$arg0 :select s0=|scalar| s1=|indivisible sizeless|} type {$arg1}

# err_destroy_attr_on_non_static_var
source: %select{no_destroy|always_destroy}0 attribute can only be applied to a variable with static or thread storage duration
root: {$arg0 :select s0=|no_destroy| s1=|always_destroy|} attribute can only be applied to a variable with static or thread storage duration

# err_destructor_cannot_be
source: destructor cannot be declared '%0'
root: destructor cannot be declared '{$arg0}'

# err_destructor_expr_mismatch
source: identifier %0 in object destruction expression does not name the type %1 of the object being destroyed
root: identifier {$arg0} in object destruction expression does not name the type {$arg1} of the object being destroyed

# err_destructor_expr_nontype
source: identifier %0 in object destruction expression does not name a type
root: identifier {$arg0} in object destruction expression does not name a type

# err_destructor_expr_type_mismatch
source: destructor type %0 in object destruction expression does not match the type %1 of the object being destroyed
root: destructor type {$arg0} in object destruction expression does not match the type {$arg1} of the object being destroyed

# err_destructor_name_nontype
source: identifier %0 after '~' in destructor name does not name a type
root: identifier {$arg0} after '~' in destructor name does not name a type

# err_diagnose_if_unknown_warning
source: unknown warning group '%0'
root: unknown warning group '{$arg0}'

# err_different_language_linkage
source: declaration of %0 has a different language linkage
root: declaration of {$arg0} has a different language linkage

# err_different_return_type_for_overriding_virtual_function
source: virtual function %0 has a different return type %diff{($) than the function it overrides (which has return type $)|than the function it overrides}1,2
root: virtual function {$arg0} has a different return type %diff{($) than the function it overrides (which has return type $)|than the function it overrides}1,2

# err_direct_selector_expression
source: @selector expression formed with direct selector %0
root: @selector expression formed with direct selector {$arg0}

# err_disallowed_duplicate_attribute
source: attribute %0 cannot appear more than once on a declaration
root: attribute {$arg0} cannot appear more than once on a declaration

# err_downcast_from_inaccessible_base
source: cannot cast %select{private|protected}2 base class %1 to %0
root: cannot cast {$arg2 :select s0=|private| s1=|protected|} base class {$arg1} to {$arg0}

# err_dtor_expr_without_call
source: reference to %select{destructor|pseudo-destructor}0 must be called%select{|; did you mean to call it with no arguments?}1
root: reference to {$arg0 :select s0=|destructor| s1=|pseudo-destructor|} must be called{$arg1 :select s0=|| s1=|; did you mean to call it with no arguments?|}

# err_dup_implementation_category
source: reimplementation of category %1 for class %0
root: reimplementation of category {$arg1} for class {$arg0}

# err_dup_implementation_class
source: reimplementation of class %0
root: reimplementation of class {$arg0}

# err_duplicate_base_class
source: base class %0 specified more than once as a direct base class
root: base class {$arg0} specified more than once as a direct base class

# err_duplicate_case
source: duplicate case value '%0'
root: duplicate case value '{$arg0}'

# err_duplicate_case_differing_expr
source: duplicate case value: '%0' and '%1' both equal '%2'
root: duplicate case value: '{$arg0}' and '{$arg1}' both equal '{$arg2}'

# err_duplicate_class_def
source: duplicate interface definition for class %0
root: duplicate interface definition for class {$arg0}

# err_duplicate_ivar_use
source: synthesized properties %0 and %1 both claim instance variable %2
root: synthesized properties {$arg0} and {$arg1} both claim instance variable {$arg2}

# err_duplicate_member
source: duplicate member %0
root: duplicate member {$arg0}

# err_duplicate_method_decl
source: duplicate declaration of method %0
root: duplicate declaration of method {$arg0}

# err_duplicated_vtable_pointer_auth
source: multiple vtable pointer authentication policies on %0
root: multiple vtable pointer authentication policies on {$arg0}

# err_empty_sizeless_initializer
source: initializer for sizeless type %0 cannot be empty
root: initializer for sizeless type {$arg0} cannot be empty

# err_enum_invalid_underlying
source: %select{non-integral type %0|%0}1 is an invalid underlying type
root: {$arg1 :select s0=|non-integral type {$arg0}| s1=|{$arg0}|} is an invalid underlying type

# err_enum_mode_vector_type
source: mode %0 is not supported for enumeration types
root: mode {$arg0} is not supported for enumeration types

# err_enum_redeclare_fixed_mismatch
source: enumeration previously declared with %select{non|}0fixed underlying type
root: enumeration previously declared with {$arg0 :select s0=|non| s1=||}fixed underlying type

# err_enum_redeclare_scoped_mismatch
source: enumeration previously declared as %select{un|}0scoped
root: enumeration previously declared as {$arg0 :select s0=|un| s1=||}scoped

# err_enum_redeclare_type_mismatch
source: enumeration redeclared with different underlying type %0 (was %1)
root: enumeration redeclared with different underlying type {$arg0} (was {$arg1})

# err_enumerator_does_not_exist
source: enumerator %0 does not exist in instantiation of %1
root: enumerator {$arg0} does not exist in instantiation of {$arg1}

# err_enumerator_too_large
source: enumerator value is not representable in the underlying type %0
root: enumerator value is not representable in the underlying type {$arg0}

# err_enumerator_wrapped
source: enumerator value %0 is not representable in the underlying type %1
root: enumerator value {$arg0} is not representable in the underlying type {$arg1}

# err_exception_spec_cycle
source: exception specification of %0 uses itself
root: exception specification of {$arg0} uses itself

# err_exception_spec_in_typedef
source: exception specifications are not allowed in %select{typedefs|type aliases}0
root: exception specifications are not allowed in {$arg0 :select s0=|typedefs| s1=|type aliases|}

# err_exception_spec_incomplete_type
source: exception specification needed for member of incomplete class %0
root: exception specification needed for member of incomplete class {$arg0}

# err_exceptions_disabled
source: cannot use '%0' with exceptions disabled
root: cannot use '{$arg0}' with exceptions disabled

# err_excess_initializers
source: excess elements in %select{array|vector|scalar|union|struct}0 initializer
root: excess elements in {$arg0 :select s0=|array| s1=|vector| s2=|scalar| s3=|union| s4=|struct|} initializer

# err_excess_initializers_for_sizeless_type
source: excess elements in initializer for indivisible sizeless type %0
root: excess elements in initializer for indivisible sizeless type {$arg0}

# err_expected_callable_argument
source: expected a callable expression as %ordinal0 argument to %1, found %2
root: expected a callable expression as %ordinal0 argument to {$arg1}, found {$arg2}

# err_expected_class_or_namespace
source: %0 is not a class%select{ or namespace|, namespace, or enumeration}1
root: {$arg0} is not a class{$arg1 :select s0=| or namespace| s1=|, namespace, or enumeration|}

# err_expected_name_of_pack
source: %0 does not refer to the name of a parameter pack
root: {$arg0} does not refer to the name of a parameter pack

# err_expected_struct_pointer_argument
source: expected pointer to struct as %ordinal0 argument to %1, found %2
root: expected pointer to struct as %ordinal0 argument to {$arg1}, found {$arg2}

# err_explicit_instantiation_ambiguous
source: partial ordering for explicit instantiation of %0 is ambiguous
root: partial ordering for explicit instantiation of {$arg0} is ambiguous

# err_explicit_instantiation_data_member_not_instantiated
source: explicit instantiation refers to static data member %q0 that is not an instantiation
root: explicit instantiation refers to static data member {$arg0 :q} that is not an instantiation

# err_explicit_instantiation_duplicate
source: duplicate explicit instantiation of %0
root: duplicate explicit instantiation of {$arg0}

# err_explicit_instantiation_in_class
source: explicit instantiation of %0 in class scope
root: explicit instantiation of {$arg0} in class scope

# err_explicit_instantiation_internal_linkage
source: explicit instantiation declaration of %0 with internal linkage
root: explicit instantiation declaration of {$arg0} with internal linkage

# err_explicit_instantiation_member_function_not_instantiated
source: explicit instantiation refers to member function %q0 that is not an instantiation
root: explicit instantiation refers to member function {$arg0 :q} that is not an instantiation

# err_explicit_instantiation_must_be_global
source: explicit instantiation of %0 must occur at global scope
root: explicit instantiation of {$arg0} must occur at global scope

# err_explicit_instantiation_no_candidate
source: no viable candidate for explicit instantiation of %0
root: no viable candidate for explicit instantiation of {$arg0}

# err_explicit_instantiation_nontemplate_type
source: explicit instantiation of non-templated type %0
root: explicit instantiation of non-templated type {$arg0}

# err_explicit_instantiation_not_known
source: explicit instantiation of %0 does not refer to a function template, variable template, member function, member class, or static data member
root: explicit instantiation of {$arg0} does not refer to a function template, variable template, member function, member class, or static data member

# err_explicit_instantiation_of_typedef
source: explicit instantiation of typedef %0
root: explicit instantiation of typedef {$arg0}

# err_explicit_instantiation_out_of_scope
source: explicit instantiation of %0 not in a namespace enclosing %1
root: explicit instantiation of {$arg0} not in a namespace enclosing {$arg1}

# err_explicit_instantiation_undefined_func_template
source: explicit instantiation of undefined function template %0
root: explicit instantiation of undefined function template {$arg0}

# err_explicit_instantiation_undefined_member
source: explicit instantiation of undefined %select{member class|member function|static data member}0 %1 of class template %2
root: explicit instantiation of undefined {$arg0 :select s0=|member class| s1=|member function| s2=|static data member|} {$arg1} of class template {$arg2}

# err_explicit_instantiation_undefined_var_template
source: explicit instantiation of undefined variable template %q0
root: explicit instantiation of undefined variable template {$arg0 :q}

# err_explicit_instantiation_unqualified_wrong_namespace
source: explicit instantiation of %q0 must occur in namespace %1
root: explicit instantiation of {$arg0 :q} must occur in namespace {$arg1}

# err_explicit_instantiation_without_template_id
source: explicit instantiation of %q0 must specify a template argument list
root: explicit instantiation of {$arg0 :q} must specify a template argument list

# err_explicit_object_lambda_ambiguous_base
source: lambda %0 is inaccessible due to ambiguity:%1
root: lambda {$arg0} is inaccessible due to ambiguity:{$arg1}

# err_explicit_object_lambda_inaccessible_base
source: invalid explicit object parameter type %0 in lambda with capture; the type must derive publicly from the lambda
root: invalid explicit object parameter type {$arg0} in lambda with capture; the type must derive publicly from the lambda

# err_explicit_object_parameter_constructor
source: an explicit object parameter cannot appear in a %select{constructor|destructor}0
root: an explicit object parameter cannot appear in a {$arg0 :select s0=|constructor| s1=|destructor|}

# err_explicit_object_parameter_must_be_first
source: an explicit object parameter can only appear as the first parameter of the %select{function|lambda}0
root: an explicit object parameter can only appear as the first parameter of the {$arg0 :select s0=|function| s1=|lambda|}

# err_explicit_object_parameter_nonmember
source: an explicit object parameter cannot appear in a %select{static|virtual|non-member}0 %select{function|lambda}1
root: an explicit object parameter cannot appear in a {$arg0 :select s0=|static| s1=|virtual| s2=|non-member|} {$arg1 :select s0=|function| s1=|lambda|}

# err_export_inline_not_defined
source: inline function not defined%select{| before the private module fragment}0
root: inline function not defined{$arg0 :select s0=|| s1=| before the private module fragment|}

# err_export_internal
source: declaration of %0 with internal linkage cannot be exported
root: declaration of {$arg0} with internal linkage cannot be exported

# err_export_non_namespace_scope_name
source: cannot export %0 as it is not at namespace scope
root: cannot export {$arg0} as it is not at namespace scope

# err_export_using_internal
source: using declaration referring to %1 with %select{internal|module|unknown}0 linkage cannot be exported
root: using declaration referring to {$arg1} with {$arg0 :select s0=|internal| s1=|module| s2=|unknown|} linkage cannot be exported

# err_expr_not_ice
source: expression is not an %select{integer|integral}0 constant expression
root: expression is not an {$arg0 :select s0=|integer| s1=|integral|} constant expression

# err_ext_vector_component_exceeds_length
source: vector component access exceeds type %0
root: vector component access exceeds type {$arg0}

# err_extern_c_global_conflict
source: declaration of %1 %select{with C language linkage|in global scope}0 conflicts with declaration %select{in global scope|with C language linkage}0
root: declaration of {$arg1} {$arg0 :select s0=|with C language linkage| s1=|in global scope|} conflicts with declaration {$arg0 :select s0=|in global scope| s1=|with C language linkage|}

# err_extern_non_extern
source: extern declaration of %0 follows non-extern declaration
root: extern declaration of {$arg0} follows non-extern declaration

# err_falloff_nonvoid
source: non-void %select{function|block|lambda|coroutine}0 does not return a value%select{| in all control paths}1
root: non-void {$arg0 :select s0=|function| s1=|block| s2=|lambda| s3=|coroutine|} does not return a value{$arg1 :select s0=|| s1=| in all control paths|}

# err_fallthrough_attr_wrong_target
source: %0 attribute is only allowed on empty statements
root: {$arg0} attribute is only allowed on empty statements

# err_field_declared_as_function
source: field %0 declared as a function
root: field {$arg0} declared as a function

# err_field_designator_non_aggr
source: field designator cannot initialize a %select{non-struct, non-union|non-class}0 type %1
root: field designator cannot initialize a {$arg0 :select s0=|non-struct, non-union| s1=|non-class|} type {$arg1}

# err_field_designator_nonfield
source: field designator %0 does not refer to a non-static data member
root: field designator {$arg0} does not refer to a non-static data member

# err_field_designator_unknown
source: field designator %0 does not refer to any field in type %1
root: field designator {$arg0} does not refer to any field in type {$arg1}

# err_field_designator_unknown_suggest
source: field designator %0 does not refer to any field in type %1; did you mean %2?
root: field designator {$arg0} does not refer to any field in type {$arg1}; did you mean {$arg2}?

# err_field_incomplete_or_sizeless
source: field has %select{incomplete|sizeless}0 type %1
root: field has {$arg0 :select s0=|incomplete| s1=|sizeless|} type {$arg1}

# err_field_instantiates_to_function
source: data member instantiated with function type %0
root: data member instantiated with function type {$arg0}

# err_filter_expression_integral
source: filter expression has non-integral type %0
root: filter expression has non-integral type {$arg0}

# err_final_function_overridden
source: declaration of %0 overrides a '%select{final|sealed}1' function
root: declaration of {$arg0} overrides a '{$arg1 :select s0=|final| s1=|sealed|}' function

# err_first_argument_to_va_arg_not_of_type_va_list
source: first argument to 'va_arg' is of type %0 and not 'va_list'
root: first argument to 'va_arg' is of type {$arg0} and not 'va_list'

# err_flexible_array_has_nontrivial_dtor
source: flexible array member %0 of type %1 with non-trivial destruction
root: flexible array member {$arg0} of type {$arg1} with non-trivial destruction

# err_flexible_array_not_at_end
source: flexible array member %0 with type %1 is not at the end of %select{struct|interface|union|class|enum}2
root: flexible array member {$arg0} with type {$arg1} is not at the end of {$arg2 :select s0=|struct| s1=|interface| s2=|union| s3=|class| s4=|enum|}

# err_flexible_array_virtual_base
source: flexible array member %0 not allowed in %select{struct|interface|union|class|enum}1 which has a virtual base class
root: flexible array member {$arg0} not allowed in {$arg1 :select s0=|struct| s1=|interface| s2=|union| s3=|class| s4=|enum|} which has a virtual base class

# err_fold_expression_empty
source: unary fold expression has empty expansion for operator '%0' with no fallback value
root: unary fold expression has empty expansion for operator '{$arg0}' with no fallback value

# err_fold_expression_limit_exceeded
source: instantiating fold expression with %0 arguments exceeded expression nesting limit of %1
root: instantiating fold expression with {$arg0} arguments exceeded expression nesting limit of {$arg1}

# err_for_range_deduction_failure
source: cannot use type %0 as a range
root: cannot use type {$arg0} as a range

# err_for_range_dereference
source: invalid range expression of type %0; did you mean to dereference it with '*'?
root: invalid range expression of type {$arg0}; did you mean to dereference it with '*'?

# err_for_range_incomplete_type
source: cannot use incomplete type %0 as a range
root: cannot use incomplete type {$arg0} as a range

# err_for_range_invalid
source: invalid range expression of type %0; no viable '%select{begin|end}1' function available
root: invalid range expression of type {$arg0}; no viable '{$arg1 :select s0=|begin| s1=|end|}' function available

# err_for_range_iter_deduction_failure
source: cannot use type %0 as an iterator
root: cannot use type {$arg0} as an iterator

# err_for_range_storage_class
source: loop variable %0 may not be declared %select{'extern'|'static'|'__private_extern__'|'auto'|'register'|'constexpr'|'thread_local'}1
root: loop variable {$arg0} may not be declared {$arg1 :select s0=|'extern'| s1=|'static'| s2=|'__private_extern__'| s3=|'auto'| s4=|'register'| s5=|'constexpr'| s6=|'thread_local'|}

# err_format_attribute_result_not
source: function does not return %0
root: function does not return {$arg0}

# err_forward_superclass
source: attempting to use the forward class %0 as superclass of %1
root: attempting to use the forward class {$arg0} as superclass of {$arg1}

# err_found_in_dependent_base
source: explicit qualification required to use member %0 from dependent base class
root: explicit qualification required to use member {$arg0} from dependent base class

# err_found_later_in_class
source: member %0 used before its declaration
root: member {$arg0} used before its declaration

# err_friend_decl_does_not_match
source: friend declaration of %0 does not match any declaration in %1
root: friend declaration of {$arg0} does not match any declaration in {$arg1}

# err_func_def_incomplete_result
source: incomplete result type %0 in function definition
root: incomplete result type {$arg0} in function definition

# err_func_returning_array_function
source: function cannot return %select{array|function}0 type %1
root: function cannot return {$arg0 :select s0=|array| s1=|function|} type {$arg1}

# err_func_returning_qualified_void
source: function cannot return qualified void type %0
root: function cannot return qualified void type {$arg0}

# err_func_with_effects_no_prototype
source: '%0' function must have a prototype
root: '{$arg0}' function must have a prototype

# err_function_attribute_mismatch
source: function declared with %0 attribute was previously declared without the %0 attribute
root: function declared with {$arg0} attribute was previously declared without the {$arg0} attribute

# err_function_marked_override_not_overriding
source: %0 marked 'override' but does not override any member functions
root: {$arg0} marked 'override' but does not override any member functions

# err_function_member_spec_ambiguous
source: ambiguous member function specialization %q0 of %q1
root: ambiguous member function specialization {$arg0 :q} of {$arg1 :q}

# err_function_parameter_pack_without_parameter_packs
source: type %0 of function parameter pack does not contain any unexpanded parameter packs
root: type {$arg0} of function parameter pack does not contain any unexpanded parameter packs

# err_function_template_spec_ambiguous
source: function template specialization %0 ambiguously refers to more than one function template; explicitly specify%select{| additional}1 template arguments to identify a particular function template
root: function template specialization {$arg0} ambiguously refers to more than one function template; explicitly specify{$arg1 :select s0=|| s1=| additional|} template arguments to identify a particular function template

# err_function_template_spec_no_match
source: no function template matches function template specialization %0
root: no function template matches function template specialization {$arg0}

# err_generic_sel_multi_match
source: controlling expression type %0 compatible with %1 generic association types
root: controlling expression type {$arg0} compatible with {$arg1} generic association types

# err_generic_sel_no_match
source: controlling expression type %0 not compatible with any generic association type
root: controlling expression type {$arg0} not compatible with any generic association type

# err_global_call_not_config
source: call to global function %0 not configured
root: call to global function {$arg0} not configured

# err_goto_ms_asm_label
source: cannot jump from this goto statement to label %0 inside an inline assembly block
root: cannot jump from this goto statement to label {$arg0} inside an inline assembly block

# err_hlsl_attr_invalid_ast_node
source: attribute %0 only applies to %1
root: attribute {$arg0} only applies to {$arg1}

# err_hlsl_attr_invalid_type
source: attribute %0 only applies to a field or parameter of type '%1'
root: attribute {$arg0} only applies to a field or parameter of type '{$arg1}'
