Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# note_type_aware_operator_declared
source: %select{non-|}0type aware %1 declared here in %2
root: {$arg0 :select s0=|non-| s1=||}type aware {$arg1} declared here in {$arg2}

# note_type_incomplete
source: %0 is incomplete
root: {$arg0} is incomplete

# note_type_requirement_substitution_error
source: %select{and|because}0 '%1' would be invalid: %2
root: {$arg0 :select s0=|and| s1=|because|} '{$arg1}' would be invalid: {$arg2}

# note_type_requirement_unknown_substitution_error
source: %select{and|because}0 '%1' would be invalid
root: {$arg0 :select s0=|and| s1=|because|} '{$arg1}' would be invalid

# note_typecheck_assign_const
source: %select{function %1 which returns const-qualified type %2 declared here|variable %1 declared const here|%select{non-|}1static data member %2 declared const here|member function %q1 is declared const here|%select{|nested }1data member %2 declared const here}0
root: %select{function {$arg1} which returns const-qualified type {$arg2} declared here|variable {$arg1} declared const here|{$arg1 :select s0=|non-| s1=||}static data member {$arg2} declared const here|member function {$arg1 :q} is declared const here|{$arg0 :select s0=|| s1=|nested }1data member {$arg2} declared const here|}

# note_typecheck_invalid_operands_converted
source: %select{first|second}0 operand was implicitly converted to type %1
root: {$arg0 :select s0=|first| s1=|second|} operand was implicitly converted to type {$arg1}

# note_typedef_for_linkage_here
source: type is given name %0 for linkage purposes by this %select{typedef|alias}1 declaration
root: type is given name {$arg0} for linkage purposes by this {$arg1 :select s0=|typedef| s1=|alias|} declaration

# note_typename_member_refers_here
source: referenced member %0 is declared here
root: referenced member {$arg0} is declared here

# note_typename_refers_here
source: referenced %0 is declared here
root: referenced {$arg0} is declared here

# note_unguarded_available_silence
source: enclose %0 in %select{an @available|a __builtin_available}1 check to silence this warning
root: enclose {$arg0} in {$arg1 :select s0=|an @available| s1=|a __builtin_available|} check to silence this warning

# note_uninit_fixit_remove_cond
source: remove the %select{'%1' if its condition|condition if it}0 is always %select{false|true}2
root: remove the {$arg0 :select s0=|'{$arg1}' if its condition| s1=|condition if it|} is always {$arg2 :select s0=|false| s1=|true|}

# note_uninit_in_this_constructor
source: during field initialization in %select{this|the implicit default}0 constructor
root: during field initialization in {$arg0 :select s0=|this| s1=|the implicit default|} constructor

# note_uninit_var_use
source: %select{uninitialized use occurs|variable is captured by block}0 here
root: {$arg0 :select s0=|uninitialized use occurs| s1=|variable is captured by block|} here

# note_unlocked_here
source: %0 released here
root: {$arg0} released here

# note_unmatched_type_aware_allocator_declared
source: unmatched type aware %0 declared here
root: unmatched type aware {$arg0} declared here

# note_unreachable_entity
source: %select{declaration|definition|default argument declared|explicit specialization declared|partial specialization declared}0 here is not %select{visible|reachable|reachable|reachable|reachable|reachable}0
root: {$arg0 :select s0=|declaration| s1=|definition| s2=|default argument declared| s3=|explicit specialization declared| s4=|partial specialization declared|} here is not {$arg0 :select s0=|visible| s1=|reachable| s2=|reachable| s3=|reachable| s4=|reachable| s5=|reachable|}

# note_unsafe_buffer_operation
source: used%select{| in pointer arithmetic| in buffer access}0 here
root: used{$arg0 :select s0=|| s1=| in pointer arithmetic| s2=| in buffer access|} here

# note_unsafe_buffer_printf_call
source: %select{|change to 'snprintf' for explicit bounds checking | buffer pointer and size may not match|string argument is not guaranteed to be null-terminated|'va_list' is unsafe}0
root: {$arg0 :select s0=|| s1=|change to 'snprintf' for explicit bounds checking | s2=| buffer pointer and size may not match| s3=|string argument is not guaranteed to be null-terminated| s4=|'va_list' is unsafe|}

# note_unsafe_buffer_variable_fixit_group
source: change type of %0 to '%select{std::span' to preserve bounds information|std::array' to label it for hardening|std::span::iterator' to preserve bounds information}1%select{|, and change %2 to '%select{std::span|std::array|std::span::iterator}1' to propagate bounds information between them}3
root: change type of {$arg0} to '{$arg1 :select s0=|std::span' to preserve bounds information| s1=|std::array' to label it for hardening| s2=|std::span::iterator' to preserve bounds information|}%select{|, and change {$arg2} to '{$arg3 :select s0=|std::span| s1=|std::array| s2=|std::span::iterator}1' to propagate bounds information between them|}

# note_unsafe_buffer_variable_fixit_together
source: change type of %0 to '%select{std::span' to preserve bounds information|std::array' to label it for hardening|std::span::iterator' to preserve bounds information}1%select{|, and change %2 to safe types to make function %4 bounds-safe}3
root: change type of {$arg0} to '{$arg1 :select s0=|std::span' to preserve bounds information| s1=|std::array' to label it for hardening| s2=|std::span::iterator' to preserve bounds information|}{$arg3 :select s0=|| s1=|, and change {$arg2} to safe types to make function {$arg4} bounds-safe|}

# note_use_non_reference_type
source: use non-reference type %0
root: use non-reference type {$arg0}

# note_use_reference_type
source: use reference type %0 to prevent copying
root: use reference type {$arg0} to prevent copying

# note_use_type_or_non_reference
source: use non-reference type %0 to make construction explicit or type %1 to prevent copying
root: use non-reference type {$arg0} to make construction explicit or type {$arg1} to prevent copying

# note_using_decl
source: %select{|previous }0using declaration
root: {$arg0 :select s0=|| s1=|previous |}using declaration

# note_using_decl_class_member_workaround
source: use %select{an alias declaration|a typedef declaration|a reference|a const variable|a constexpr variable}0 instead
root: use {$arg0 :select s0=|an alias declaration| s1=|a typedef declaration| s2=|a reference| s3=|a const variable| s4=|a constexpr variable|} instead

# note_using_enum_decl
source: %select{|previous }0using-enum declaration
root: {$arg0 :select s0=|| s1=|previous |}using-enum declaration

# note_value_initialization_here
source: in value-initialization of type %0 here
root: in value-initialization of type {$arg0} here

# note_var_declared_here
source: variable %0 is declared here
root: variable {$arg0} is declared here

# note_var_explicitly_captured_here
source: variable %0 is%select{| explicitly}1 captured here
root: variable {$arg0} is{$arg1 :select s0=|| s1=| explicitly|} captured here

# note_var_fixit_add_initialization
source: initialize the variable %0 to silence this warning
root: initialize the variable {$arg0} to silence this warning

# note_vbase_moved_here
source: %select{%1 is a virtual base class of base class %2 declared here|virtual base class %1 declared here}0
root: {$arg0 :select s0=|{$arg1} is a virtual base class of base class {$arg2} declared here| s1=|virtual base class {$arg1} declared here|}

# note_widen_bitfield
source: widen this field to %0 bits to store all values of %1
root: widen this field to {$arg0} bits to store all values of {$arg1}

# note_within_field_of_type
source: within field of type %0 declared here
root: within field of type {$arg0} declared here

# note_xor_used_as_pow_silence
source: replace expression with '%0' %select{|or use 'xor' instead of '^' }1to silence this warning
root: replace expression with '{$arg0}' {$arg1 :select s0=|| s1=|or use 'xor' instead of '^' |}to silence this warning

# override_keyword_hides_virtual_member_function
source: non-virtual member function marked '%0' hides virtual member %select{function|functions}1
root: non-virtual member function marked '{$arg0}' hides virtual member {$arg1 :select s0=|function| s1=|functions|}

# override_keyword_only_allowed_on_virtual_member_functions
source: only virtual member functions can be marked '%0'
root: only virtual member functions can be marked '{$arg0}'

# warn_abs_too_small
source: absolute value function %0 given an argument of type %1 but has parameter of type %2 which may cause truncation of value
root: absolute value function {$arg0} given an argument of type {$arg1} but has parameter of type {$arg2} which may cause truncation of value

# warn_abstract_final_class
source: abstract class is marked '%select{final|sealed}0'
root: abstract class is marked '{$arg0 :select s0=|final| s1=|sealed|}'

# warn_abstract_vbase_init_ignored
source: initializer for virtual base class %0 of abstract class %1 will never be used
root: initializer for virtual base class {$arg0} of abstract class {$arg1} will never be used

# warn_acc_deprecated_alias_name
source: OpenACC clause name '%0' is a deprecated clause name and is now an alias for '%1'
root: OpenACC clause name '{$arg0}' is a deprecated clause name and is now an alias for '{$arg1}'

# warn_accessor_property_type_mismatch
source: type of property %0 does not match type of accessor %1
root: type of property {$arg0} does not match type of accessor {$arg1}

# warn_acquire_requires_negative_cap
source: acquiring %0 '%1' requires negative capability '%2'
root: acquiring {$arg0} '{$arg1}' requires negative capability '{$arg2}'

# warn_acquired_before
source: %0 '%1' must be acquired before '%2'
root: {$arg0} '{$arg1}' must be acquired before '{$arg2}'

# warn_acquired_before_after_cycle
source: cycle in acquired_before/after dependencies, starting with '%0'
root: cycle in acquired_before/after dependencies, starting with '{$arg0}'

# warn_addition_in_bitshift
source: operator '%0' has lower precedence than '%1'; '%1' will be evaluated first
root: operator '{$arg0}' has lower precedence than '{$arg1}'; '{$arg1}' will be evaluated first

# warn_address_of_reference_null_compare
source: reference cannot be bound to dereferenced null pointer in well-defined C++ code; comparison may be assumed to always evaluate to %select{true|false}0
root: reference cannot be bound to dereferenced null pointer in well-defined C++ code; comparison may be assumed to always evaluate to {$arg0 :select s0=|true| s1=|false|}

# warn_aligned_attr_underaligned
source: requested alignment is less than minimum alignment of %1 for type %0
root: requested alignment is less than minimum alignment of {$arg1} for type {$arg0}

# warn_alignment_builtin_useless
source: %select{aligning a value|the result of checking whether a value is aligned}0 to 1 byte is %select{a no-op|always true}0
root: {$arg0 :select s0=|aligning a value| s1=|the result of checking whether a value is aligned|} to 1 byte is {$arg0 :select s0=|a no-op| s1=|always true|}

# warn_alloca
source: use of function %0 is discouraged; there is no way to check for failure but failure may still occur, resulting in a possibly exploitable security vulnerability
root: use of function {$arg0} is discouraged; there is no way to check for failure but failure may still occur, resulting in a possibly exploitable security vulnerability

# warn_ambiguous_suitable_delete_function_found
source: multiple suitable %0 functions for %1; no 'operator delete' function will be invoked if initialization throws an exception
root: multiple suitable {$arg0} functions for {$arg1}; no 'operator delete' function will be invoked if initialization throws an exception

# warn_anyx86_excessive_regsave
source: %select{interrupt service routine|function with attribute 'no_caller_saved_registers'}0 should only call a function with attribute 'no_caller_saved_registers' or be compiled with '-mgeneral-regs-only'
root: {$arg0 :select s0=|interrupt service routine| s1=|function with attribute 'no_caller_saved_registers'|} should only call a function with attribute 'no_caller_saved_registers' or be compiled with '-mgeneral-regs-only'

# warn_arc_lifetime_result_type
source: ARC %select{unused|__unsafe_unretained|__strong|__weak|__autoreleasing}0 lifetime qualifier on return type is ignored
root: ARC {$arg0 :select s0=|unused| s1=|__unsafe_unretained| s2=|__strong| s3=|__weak| s4=|__autoreleasing|} lifetime qualifier on return type is ignored

# warn_arc_literal_assign
source: assigning %select{array literal|dictionary literal|numeric literal|boxed expression|<should not happen>|block literal}0 to a weak %select{property|variable}1; object will be released after assignment
root: assigning {$arg0 :select s0=|array literal| s1=|dictionary literal| s2=|numeric literal| s3=|boxed expression| s4=|<should not happen>| s5=|block literal|} to a weak {$arg1 :select s0=|property| s1=|variable|}; object will be released after assignment

# warn_arc_object_memaccess
source: %select{destination for|source of}0 this %1 call is a pointer to ownership-qualified type %2
root: {$arg0 :select s0=|destination for| s1=|source of|} this {$arg1} call is a pointer to ownership-qualified type {$arg2}

# warn_arc_possible_repeated_use_of_weak
source: weak %select{variable|property|implicit property|instance variable}0 %1 may be accessed multiple times in this %select{function|method|block|lambda}2 and may be unpredictably set to nil; assign to a strong variable to keep the object alive
root: weak {$arg0 :select s0=|variable| s1=|property| s2=|implicit property| s3=|instance variable|} {$arg1} may be accessed multiple times in this {$arg2 :select s0=|function| s1=|method| s2=|block| s3=|lambda|} and may be unpredictably set to nil; assign to a strong variable to keep the object alive

# warn_arc_repeated_use_of_weak
source: weak %select{variable|property|implicit property|instance variable}0 %1 is accessed multiple times in this %select{function|method|block|lambda}2 but may be unpredictably set to nil; assign to a strong variable to keep the object alive
root: weak {$arg0 :select s0=|variable| s1=|property| s2=|implicit property| s3=|instance variable|} {$arg1} is accessed multiple times in this {$arg2 :select s0=|function| s1=|method| s2=|block| s3=|lambda|} but may be unpredictably set to nil; assign to a strong variable to keep the object alive

# warn_arc_retain_cycle
source: capturing %0 strongly in this block is likely to lead to a retain cycle
root: capturing {$arg0} strongly in this block is likely to lead to a retain cycle

# warn_arc_retained_assign
source: assigning retained object to %select{weak|unsafe_unretained}0 %select{property|variable}1; object will be released after assignment
root: assigning retained object to {$arg0 :select s0=|weak| s1=|unsafe_unretained|} {$arg1 :select s0=|property| s1=|variable|}; object will be released after assignment

# warn_arc_strong_pointer_objc_pointer
source: method parameter of type %0 with no explicit ownership
root: method parameter of type {$arg0} with no explicit ownership

# warn_argument_invalid_range
source: argument value %0 is outside the valid range [%1, %2]
root: argument value {$arg0} is outside the valid range [{$arg1}, {$arg2}]

# warn_argument_undefined_behaviour
source: argument value %0 will result in undefined behaviour
root: argument value {$arg0} will result in undefined behaviour

# warn_arith_conv_enum_float
source: %select{arithmetic between|bitwise operation between|comparison of|conditional expression between|compound assignment of}0 %select{floating-point|enumeration}1 type %2 %plural{2:with|4:from|:and}0 %select{enumeration|floating-point}1 type %3
root: {$arg0 :select s0=|arithmetic between| s1=|bitwise operation between| s2=|comparison of| s3=|conditional expression between| s4=|compound assignment of|} {$arg1 :select s0=|floating-point| s1=|enumeration|} type {$arg2} %plural{2:with|4:from|:and}0 {$arg1 :select s0=|enumeration| s1=|floating-point|} type {$arg3}

# warn_arith_conv_enum_float_cxx20
source: %select{arithmetic between|bitwise operation between|comparison of|conditional expression between|compound assignment of}0 %select{floating-point|enumeration}1 type %2 %plural{2:with|4:from|:and}0 %select{enumeration|floating-point}1 type %3 is deprecated
root: {$arg0 :select s0=|arithmetic between| s1=|bitwise operation between| s2=|comparison of| s3=|conditional expression between| s4=|compound assignment of|} {$arg1 :select s0=|floating-point| s1=|enumeration|} type {$arg2} %plural{2:with|4:from|:and}0 {$arg1 :select s0=|enumeration| s1=|floating-point|} type {$arg3} is deprecated

# warn_arith_conv_mixed_anon_enum_types
source: %select{arithmetic between|bitwise operation between|comparison of|conditional expression between|compound assignment of}0 different enumeration types%diff{ ($ and $)|}1,2
root: {$arg0 :select s0=|arithmetic between| s1=|bitwise operation between| s2=|comparison of| s3=|conditional expression between| s4=|compound assignment of|} different enumeration types%diff{ ($ and $)|}1,2

# warn_arith_conv_mixed_anon_enum_types_cxx20
source: %select{arithmetic between|bitwise operation between|comparison of|conditional expression between|compound assignment of}0 different enumeration types%diff{ ($ and $)|}1,2 is deprecated
root: {$arg0 :select s0=|arithmetic between| s1=|bitwise operation between| s2=|comparison of| s3=|conditional expression between| s4=|compound assignment of|} different enumeration types%diff{ ($ and $)|}1,2 is deprecated

# warn_arith_conv_mixed_enum_types
source: %select{arithmetic between|bitwise operation between|comparison of|conditional expression between|compound assignment of}0 different enumeration types%diff{ ($ and $)|}1,2
root: {$arg0 :select s0=|arithmetic between| s1=|bitwise operation between| s2=|comparison of| s3=|conditional expression between| s4=|compound assignment of|} different enumeration types%diff{ ($ and $)|}1,2

# warn_arith_conv_mixed_enum_types_cxx20
source: %select{arithmetic between|bitwise operation between|comparison of|conditional expression between|compound assignment of}0 different enumeration types%diff{ ($ and $)|}1,2 is deprecated
root: {$arg0 :select s0=|arithmetic between| s1=|bitwise operation between| s2=|comparison of| s3=|conditional expression between| s4=|compound assignment of|} different enumeration types%diff{ ($ and $)|}1,2 is deprecated

# warn_arith_conv_mixed_unicode_types
source: %select{arithmetic between|bitwise operation between|comparison of|conditional expression between|compound assignment of}0 different Unicode character types %1 and %2
root: {$arg0 :select s0=|arithmetic between| s1=|bitwise operation between| s2=|comparison of| s3=|conditional expression between| s4=|compound assignment of|} different Unicode character types {$arg1} and {$arg2}

# warn_array_index_exceeds_bounds
source: array index %0 is past the end of the array (that has type %1%select{|, cast to %3}2)
root: array index {$arg0} is past the end of the array (that has type {$arg1}{$arg2 :select s0=|| s1=|, cast to {$arg3}|})

# warn_array_index_exceeds_max_addressable_bounds
source: array index %0 refers past the last possible element for an array in %1-bit address space containing %2-bit (%3-byte) elements (max possible %4 element%s5)
root: array index {$arg0} refers past the last possible element for an array in {$arg1}-bit address space containing {$arg2}-bit ({$arg3}-byte) elements (max possible {$arg4} element%s5)

# warn_array_index_precedes_bounds
source: array index %0 is before the beginning of the array
root: array index {$arg0} is before the beginning of the array

# warn_asm_label_on_auto_decl
source: ignored asm label '%0' on automatic variable
root: ignored asm label '{$arg0}' on automatic variable

# warn_assume_aligned_too_great
source: requested alignment must be %0 bytes or smaller; maximum alignment assumed
root: requested alignment must be {$arg0} bytes or smaller; maximum alignment assumed

# warn_at_available_unchecked_use
source: %select{@available|__builtin_available}0 does not guard availability here; use if (%select{@available|__builtin_available}0) instead
root: {$arg0 :select s0=|@available| s1=|__builtin_available|} does not guard availability here; use if ({$arg0 :select s0=|@available| s1=|__builtin_available|}) instead

# warn_atomic_op_has_invalid_memory_order
source: %select{|success |failure }0memory order argument to atomic operation is invalid
root: {$arg0 :select s0=|| s1=|success | s2=|failure |}memory order argument to atomic operation is invalid

# warn_atomic_property_rule
source: writable atomic property %0 cannot pair a synthesized %select{getter|setter}1 with a user defined %select{getter|setter}2
root: writable atomic property {$arg0} cannot pair a synthesized {$arg1 :select s0=|getter| s1=|setter|} with a user defined {$arg2 :select s0=|getter| s1=|setter|}

# warn_attr_abi_tag_namespace
source: 'abi_tag' attribute on %select{non-inline|anonymous}0 namespace ignored
root: 'abi_tag' attribute on {$arg0 :select s0=|non-inline| s1=|anonymous|} namespace ignored

# warn_attr_min_eq_max
source: %0 attribute minimum and maximum arguments are equal
root: {$arg0} attribute minimum and maximum arguments are equal

# warn_attr_on_unconsumable_class
source: consumed analysis attribute is attached to member of class %0 which isn't marked as consumable
root: consumed analysis attribute is attached to member of class {$arg0} which isn't marked as consumable

# warn_attr_swift_name_decl_kind
source: %0 attribute cannot be applied to this declaration
root: {$arg0} attribute cannot be applied to this declaration

# warn_attr_swift_name_decl_missing_params
source: %0 attribute cannot be applied to a %select{function|method}1 with no parameters
root: {$arg0} attribute cannot be applied to a {$arg1 :select s0=|function| s1=|method|} with no parameters

# warn_attr_swift_name_function
source: %0 attribute argument must be a string literal specifying a Swift function name
root: {$arg0} attribute argument must be a string literal specifying a Swift function name

# warn_attr_swift_name_getter_parameters
source: %0 attribute for getter must not have any parameters besides 'self:'
root: {$arg0} attribute for getter must not have any parameters besides 'self:'

# warn_attr_swift_name_invalid_identifier
source: %0 attribute has invalid identifier for the %select{base|context|parameter}1 name
root: {$arg0} attribute has invalid identifier for the {$arg1 :select s0=|base| s1=|context| s2=|parameter|} name

# warn_attr_swift_name_missing_parameters
source: %0 attribute is missing parameter label clause
root: {$arg0} attribute is missing parameter label clause

# warn_attr_swift_name_multiple_selfs
source: %0 attribute cannot specify more than one 'self:' parameter
root: {$arg0} attribute cannot specify more than one 'self:' parameter

# warn_attr_swift_name_num_params
source: too %select{few|many}0 parameters in the signature specified by the %1 attribute (expected %2; got %3)
root: too {$arg0 :select s0=|few| s1=|many|} parameters in the signature specified by the {$arg1} attribute (expected {$arg2}; got {$arg3})

# warn_attr_swift_name_setter_parameters
source: %0 attribute for setter must have one parameter for new value
root: {$arg0} attribute for setter must have one parameter for new value

# warn_attr_swift_name_subscript_getter_newValue
source: %0 attribute for 'subscript' getter cannot have a 'newValue:' parameter
root: {$arg0} attribute for 'subscript' getter cannot have a 'newValue:' parameter

# warn_attr_swift_name_subscript_invalid_parameter
source: %0 attribute for 'subscript' must %select{be a getter or setter|have at least one parameter|have a 'self:' parameter}1
root: {$arg0} attribute for 'subscript' must {$arg1 :select s0=|be a getter or setter| s1=|have at least one parameter| s2=|have a 'self:' parameter|}
