Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# compat_cxx11_nonclass_type_friend
source: non-class friend type %0 is incompatible with C++98
root: non-class friend type {$arg0} is incompatible with C++98

# compat_cxx11_static_data_member_in_union
source: static data member %0 in union is incompatible with C++98
root: static data member {$arg0} in union is incompatible with C++98

# compat_cxx14_constexpr_local_var
source: variable declaration in a constexpr %select{function|constructor}0 is incompatible with C++ standards before C++14
root: variable declaration in a constexpr {$arg0 :select s0=|function| s1=|constructor|} is incompatible with C++ standards before C++14

# compat_cxx14_constexpr_type_definition
source: type definition in a constexpr %select{function|constructor}0 is incompatible with C++ standards before C++14
root: type definition in a constexpr {$arg0 :select s0=|function| s1=|constructor|} is incompatible with C++ standards before C++14

# compat_cxx14_cxx14_constexpr_body_invalid_stmt
source: use of this statement in a constexpr %select{function|constructor}0 is incompatible with C++ standards before C++14
root: use of this statement in a constexpr {$arg0 :select s0=|function| s1=|constructor|} is incompatible with C++ standards before C++14

# compat_cxx20_constexpr_function_try_block
source: function try block in constexpr %select{function|constructor}0 is incompatible with C++ standards before C++20
root: function try block in constexpr {$arg0 :select s0=|function| s1=|constructor|} is incompatible with C++ standards before C++20

# compat_cxx20_constexpr_local_var_no_init
source: uninitialized variable in a constexpr %select{function|constructor}0 is incompatible with C++ standards before C++20
root: uninitialized variable in a constexpr {$arg0 :select s0=|function| s1=|constructor|} is incompatible with C++ standards before C++20

# compat_cxx20_cxx20_constexpr_body_invalid_stmt
source: use of this statement in a constexpr %select{function|constructor}0 is incompatible with C++ standards before C++20
root: use of this statement in a constexpr {$arg0 :select s0=|function| s1=|constructor|} is incompatible with C++ standards before C++20

# compat_cxx20_decomp_decl_spec
source: decomposition declaration declared %plural{1:'%1'|:with '%1' specifiers}0 is incompatible with C++ standards before C++20
root: decomposition declaration declared %plural{1:'{$arg1}'|:with '{$arg1}' specifiers}0 is incompatible with C++ standards before C++20

# compat_cxx20_implicit_typename
source: missing 'typename' prior to dependent type name %0 is incompatible with C++ standards before C++20
root: missing 'typename' prior to dependent type name {$arg0} is incompatible with C++ standards before C++20

# compat_cxx23_constexpr_static_var
source: definition of a %select{static|thread_local}1 variable in a constexpr %select{function|constructor}0 is incompatible with C++ standards before C++23
root: definition of a {$arg1 :select s0=|static| s1=|thread_local|} variable in a constexpr {$arg0 :select s0=|function| s1=|constructor|} is incompatible with C++ standards before C++23

# compat_cxx23_cxx23_constexpr_body_invalid_stmt
source: use of this statement in a constexpr %select{function|constructor}0 is incompatible with C++ standards before C++23
root: use of this statement in a constexpr {$arg0 :select s0=|function| s1=|constructor|} is incompatible with C++ standards before C++23

# compat_pre_cxx11_nonclass_type_friend
source: non-class friend type %0 is a C++11 extension
root: non-class friend type {$arg0} is a C++11 extension

# compat_pre_cxx11_static_data_member_in_union
source: static data member %0 in union is a C++11 extension
root: static data member {$arg0} in union is a C++11 extension

# compat_pre_cxx14_constexpr_local_var
source: variable declaration in a constexpr %select{function|constructor}0 is a C++14 extension
root: variable declaration in a constexpr {$arg0 :select s0=|function| s1=|constructor|} is a C++14 extension

# compat_pre_cxx14_constexpr_type_definition
source: type definition in a constexpr %select{function|constructor}0 is a C++14 extension
root: type definition in a constexpr {$arg0 :select s0=|function| s1=|constructor|} is a C++14 extension

# compat_pre_cxx14_cxx14_constexpr_body_invalid_stmt
source: use of this statement in a constexpr %select{function|constructor}0 is a C++14 extension
root: use of this statement in a constexpr {$arg0 :select s0=|function| s1=|constructor|} is a C++14 extension

# compat_pre_cxx20_constexpr_function_try_block
source: function try block in constexpr %select{function|constructor}0 is a C++20 extension
root: function try block in constexpr {$arg0 :select s0=|function| s1=|constructor|} is a C++20 extension

# compat_pre_cxx20_constexpr_local_var_no_init
source: uninitialized variable in a constexpr %select{function|constructor}0 is a C++20 extension
root: uninitialized variable in a constexpr {$arg0 :select s0=|function| s1=|constructor|} is a C++20 extension

# compat_pre_cxx20_cxx20_constexpr_body_invalid_stmt
source: use of this statement in a constexpr %select{function|constructor}0 is a C++20 extension
root: use of this statement in a constexpr {$arg0 :select s0=|function| s1=|constructor|} is a C++20 extension

# compat_pre_cxx20_decomp_decl_spec
source: decomposition declaration declared %plural{1:'%1'|:with '%1' specifiers}0 is a C++20 extension
root: decomposition declaration declared %plural{1:'{$arg1}'|:with '{$arg1}' specifiers}0 is a C++20 extension

# compat_pre_cxx20_implicit_typename
source: missing 'typename' prior to dependent type name %0 is a C++20 extension
root: missing 'typename' prior to dependent type name {$arg0} is a C++20 extension

# compat_pre_cxx23_constexpr_static_var
source: definition of a %select{static|thread_local}1 variable in a constexpr %select{function|constructor}0 is a C++23 extension
root: definition of a {$arg1 :select s0=|static| s1=|thread_local|} variable in a constexpr {$arg0 :select s0=|function| s1=|constructor|} is a C++23 extension

# compat_pre_cxx23_cxx23_constexpr_body_invalid_stmt
source: use of this statement in a constexpr %select{function|constructor}0 is a C++23 extension
root: use of this statement in a constexpr {$arg0 :select s0=|function| s1=|constructor|} is a C++23 extension

# err_abstract_type_in_decl
source: %select{return|parameter|variable|field|instance variable|synthesized instance variable}0 type %1 is an abstract class
root: {$arg0 :select s0=|return| s1=|parameter| s2=|variable| s3=|field| s4=|instance variable| s5=|synthesized instance variable|} type {$arg1} is an abstract class

# err_acc_clause_appertainment
source: OpenACC '%1' clause is not valid on '%0' directive
root: OpenACC '{$arg1}' clause is not valid on '{$arg0}' directive

# err_acc_clause_conflicts_prev_dev_type
source: OpenACC '%0' clause applies to 'device_type' '%1', which conflicts with previous '%0' clause
root: OpenACC '{$arg0}' clause applies to 'device_type' '{$arg1}', which conflicts with previous '{$arg0}' clause

# err_acc_clause_in_clause_region
source: loop with a '%0' clause may not exist in the region of a '%1' clause%select{| on a '%3' construct}2
root: loop with a '{$arg0}' clause may not exist in the region of a '{$arg1}' clause{$arg2 :select s0=|| s1=| on a '{$arg3}' construct|}

# err_acc_clause_multiple_loops
source: more than one for-loop in a loop associated with OpenACC '%0' construct with a '%1' clause
root: more than one for-loop in a loop associated with OpenACC '{$arg0}' construct with a '{$arg1}' clause

# err_acc_clause_routine_cannot_combine_before_device_type
source: OpenACC clause '%0' after 'device_type' clause on a 'routine' conflicts with the '%1' clause before the first 'device_type'
root: OpenACC clause '{$arg0}' after 'device_type' clause on a 'routine' conflicts with the '{$arg1}' clause before the first 'device_type'

# err_acc_clause_routine_cannot_combine_same_device_type
source: OpenACC clause '%0' on a 'routine' directive conflicts with the '%1' clause applying to the same 'device_type'
root: OpenACC clause '{$arg0}' on a 'routine' directive conflicts with the '{$arg1}' clause applying to the same 'device_type'

# err_acc_clause_since_last_device_type
source: OpenACC '%0' clause cannot appear more than once%select{| in a 'device_type' region}2 on a '%1' directive
root: OpenACC '{$arg0}' clause cannot appear more than once{$arg2 :select s0=|| s1=| in a 'device_type' region|} on a '{$arg1}' directive

# err_acc_collapse_loop_count
source: OpenACC 'collapse' clause loop count must be a %select{constant expression|positive integer value, evaluated to %1}0
root: OpenACC 'collapse' clause loop count must be a {$arg0 :select s0=|constant expression| s1=|positive integer value, evaluated to {$arg1}|}

# err_acc_construct_appertainment
source: OpenACC construct '%0' cannot be used here; it can only be used in a statement context
root: OpenACC construct '{$arg0}' cannot be used here; it can only be used in a statement context

# err_acc_construct_one_clause_of
source: OpenACC '%0' construct must have at least one %1 clause
root: OpenACC '{$arg0}' construct must have at least one {$arg1} clause

# err_acc_declare_clause_at_global
source: OpenACC '%0' clause on a 'declare' directive is not allowed at global or namespace scope
root: OpenACC '{$arg0}' clause on a 'declare' directive is not allowed at global or namespace scope

# err_acc_declare_extern
source: 'extern' variable may not be referenced by '%0' clause on an OpenACC 'declare' directive
root: 'extern' variable may not be referenced by '{$arg0}' clause on an OpenACC 'declare' directive

# err_acc_declare_same_scope
source: variable appearing in '%0' clause of OpenACC 'declare' directive must be in the same scope as the directive
root: variable appearing in '{$arg0}' clause of OpenACC 'declare' directive must be in the same scope as the directive

# err_acc_duplicate_clause_disallowed
source: OpenACC '%1' clause cannot appear more than once on a '%0' directive
root: OpenACC '{$arg1}' clause cannot appear more than once on a '{$arg0}' directive

# err_acc_gang_dim_value
source: argument to 'gang' clause dimension must be %select{a constant expression|1, 2, or 3: evaluated to %1}0
root: argument to 'gang' clause dimension must be {$arg0 :select s0=|a constant expression| s1=|1, 2, or 3: evaluated to {$arg1}|}

# err_acc_gang_multiple_elt
source: OpenACC 'gang' clause may have at most one %select{unnamed or 'num'|'dim'|'static'}0 argument
root: OpenACC 'gang' clause may have at most one {$arg0 :select s0=|unnamed or 'num'| s1=|'dim'| s2=|'static'|} argument

# err_acc_gang_reduction_conflict
source: %select{OpenACC 'gang' clause with a 'dim' value greater than 1|OpenACC 'reduction' clause}0 cannot appear on the same '%1' construct as a %select{'reduction' clause|'gang' clause with a 'dim' value greater than 1}0
root: {$arg0 :select s0=|OpenACC 'gang' clause with a 'dim' value greater than 1| s1=|OpenACC 'reduction' clause|} cannot appear on the same '{$arg1}' construct as a {$arg0 :select s0=|'reduction' clause| s1=|'gang' clause with a 'dim' value greater than 1|}

# err_acc_gang_reduction_numgangs_conflict
source: OpenACC '%0' clause cannot appear on the same '%2' construct as a '%1' clause %select{inside a compute construct with a|and a}3 'num_gangs' clause with more than one argument
root: OpenACC '{$arg0}' clause cannot appear on the same '{$arg2}' construct as a '{$arg1}' clause {$arg3 :select s0=|inside a compute construct with a| s1=|and a|} 'num_gangs' clause with more than one argument

# err_acc_insufficient_loops
source: '%0' clause specifies a loop count greater than the number of available loops
root: '{$arg0}' clause specifies a loop count greater than the number of available loops

# err_acc_int_arg_invalid
source: '%0' argument on '%1' clause is not permitted on a%select{|n orphaned}2 '%3' construct%select{| associated with a '%5' compute construct}4
root: '{$arg0}' argument on '{$arg1}' clause is not permitted on a{$arg2 :select s0=|| s1=|n orphaned|} '{$arg3}' construct{$arg4 :select s0=|| s1=| associated with a '{$arg5}' compute construct|}

# err_acc_int_expr_incomplete_class_type
source: OpenACC integer expression has incomplete class type %0
root: OpenACC integer expression has incomplete class type {$arg0}

# err_acc_int_expr_multiple_conversions
source: multiple conversions from expression type %0 to an integral type
root: multiple conversions from expression type {$arg0} to an integral type

# err_acc_int_expr_requires_integer
source: OpenACC %select{clause '%1'|directive '%2'|sub-array bound}0 requires expression of integer type (%3 invalid)
root: OpenACC {$arg0 :select s0=|clause '{$arg1}'| s1=|directive '{$arg2}'| s2=|sub-array bound|} requires expression of integer type ({$arg3} invalid)

# err_acc_intervening_code
source: inner loops must be tightly nested inside a '%0' clause on a '%1' construct
root: inner loops must be tightly nested inside a '{$arg0}' clause on a '{$arg1}' construct

# err_acc_invalid_atomic
source: statement associated with OpenACC 'atomic%select{| %1}0' directive is invalid
root: statement associated with OpenACC 'atomic{$arg0 :select s0=|| s1=| {$arg1}|}' directive is invalid

# err_acc_invalid_default_type
source: invalid value %0 in '%1' clause; valid values are %2
root: invalid value {$arg0} in '{$arg1}' clause; valid values are {$arg2}

# err_acc_invalid_in_loop
source: %select{OpenACC '%3' construct|while loop|do loop}0 cannot appear in intervening code of a '%1' with a '%2' clause
root: {$arg0 :select s0=|OpenACC '{$arg3}' construct| s1=|while loop| s2=|do loop|} cannot appear in intervening code of a '{$arg1}' with a '{$arg2}' clause

# err_acc_invalid_modifier
source: OpenACC '%0' modifier not valid on '%1' clause
root: OpenACC '{$arg0}' modifier not valid on '{$arg1}' clause

# err_acc_loop_not_monotonic
source: OpenACC '%0' variable must monotonically increase or decrease ('++', '--', or compound assignment)
root: OpenACC '{$arg0}' variable must monotonically increase or decrease ('++', '--', or compound assignment)

# err_acc_loop_terminating_condition
source: OpenACC '%0' construct must have a terminating condition
root: OpenACC '{$arg0}' construct must have a terminating condition

# err_acc_loop_variable
source: OpenACC '%0' construct must have initialization clause in canonical form ('var = init' or 'T var = init')
root: OpenACC '{$arg0}' construct must have initialization clause in canonical form ('var = init' or 'T var = init')

# err_acc_loop_variable_type
source: loop variable of loop associated with an OpenACC '%0' construct must be of integer, pointer, or random-access-iterator type (is %1)
root: loop variable of loop associated with an OpenACC '{$arg0}' construct must be of integer, pointer, or random-access-iterator type (is {$arg1})

# err_acc_multiple_references
source: variable referenced in '%0' clause of OpenACC 'declare' directive was already referenced
root: variable referenced in '{$arg0}' clause of OpenACC 'declare' directive was already referenced

# err_acc_not_a_var_ref
source: OpenACC variable is not a valid variable name, sub-array, array element,%select{| member of a composite variable,}0 or composite variable member
root: OpenACC variable is not a valid variable name, sub-array, array element,{$arg0 :select s0=|| s1=| member of a composite variable,|} or composite variable member

# err_acc_not_a_var_ref_use_device_declare
source: OpenACC variable %select{in 'use_device' clause|on 'declare' construct}0 is not a valid variable name or array name
root: OpenACC variable {$arg0 :select s0=|in 'use_device' clause| s1=|on 'declare' construct|} is not a valid variable name or array name

# err_acc_num_arg_conflict
source: '%0' argument to '%1' clause not allowed on a '%2' construct%select{| associated with a '%4' construct}3 that has a '%5' clause
root: '{$arg0}' argument to '{$arg1}' clause not allowed on a '{$arg2}' construct{$arg3 :select s0=|| s1=| associated with a '{$arg4}' construct|} that has a '{$arg5}' clause

# err_acc_num_arg_conflict_reverse
source: '%0' clause not allowed on a 'kernels loop' construct that has a '%1' clause with a%select{n| 'num'}2 argument
root: '{$arg0}' clause not allowed on a 'kernels loop' construct that has a '{$arg1}' clause with a{$arg2 :select s0=|n| s1=| 'num'|} argument

# err_acc_num_gangs_num_args
source: %select{no|too many}0 integer expression arguments provided to OpenACC 'num_gangs' %select{|clause: '%1' directive expects maximum of %2, %3 were provided}0
root: {$arg0 :select s0=|no| s1=|too many|} integer expression arguments provided to OpenACC 'num_gangs' {$arg0 :select s0=|| s1=|clause: '{$arg1}' directive expects maximum of {$arg2}, {$arg3} were provided|}

# err_acc_reduction_composite_type
source: OpenACC 'reduction' variable must be a composite of scalar types; %1 %select{is not a class or struct|is incomplete|is not an aggregate}0
root: OpenACC 'reduction' variable must be a composite of scalar types; {$arg1} {$arg0 :select s0=|is not a class or struct| s1=|is incomplete| s2=|is not an aggregate|}

# err_acc_reduction_type
source: OpenACC 'reduction' variable must be of scalar type, sub-array, or a composite of scalar types;%select{| sub-array base}1 type is %0
root: OpenACC 'reduction' variable must be of scalar type, sub-array, or a composite of scalar types;{$arg1 :select s0=|| s1=| sub-array base|} type is {$arg0}

# err_acc_routine_not_func
source: OpenACC routine name %0 does not name a function
root: OpenACC routine name {$arg0} does not name a function

# err_acc_routine_overload_set
source: OpenACC routine name %0 names a set of overloads
root: OpenACC routine name {$arg0} names a set of overloads

# err_acc_size_expr_value
source: OpenACC 'tile' clause size expression must be %select{an asterisk or a constant expression|positive integer value, evaluated to %1}0
root: OpenACC 'tile' clause size expression must be {$arg0 :select s0=|an asterisk or a constant expression| s1=|positive integer value, evaluated to {$arg1}|}

# err_acc_subarray_base_plus_length_out_of_range
source: OpenACC sub-array specified range [%0:%1] would be out of the range of the subscripted array size of %2
root: OpenACC sub-array specified range [{$arg0}:{$arg1}] would be out of the range of the subscripted array size of {$arg2}

# err_acc_subarray_function_type
source: OpenACC sub-array cannot be of function type %0
root: OpenACC sub-array cannot be of function type {$arg0}

# err_acc_subarray_incomplete_type
source: OpenACC sub-array base is of incomplete type %0
root: OpenACC sub-array base is of incomplete type {$arg0}

# err_acc_subarray_negative
source: OpenACC sub-array %select{lower bound|length}0 evaluated to negative value %1
root: OpenACC sub-array {$arg0 :select s0=|lower bound| s1=|length|} evaluated to negative value {$arg1}

# err_acc_subarray_no_length
source: OpenACC sub-array length is unspecified and cannot be inferred because the subscripted value is %select{not an array|an array of unknown bound}0
root: OpenACC sub-array length is unspecified and cannot be inferred because the subscripted value is {$arg0 :select s0=|not an array| s1=|an array of unknown bound|}

# err_acc_subarray_out_of_range
source: OpenACC sub-array %select{lower bound|length}0 evaluated to a value (%1) that would be out of the range of the subscripted array size of %2
root: OpenACC sub-array {$arg0 :select s0=|lower bound| s1=|length|} evaluated to a value ({$arg1}) that would be out of the range of the subscripted array size of {$arg2}

# err_acc_update_as_body
source: OpenACC 'update' construct may not appear in place of the statement following a%select{n if statement| while statement| do statement| switch statement| label statement}0
root: OpenACC 'update' construct may not appear in place of the statement following a{$arg0 :select s0=|n if statement| s1=| while statement| s2=| do statement| s3=| switch statement| s4=| label statement|}

# err_acc_var_not_pointer_type
source: expected pointer in '%0' clause, type is %1
root: expected pointer in '{$arg0}' clause, type is {$arg1}

# err_access
source: %1 is a %select{private|protected}0 member of %3
root: {$arg1} is a {$arg0 :select s0=|private| s1=|protected|} member of {$arg3}

# err_access_base_ctor
source: %select{base class|inherited virtual base class}0 %1 has %select{private|protected}3 %select{default |copy |move |*ERROR* |*ERROR* |*ERROR*|}2constructor
root: {$arg0 :select s0=|base class| s1=|inherited virtual base class|} {$arg1} has {$arg3 :select s0=|private| s1=|protected|} {$arg2 :select s0=|default | s1=|copy | s2=|move | s3=|*ERROR* | s4=|*ERROR* | s5=|*ERROR*| s6=||}constructor

# err_access_ctor
source: calling a %select{private|protected}0 constructor of class %2
root: calling a {$arg0 :select s0=|private| s1=|protected|} constructor of class {$arg2}

# err_access_dtor
source: calling a %select{private|protected}1 destructor of class %0
root: calling a {$arg1 :select s0=|private| s1=|protected|} destructor of class {$arg0}

# err_access_dtor_base
source: base class %0 has %select{private|protected}1 destructor
root: base class {$arg0} has {$arg1 :select s0=|private| s1=|protected|} destructor

# err_access_dtor_exception
source: exception object of type %0 has %select{private|protected}1 destructor
root: exception object of type {$arg0} has {$arg1 :select s0=|private| s1=|protected|} destructor

# err_access_dtor_field
source: field of type %1 has %select{private|protected}2 destructor
root: field of type {$arg1} has {$arg2 :select s0=|private| s1=|protected|} destructor

# err_access_dtor_ivar
source: instance variable of type %0 has %select{private|protected}1 destructor
root: instance variable of type {$arg0} has {$arg1 :select s0=|private| s1=|protected|} destructor

# err_access_dtor_temp
source: temporary of type %0 has %select{private|protected}1 destructor
root: temporary of type {$arg0} has {$arg1 :select s0=|private| s1=|protected|} destructor

# err_access_dtor_var
source: variable of type %1 has %select{private|protected}2 destructor
root: variable of type {$arg1} has {$arg2 :select s0=|private| s1=|protected|} destructor

# err_access_dtor_vbase
source: inherited virtual base class %1 has %select{private|protected}2 destructor
root: inherited virtual base class {$arg1} has {$arg2 :select s0=|private| s1=|protected|} destructor

# err_access_field_ctor
source: field of type %0 has %select{private|protected}2 %select{default |copy |move |*ERROR* |*ERROR* |*ERROR* |}1constructor
root: field of type {$arg0} has {$arg2 :select s0=|private| s1=|protected|} {$arg1 :select s0=|default | s1=|copy | s2=|move | s3=|*ERROR* | s4=|*ERROR* | s5=|*ERROR* | s6=||}constructor

# err_access_friend_function
source: friend function %1 is a %select{private|protected}0 member of %3
root: friend function {$arg1} is a {$arg0 :select s0=|private| s1=|protected|} member of {$arg3}

# err_access_lambda_capture
source: capture of variable '%0' as type %1 calls %select{private|protected}3 %select{default |copy |move |*ERROR* |*ERROR* |*ERROR* |}2constructor
root: capture of variable '{$arg0}' as type {$arg1} calls {$arg3 :select s0=|private| s1=|protected|} {$arg2 :select s0=|default | s1=|copy | s2=|move | s3=|*ERROR* | s4=|*ERROR* | s5=|*ERROR* | s6=||}constructor

# err_addr_ovl_ambiguous
source: address of overloaded function %0 is ambiguous
root: address of overloaded function {$arg0} is ambiguous

# err_addr_ovl_no_qualifier
source: cannot form member pointer of type %0 without '&' and class name
root: cannot form member pointer of type {$arg0} without '&' and class name

# err_addr_ovl_no_viable
source: address of overloaded function %0 does not match required type %1
root: address of overloaded function {$arg0} does not match required type {$arg1}
