Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# ext_cxx23_attr
source: use of the %0 attribute is a C++23 extension
root: use of the {$arg0} attribute is a C++23 extension

# ext_default_init_const
source: default initialization of an object of const type %0%select{| without a user-provided default constructor}1 is a Microsoft extension
root: default initialization of an object of const type {$arg0}{$arg1 :select s0=|| s1=| without a user-provided default constructor|} is a Microsoft extension

# ext_delete_void_ptr_operand
source: cannot delete expression with pointer-to-'void' type %0
root: cannot delete expression with pointer-to-'void' type {$arg0}

# ext_deprecated_string_literal_conversion
source: ISO C++11 does not allow conversion from string literal to %0
root: ISO C++11 does not allow conversion from string literal to {$arg0}

# ext_designated_init_reordered
source: ISO C++ requires field designators to be specified in declaration order; field %1 will be initialized after field %0
root: ISO C++ requires field designators to be specified in declaration order; field {$arg1} will be initialized after field {$arg0}

# ext_destructor_typedef_name
source: destructor cannot be declared using a %select{typedef|type alias}1 %0 of the class name
root: destructor cannot be declared using a {$arg1 :select s0=|typedef| s1=|type alias|} {$arg0} of the class name

# ext_empty_struct_union
source: empty %select{struct|union}0 is a GNU extension
root: empty {$arg0 :select s0=|struct| s1=|union|} is a GNU extension

# ext_enumerator_increment_too_large
source: incremented enumerator value %0 is not representable in the largest integer type
root: incremented enumerator value {$arg0} is not representable in the largest integer type

# ext_enumerator_too_large
source: enumerator value is not representable in the underlying type %0
root: enumerator value is not representable in the underlying type {$arg0}

# ext_equivalent_internal_linkage_decl_in_modules
source: ambiguous use of internal linkage declaration %0 defined in multiple modules
root: ambiguous use of internal linkage declaration {$arg0} defined in multiple modules

# ext_excess_initializers
source: excess elements in %select{array|vector|scalar|union|struct}0 initializer
root: excess elements in {$arg0 :select s0=|array| s1=|vector| s2=|scalar| s3=|union| s4=|struct|} initializer

# ext_excess_initializers_for_sizeless_type
source: excess elements in initializer for indivisible sizeless type %0
root: excess elements in initializer for indivisible sizeless type {$arg0}

# ext_explicit_instantiation_duplicate
source: duplicate explicit instantiation of %0 ignored as a Microsoft extension
root: duplicate explicit instantiation of {$arg0} ignored as a Microsoft extension

# ext_explicit_instantiation_without_qualified_id
source: qualifier in explicit instantiation of %q0 requires a template-id (a typedef is not permitted)
root: qualifier in explicit instantiation of {$arg0 :q} requires a template-id (a typedef is not permitted)

# ext_expr_not_ice
source: expression is not an %select{integer|integral}0 constant expression; folding it to a constant is a GNU extension
root: expression is not an {$arg0 :select s0=|integer| s1=|integral|} constant expression; folding it to a constant is a GNU extension

# ext_flexible_array_empty_aggregate_gnu
source: flexible array member %0 in otherwise empty %select{struct|interface|union|class|enum}1 is a GNU extension
root: flexible array member {$arg0} in otherwise empty {$arg1 :select s0=|struct| s1=|interface| s2=|union| s3=|class| s4=|enum|} is a GNU extension

# ext_flexible_array_empty_aggregate_ms
source: flexible array member %0 in otherwise empty %select{struct|interface|union|class|enum}1 is a Microsoft extension
root: flexible array member {$arg0} in otherwise empty {$arg1 :select s0=|struct| s1=|interface| s2=|union| s3=|class| s4=|enum|} is a Microsoft extension

# ext_flexible_array_in_array
source: %0 may not be used as an array element due to flexible array member
root: {$arg0} may not be used as an array element due to flexible array member

# ext_flexible_array_in_struct
source: %0 may not be nested in a struct due to flexible array member
root: {$arg0} may not be nested in a struct due to flexible array member

# ext_flexible_array_union_gnu
source: flexible array member %0 in a union is a GNU extension
root: flexible array member {$arg0} in a union is a GNU extension

# ext_flexible_array_union_ms
source: flexible array member %0 in a union is a Microsoft extension
root: flexible array member {$arg0} in a union is a Microsoft extension

# ext_for_range_begin_end_types_differ
source: 'begin' and 'end' returning different types (%0 and %1) is a C++17 extension
root: 'begin' and 'end' returning different types ({$arg0} and {$arg1}) is a C++17 extension

# ext_forward_ref_enum_def
source: redeclaration of already-defined enum %0 is a GNU extension
root: redeclaration of already-defined enum {$arg0} is a GNU extension

# ext_found_in_dependent_base
source: use of member %0 found via unqualified lookup into dependent bases of class templates is a Microsoft extension
root: use of member {$arg0} found via unqualified lookup into dependent bases of class templates is a Microsoft extension

# ext_found_later_in_class
source: use of member %0 before its declaration is a Microsoft extension
root: use of member {$arg0} before its declaration is a Microsoft extension

# ext_gnu_ptr_func_arith
source: arithmetic on%select{ a|}0 pointer%select{|s}0 to%select{ the|}2 function type%select{|s}2 %1%select{| and %3}2 is a GNU extension
root: arithmetic on{$arg0 :select s0=| a| s1=||} pointer{$arg0 :select s0=|| s1=|s|} to{$arg2 :select s0=| the| s1=||} function type{$arg2 :select s0=|| s1=|s|} {$arg1}{$arg2 :select s0=|| s1=| and {$arg3}|} is a GNU extension

# ext_gnu_void_ptr
source: arithmetic on%select{ a|}0 pointer%select{|s}0 to void is a GNU extension
root: arithmetic on{$arg0 :select s0=| a| s1=||} pointer{$arg0 :select s0=|| s1=|s|} to void is a GNU extension

# ext_hlsl_auto_type_specifier
source: 'auto' type specifier is a %select{C++11|HLSL 202y}0 extension
root: 'auto' type specifier is a {$arg0 :select s0=|C++11| s1=|HLSL 202y|} extension

# ext_implicit_exception_spec_mismatch
source: function previously declared with an %select{explicit|implicit}0 exception specification redeclared with an %select{implicit|explicit}0 exception specification
root: function previously declared with an {$arg0 :select s0=|explicit| s1=|implicit|} exception specification redeclared with an {$arg0 :select s0=|implicit| s1=|explicit|} exception specification

# ext_implicit_function_decl_c99
source: call to undeclared function %0; ISO C99 and later do not support implicit function declarations
root: call to undeclared function {$arg0}; ISO C99 and later do not support implicit function declarations

# ext_implicit_lib_function_decl
source: implicitly declaring library function '%0' with type %1
root: implicitly declaring library function '{$arg0}' with type {$arg1}

# ext_implicit_lib_function_decl_c99
source: call to undeclared library function '%0' with type %1; ISO C99 and later do not support implicit function declarations
root: call to undeclared library function '{$arg0}' with type {$arg1}; ISO C99 and later do not support implicit function declarations

# ext_in_class_initializer_float_type
source: in-class initializer for static data member of type %0 is a GNU extension
root: in-class initializer for static data member of type {$arg0} is a GNU extension

# ext_in_class_initializer_float_type_cxx11
source: in-class initializer for static data member of type %0 requires 'constexpr' specifier
root: in-class initializer for static data member of type {$arg0} requires 'constexpr' specifier

# ext_incomplete_in_exception_spec
source: %select{|pointer to |reference to }0incomplete type %1 is not allowed in exception specification
root: {$arg0 :select s0=|| s1=|pointer to | s2=|reference to |}incomplete type {$arg1} is not allowed in exception specification

# ext_init_list_constant_narrowing
source: constant expression evaluates to %0 which cannot be narrowed to type %1
root: constant expression evaluates to {$arg0} which cannot be narrowed to type {$arg1}

# ext_init_list_constant_narrowing_const_reference
source: constant expression evaluates to %0 which cannot be narrowed to type %1
root: constant expression evaluates to {$arg0} which cannot be narrowed to type {$arg1}

# ext_init_list_type_narrowing
source: type %0 cannot be narrowed to %1 in initializer list
root: type {$arg0} cannot be narrowed to {$arg1} in initializer list

# ext_init_list_type_narrowing_const_reference
source: type %0 cannot be narrowed to %1 in initializer list
root: type {$arg0} cannot be narrowed to {$arg1} in initializer list

# ext_init_list_variable_narrowing
source: non-constant-expression cannot be narrowed from type %0 to %1 in initializer list
root: non-constant-expression cannot be narrowed from type {$arg0} to {$arg1} in initializer list

# ext_init_list_variable_narrowing_const_reference
source: non-constant-expression cannot be narrowed from type %0 to %1 in initializer list
root: non-constant-expression cannot be narrowed from type {$arg0} to {$arg1} in initializer list

# ext_initializer_overrides
source: initializer %select{partially |}0overrides prior initialization of this subobject
root: initializer {$arg0 :select s0=|partially | s1=||}overrides prior initialization of this subobject

# ext_initializer_union_overrides
source: initializer %select{partially |}0overrides prior initialization of this subobject
root: initializer {$arg0 :select s0=|partially | s1=||}overrides prior initialization of this subobject

# ext_integer_complement_complex
source: ISO C does not support '~' for complex conjugation of %0
root: ISO C does not support '~' for complex conjugation of {$arg0}

# ext_internal_in_extern_inline
source: static %select{function|variable}0 %1 is used in an inline function with external linkage
root: static {$arg0 :select s0=|function| s1=|variable|} {$arg1} is used in an inline function with external linkage

# ext_internal_in_extern_inline_quiet
source: static %select{function|variable}0 %1 is used in an inline function with external linkage
root: static {$arg0 :select s0=|function| s1=|variable|} {$arg1} is used in an inline function with external linkage

# ext_main_invalid_linkage_specification
source: 'main' should not be 'extern "%select{C|C++}0"'
root: 'main' should not be 'extern "{$arg0 :select s0=|C| s1=|C++|}"'

# ext_many_braces_around_init
source: too many braces around %select{scalar |}0initializer
root: too many braces around {$arg0 :select s0=|scalar | s1=||}initializer

# ext_missing_exception_specification
source: %0 is missing exception specification '%1'
root: {$arg0} is missing exception specification '{$arg1}'

# ext_module_import_in_extern_c
source: import of C++ module '%0' appears within extern "C" language linkage specification
root: import of C++ module '{$arg0}' appears within extern "C" language linkage specification

# ext_module_import_not_at_top_level_noop
source: redundant #include of module '%0' appears within %1
root: redundant #include of module '{$arg0}' appears within {$arg1}

# ext_ms_ambiguous_direct_base
source: accessing inaccessible direct base %0 of %1 is a Microsoft extension
root: accessing inaccessible direct base {$arg0} of {$arg1} is a Microsoft extension

# ext_ms_anonymous_record
source: anonymous %select{structs|unions}0 are a Microsoft extension
root: anonymous {$arg0 :select s0=|structs| s1=|unions|} are a Microsoft extension

# ext_ms_delayed_template_argument
source: using the undeclared type %0 as a default template argument is a Microsoft extension
root: using the undeclared type {$arg0} as a default template argument is a Microsoft extension

# ext_ms_template_spec_redecl_out_of_scope
source: %select{class template|class template partial|variable template|variable template partial|function template|member function|static data member|member class|member enumeration}0 specialization of %1 not in %select{a namespace enclosing %2|class %2 or an enclosing namespace}3 is a Microsoft extension
root: {$arg0 :select s0=|class template| s1=|class template partial| s2=|variable template| s3=|variable template partial| s4=|function template| s5=|member function| s6=|static data member| s7=|member class| s8=|member enumeration|} specialization of {$arg1} not in {$arg3 :select s0=|a namespace enclosing {$arg2}| s1=|class {$arg2} or an enclosing namespace|} is a Microsoft extension

# ext_ms_using_declaration_inaccessible
source: using declaration referring to inaccessible member '%0' (which refers to accessible member '%1') is a Microsoft compatibility extension
root: using declaration referring to inaccessible member '{$arg0}' (which refers to accessible member '{$arg1}') is a Microsoft compatibility extension

# ext_nested_name_member_ref_lookup_ambiguous
source: lookup of %0 in member access expression is ambiguous; using member of %1
root: lookup of {$arg0} in member access expression is ambiguous; using member of {$arg1}

# ext_no_named_members_in_struct_union
source: %select{struct|union}0 without named members is a GNU extension
root: {$arg0 :select s0=|struct| s1=|union|} without named members is a GNU extension

# ext_non_c_like_anon_struct_in_typedef
source: anonymous non-C-compatible type given name for linkage purposes by %select{typedef|alias}0 declaration; add a tag name here
root: anonymous non-C-compatible type given name for linkage purposes by {$arg0 :select s0=|typedef| s1=|alias|} declaration; add a tag name here

# ext_opencl_ext_vector_type_rgba_selector
source: vector component name '%0' is a feature from OpenCL version 3.0 onwards
root: vector component name '{$arg0}' is a feature from OpenCL version 3.0 onwards

# ext_operator_new_delete_declared_inline
source: replacement function %0 cannot be declared 'inline'
root: replacement function {$arg0} cannot be declared 'inline'

# ext_operator_overload_static
source: declaring overloaded %0 as 'static' is a C++23 extension
root: declaring overloaded {$arg0} as 'static' is a C++23 extension

# ext_out_of_line_qualified_id_type_names_constructor
source: ISO C++ specifies that qualified reference to %0 is a constructor name rather than a %select{template name|type}1 in this context, despite preceding %select{'typename'|'template'}2 keyword
root: ISO C++ specifies that qualified reference to {$arg0} is a constructor name rather than a {$arg1 :select s0=|template name| s1=|type|} in this context, despite preceding {$arg2 :select s0=|'typename'| s1=|'template'|} keyword

# ext_ovl_ambiguous_oper_binary_reversed
source: ISO C++20 considers use of overloaded operator '%0' (with operand types %1 and %2) to be ambiguous despite there being a unique best viable function%select{ with non-reversed arguments|}3
root: ISO C++20 considers use of overloaded operator '{$arg0}' (with operand types {$arg1} and {$arg2}) to be ambiguous despite there being a unique best viable function{$arg3 :select s0=| with non-reversed arguments| s1=||}

# ext_ovl_rewrite_equalequal_not_bool
source: ISO C++20 requires return type of selected 'operator==' function for rewritten '%1' comparison to be 'bool', not %0
root: ISO C++20 requires return type of selected 'operator==' function for rewritten '{$arg1}' comparison to be 'bool', not {$arg0}

# ext_param_not_declared
source: parameter %0 was not declared, defaults to 'int'; ISO C99 and later do not support implicit int
root: parameter {$arg0} was not declared, defaults to 'int'; ISO C99 and later do not support implicit int

# ext_partial_spec_not_more_specialized_than_primary
source: %select{class|variable}0 template partial specialization is not more specialized than the primary template
root: {$arg0 :select s0=|class| s1=|variable|} template partial specialization is not more specialized than the primary template

# ext_partial_specs_not_deducible
source: %select{class|variable}0 template partial specialization contains %select{a template parameter|template parameters}1 that cannot be deduced; this partial specialization will never be used
root: {$arg0 :select s0=|class| s1=|variable|} template partial specialization contains {$arg1 :select s0=|a template parameter| s1=|template parameters|} that cannot be deduced; this partial specialization will never be used

# ext_redefinition_of_typedef
source: redefinition of typedef %0 is a C11 feature
root: redefinition of typedef {$arg0} is a C11 feature

# ext_retained_language_linkage
source: friend function %0 retaining previous language linkage is an extension
root: friend function {$arg0} retaining previous language linkage is an extension

# ext_return_has_expr
source: %select{void function|void method|constructor|destructor}1 %0 should not return a value
root: {$arg1 :select s0=|void function| s1=|void method| s2=|constructor| s3=|destructor|} {$arg0} should not return a value

# ext_return_has_void_expr
source: void %select{function|method|block}1 %0 should not return void expression
root: void {$arg1 :select s0=|function| s1=|method| s2=|block|} {$arg0} should not return void expression

# ext_return_missing_expr
source: non-void %select{function|method}1 %0 should return a value
root: non-void {$arg1 :select s0=|function| s1=|method|} {$arg0} should return a value

# ext_rvalue_to_reference_access_ctor
source: C++98 requires an accessible copy constructor for class %2 when binding a reference to a temporary; was %select{private|protected}0
root: C++98 requires an accessible copy constructor for class {$arg2} when binding a reference to a temporary; was {$arg0 :select s0=|private| s1=|protected|}

# ext_rvalue_to_reference_temp_copy_no_viable
source: no viable constructor %select{copying variable|copying parameter|initializing template parameter|returning object|initializing statement expression result|throwing object|copying member subobject|copying array element|allocating object|copying temporary|initializing base subobject|initializing vector element|capturing value}0 of type %1; C++98 requires a copy constructor when binding a reference to a temporary
root: no viable constructor {$arg0 :select s0=|copying variable| s1=|copying parameter| s2=|initializing template parameter| s3=|returning object| s4=|initializing statement expression result| s5=|throwing object| s6=|copying member subobject| s7=|copying array element| s8=|allocating object| s9=|copying temporary| s10=|initializing base subobject| s11=|initializing vector element| s12=|capturing value|} of type {$arg1}; C++98 requires a copy constructor when binding a reference to a temporary

# ext_sizeof_alignof_function_type
source: invalid application of '%0' to a function type
root: invalid application of '{$arg0}' to a function type

# ext_sizeof_alignof_void_type
source: invalid application of '%0' to a void type
root: invalid application of '{$arg0}' to a void type

# ext_standalone_specifier
source: '%0' is not permitted on a declaration of a type
root: '{$arg0}' is not permitted on a declaration of a type

# ext_static_non_static
source: redeclaring non-static %0 as static is a Microsoft extension
root: redeclaring non-static {$arg0} as static is a Microsoft extension

# ext_string_literal_from_predefined
source: expansion of predefined identifier '%0' to a string literal is a Microsoft extension
root: expansion of predefined identifier '{$arg0}' to a string literal is a Microsoft extension

# ext_subscript_overload
source: overloaded %0 with %select{no|a defaulted|more than one}1 parameter is a C++23 extension
root: overloaded {$arg0} with {$arg1 :select s0=|no| s1=|a defaulted| s2=|more than one|} parameter is a C++23 extension

# ext_template_arg_local_type
source: template argument uses local type %0
root: template argument uses local type {$arg0}

# ext_template_arg_object_internal
source: non-type template argument referring to %select{function|object}0 %1 with internal linkage is a C++11 extension
root: non-type template argument referring to {$arg0 :select s0=|function| s1=|object|} {$arg1} with internal linkage is a C++11 extension

# ext_template_param_shadow
source: declaration of %0 shadows template parameter
root: declaration of {$arg0} shadows template parameter

# ext_type_defined_in_offsetof
source: defining a type within '%select{__builtin_offsetof|offsetof}0' is a C23 extension
root: defining a type within '{$arg0 :select s0=|__builtin_offsetof| s1=|offsetof|}' is a C23 extension

# ext_typecheck_addrof_temporary
source: taking the address of a temporary object of type %0
root: taking the address of a temporary object of type {$arg0}

# ext_typecheck_cast_nonscalar
source: C99 forbids casting nonscalar type %0 to the same type
root: C99 forbids casting nonscalar type {$arg0} to the same type

# ext_typecheck_compare_complete_incomplete_pointers
source: pointer comparisons before C11 need to be between two complete or two incomplete types; %0 is %select{|in}2complete and %1 is %select{|in}3complete
root: pointer comparisons before C11 need to be between two complete or two incomplete types; {$arg0} is {$arg2 :select s0=|| s1=|in|}complete and {$arg1} is {$arg3 :select s0=|| s1=|in|}complete

# ext_typecheck_comparison_of_fptr_to_void
source: equality comparison between function pointer and void pointer (%0 and %1)
root: equality comparison between function pointer and void pointer ({$arg0} and {$arg1})

# ext_typecheck_comparison_of_pointer_integer
source: comparison between pointer and integer (%0 and %1)
root: comparison between pointer and integer ({$arg0} and {$arg1})

# ext_typecheck_cond_incompatible_operands
source: incompatible operand types (%0 and %1)
root: incompatible operand types ({$arg0} and {$arg1})

# ext_typecheck_convert_incompatible_function_pointer
source: incompatible function pointer types %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2%select{|; dereference with *|; take the address with &|; remove *|; remove &}3
root: incompatible function pointer types %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2{$arg3 :select s0=|| s1=|; dereference with *| s2=|; take the address with &| s3=|; remove *| s4=|; remove &|}
