Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticCommentKinds.xlf
Languages: root

# note_doc_block_command_previous
source: previous command '%select{\|@}0%1' here
root: previous command '{$arg0 :select s0=|\\| s1=|@|}{$arg1}' here

# note_doc_block_command_previous_alias
source: previous command '%select{\|@}0%1' (an alias of '\%2') here
root: previous command '{$arg0 :select s0=|\\| s1=|@|}{$arg1}' (an alias of '\\{$arg2}') here

# note_doc_param_name_suggestion
source: did you mean '%0'?
root: did you mean '{$arg0}'?

# note_doc_tparam_name_suggestion
source: did you mean '%0'?
root: did you mean '{$arg0}'?

# warn_correct_comment_command_name
source: unknown command tag name '%0'; did you mean '%1'?
root: unknown command tag name '{$arg0}'; did you mean '{$arg1}'?

# warn_doc_api_container_decl_mismatch
source: '%select{\|@}0%select{class|interface|protocol|struct|union}1' command should not be used in a comment attached to a non-%select{class|interface|protocol|struct|union}2 declaration
root: '{$arg0 :select s0=|\\| s1=|@|}{$arg1 :select s0=|class| s1=|interface| s2=|protocol| s3=|struct| s4=|union|}' command should not be used in a comment attached to a non-{$arg2 :select s0=|class| s1=|interface| s2=|protocol| s3=|struct| s4=|union|} declaration

# warn_doc_block_command_duplicate
source: duplicated command '%select{\|@}0%1'
root: duplicated command '{$arg0 :select s0=|\\| s1=|@|}{$arg1}'

# warn_doc_block_command_empty_paragraph
source: empty paragraph passed to '%select{\|@}0%1' command
root: empty paragraph passed to '{$arg0 :select s0=|\\| s1=|@|}{$arg1}' command

# warn_doc_container_decl_mismatch
source: '%select{\|@}0%select{classdesign|coclass|dependency|helper|helperclass|helps|instancesize|ownership|performance|security|superclass}1' command should not be used in a comment attached to a non-container declaration
root: '{$arg0 :select s0=|\\| s1=|@|}{$arg1 :select s0=|classdesign| s1=|coclass| s2=|dependency| s3=|helper| s4=|helperclass| s5=|helps| s6=|instancesize| s7=|ownership| s8=|performance| s9=|security| s10=|superclass|}' command should not be used in a comment attached to a non-container declaration

# warn_doc_deprecated_not_sync
source: declaration is marked with '%select{\|@}0deprecated' command but does not have a deprecation attribute
root: declaration is marked with '{$arg0 :select s0=|\\| s1=|@|}deprecated' command but does not have a deprecation attribute

# warn_doc_function_method_decl_mismatch
source: '%select{\|@}0%select{function|functiongroup|method|methodgroup|callback}1' command should be used in a comment attached to %select{a function|a function|an Objective-C method|an Objective-C method|a pointer to function}2 declaration
root: '{$arg0 :select s0=|\\| s1=|@|}{$arg1 :select s0=|function| s1=|functiongroup| s2=|method| s3=|methodgroup| s4=|callback|}' command should be used in a comment attached to {$arg2 :select s0=|a function| s1=|a function| s2=|an Objective-C method| s3=|an Objective-C method| s4=|a pointer to function|} declaration

# warn_doc_html_end_forbidden
source: HTML end tag '%0' is forbidden
root: HTML end tag '{$arg0}' is forbidden

# warn_doc_html_missing_end_tag
source: HTML tag '%0' requires an end tag
root: HTML tag '{$arg0}' requires an end tag

# warn_doc_html_start_end_mismatch
source: HTML start tag '%0' closed by '%1'
root: HTML start tag '{$arg0}' closed by '{$arg1}'

# warn_doc_inline_command_not_enough_arguments
source: '%select{\|@}0%1' command has %plural{0:no|:%2}2 word argument%s2, expected %3
root: '{$arg0 :select s0=|\\| s1=|@|}{$arg1}' command has %plural{0:no|:{$arg2}}2 word argument%s2, expected {$arg3}

# warn_doc_param_duplicate
source: parameter '%0' is already documented
root: parameter '{$arg0}' is already documented

# warn_doc_param_not_attached_to_a_function_decl
source: '%select{\|@}0param' command used in a comment that is not attached to a function declaration
root: '{$arg0 :select s0=|\\| s1=|@|}param' command used in a comment that is not attached to a function declaration

# warn_doc_param_not_found
source: parameter '%0' not found in the function declaration
root: parameter '{$arg0}' not found in the function declaration

# warn_doc_returns_attached_to_a_void_function
source: '%select{\|@}0%1' command used in a comment that is attached to a %select{function returning void|constructor|destructor|method returning void}2
root: '{$arg0 :select s0=|\\| s1=|@|}{$arg1}' command used in a comment that is attached to a {$arg2 :select s0=|function returning void| s1=|constructor| s2=|destructor| s3=|method returning void|}

# warn_doc_returns_not_attached_to_a_function_decl
source: '%select{\|@}0%1' command used in a comment that is not attached to a function or method declaration
root: '{$arg0 :select s0=|\\| s1=|@|}{$arg1}' command used in a comment that is not attached to a function or method declaration

# warn_doc_tparam_duplicate
source: template parameter '%0' is already documented
root: template parameter '{$arg0}' is already documented

# warn_doc_tparam_not_attached_to_a_template_decl
source: '%select{\|@}0tparam' command used in a comment that is not attached to a template declaration
root: '{$arg0 :select s0=|\\| s1=|@|}tparam' command used in a comment that is not attached to a template declaration

# warn_doc_tparam_not_found
source: template parameter '%0' not found in the template declaration
root: template parameter '{$arg0}' not found in the template declaration

# warn_verbatim_block_end_without_start
source: '%select{\|@}0%1' command does not terminate a verbatim text block
root: '{$arg0 :select s0=|\\| s1=|@|}{$arg1}' command does not terminate a verbatim text block
