Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# err_reduction_op_mismatch
source: OpenACC 'reduction' variable must have the same operator in all nested constructs (%0 vs %1)
root: OpenACC 'reduction' variable must have the same operator in all nested constructs ({$arg0} vs {$arg1})

# err_ref_bad_target
source: reference to %select{__device__|__global__|__host__|__host__ __device__}0 %select{function|variable}1 %2 in %select{__device__|__global__|__host__|__host__ __device__}3 function
root: reference to {$arg0 :select s0=|__device__| s1=|__global__| s2=|__host__| s3=|__host__ __device__|} {$arg1 :select s0=|function| s1=|variable|} {$arg2} in {$arg3 :select s0=|__device__| s1=|__global__| s2=|__host__| s3=|__host__ __device__|} function

# err_ref_bad_target_global_initializer
source: reference to %select{__device__|__global__|__host__|__host__ __device__}0 function %1 in global initializer
root: reference to {$arg0 :select s0=|__device__| s1=|__global__| s2=|__host__| s3=|__host__ __device__|} function {$arg1} in global initializer

# err_ref_init_ambiguous
source: reference initialization of type %0 with initializer of type %1 is ambiguous
root: reference initialization of type {$arg0} with initializer of type {$arg1} is ambiguous

# err_ref_non_value
source: %0 does not refer to a value
root: {$arg0} does not refer to a value

# err_ref_qualifier_constructor
source: ref-qualifier '%select{&&|&}0' is not allowed on a constructor
root: ref-qualifier '{$arg0 :select s0=|&&| s1=|&|}' is not allowed on a constructor

# err_ref_qualifier_destructor
source: ref-qualifier '%select{&&|&}0' is not allowed on a destructor
root: ref-qualifier '{$arg0 :select s0=|&&| s1=|&|}' is not allowed on a destructor

# err_ref_qualifier_overload
source: cannot overload a member function %select{without a ref-qualifier|with ref-qualifier '&'|with ref-qualifier '&&'}0 with a member function %select{without a ref-qualifier|with ref-qualifier '&'|with ref-qualifier '&&'}1
root: cannot overload a member function {$arg0 :select s0=|without a ref-qualifier| s1=|with ref-qualifier '&'| s2=|with ref-qualifier '&&'|} with a member function {$arg1 :select s0=|without a ref-qualifier| s1=|with ref-qualifier '&'| s2=|with ref-qualifier '&&'|}

# err_reference_bind_drops_quals
source: binding reference %diff{of type $ to value of type $|to value}0,1 %select{drops %3 qualifier%plural{1:|2:|4:|:s}4|changes address space|not permitted due to incompatible qualifiers}2
root: binding reference %diff{of type $ to value of type $|to value}0,1 %select{drops {$arg3} qualifier%plural{1:|2:|4:|:s}4|changes address space|not permitted due to incompatible qualifiers}2

# err_reference_bind_failed
source: reference %diff{to %select{type|incomplete type}1 $ could not bind to an %select{rvalue|lvalue}2 of type $|could not bind to %select{rvalue|lvalue}2 of incompatible type}0,3
root: reference %diff{to {$arg1 :select s0=|type| s1=|incomplete type|} $ could not bind to an {$arg2 :select s0=|rvalue| s1=|lvalue|} of type $|could not bind to {$arg0 :select s0=|rvalue| s1=|lvalue}2 of incompatible type|},3

# err_reference_bind_init_list
source: reference to type %0 cannot bind to an initializer list
root: reference to type {$arg0} cannot bind to an initializer list

# err_reference_bind_temporary_addrspace
source: reference of type %0 cannot bind to a temporary object because of address space mismatch
root: reference of type {$arg0} cannot bind to a temporary object because of address space mismatch

# err_reference_bind_to_bitfield
source: %select{non-const|volatile}0 reference cannot bind to bit-field%select{| %1}2
root: {$arg0 :select s0=|non-const| s1=|volatile|} reference cannot bind to bit-field{$arg2 :select s0=|| s1=| {$arg1}|}

# err_reference_bind_to_matrix_element
source: %select{non-const|volatile}0 reference cannot bind to matrix element
root: {$arg0 :select s0=|non-const| s1=|volatile|} reference cannot bind to matrix element

# err_reference_bind_to_vector_element
source: %select{non-const|volatile}0 reference cannot bind to vector element
root: {$arg0 :select s0=|non-const| s1=|volatile|} reference cannot bind to vector element

# err_reference_to_function_with_unsatisfied_constraints
source: invalid reference to function %0: constraints not satisfied
root: invalid reference to function {$arg0}: constraints not satisfied

# err_reference_to_local_in_enclosing_context
source: reference to local %select{variable|binding}1 %0 declared in enclosing %select{%3|block literal|lambda expression|context}2
root: reference to local {$arg1 :select s0=|variable| s1=|binding|} {$arg0} declared in enclosing {$arg2 :select s0=|{$arg3}| s1=|block literal| s2=|lambda expression| s3=|context|}

# err_reference_var_requires_init
source: declaration of reference variable %0 requires an initializer
root: declaration of reference variable {$arg0} requires an initializer

# err_reference_without_init
source: reference to type %0 requires an initializer
root: reference to type {$arg0} requires an initializer

# err_regparm_mismatch
source: function declared with regparm(%0) attribute was previously declared %plural{0:without the regparm|:with the regparm(%1)}1 attribute
root: function declared with regparm({$arg0}) attribute was previously declared %plural{0:without the regparm|:with the regparm({$arg1})}1 attribute

# err_repeat_attribute
source: %0 attribute cannot be repeated
root: {$arg0} attribute cannot be repeated

# err_requires_expr_parameter_referenced_in_evaluated_context
source: constraint variable %0 cannot be used in an evaluated context
root: constraint variable {$arg0} cannot be used in an evaluated context

# err_return_in_captured_stmt
source: cannot return from %0
root: cannot return from {$arg0}

# err_return_init_list
source: %select{void function|void method|constructor|destructor}1 %0 must not return a value
root: {$arg1 :select s0=|void function| s1=|void method| s2=|constructor| s3=|destructor|} {$arg0} must not return a value

# err_riscv_attribute_interrupt_requires_extension
source: RISC-V 'interrupt' attribute '%0' requires extension '%1'
root: RISC-V 'interrupt' attribute '{$arg0}' requires extension '{$arg1}'

# err_riscv_builtin_requires_extension
source: builtin requires%select{| at least one of the following extensions}0: %1
root: builtin requires{$arg0 :select s0=|| s1=| at least one of the following extensions|}: {$arg1}

# err_riscv_type_requires_extension
source: RISC-V type %0 requires the '%1' extension
root: RISC-V type {$arg0} requires the '{$arg1}' extension

# err_root_class_cannot_use_super
source: %0 cannot use 'super' because it is a root class
root: {$arg0} cannot use 'super' because it is a root class

# err_rref_in_exception_spec
source: rvalue reference type %0 is not allowed in exception specification
root: rvalue reference type {$arg0} is not allowed in exception specification

# err_sampler_argument_required
source: sampler_t variable required - got %0
root: sampler_t variable required - got {$arg0}

# err_sampler_initializer_not_integer
source: sampler_t initialization requires 32-bit integer, not %0
root: sampler_t initialization requires 32-bit integer, not {$arg0}

# err_second_parameter_to_va_arg_abstract
source: second argument to 'va_arg' is of abstract type %0
root: second argument to 'va_arg' is of abstract type {$arg0}

# err_second_parameter_to_va_arg_incomplete
source: second argument to 'va_arg' is of incomplete type %0
root: second argument to 'va_arg' is of incomplete type {$arg0}

# err_section_conflict
source: %0 causes a section type conflict with %1
root: {$arg0} causes a section type conflict with {$arg1}

# err_selector_element_const_type
source: selector element of type %0 cannot be a constant lvalue expression
root: selector element of type {$arg0} cannot be a constant lvalue expression

# err_selector_element_type
source: selector element type %0 is not a valid object
root: selector element type {$arg0} is not a valid object

# err_setting_eval_method_used_in_unsafe_context
source: %select{'#pragma clang fp eval_method'|option 'ffp-eval-method'}0 cannot be used with %select{option 'fapprox-func'|option 'mreassociate'|option 'freciprocal'|option 'ffp-eval-method'|'#pragma clang fp reassociate'|'#pragma clang fp reciprocal'}1
root: {$arg0 :select s0=|'#pragma clang fp eval_method'| s1=|option 'ffp-eval-method'|} cannot be used with {$arg1 :select s0=|option 'fapprox-func'| s1=|option 'mreassociate'| s2=|option 'freciprocal'| s3=|option 'ffp-eval-method'| s4=|'#pragma clang fp reassociate'| s5=|'#pragma clang fp reciprocal'|}

# err_shift_rhs_only_vector
source: requested shift is a vector of type %0 but the first operand is not a vector (%1)
root: requested shift is a vector of type {$arg0} but the first operand is not a vector ({$arg1})

# err_shufflevector_minus_one_is_undefined_behavior_constexpr
source: index for __builtin_shufflevector not within the bounds of the input vectors; index of -1 found at position %0 is not permitted in a constexpr context
root: index for __builtin_shufflevector not within the bounds of the input vectors; index of -1 found at position {$arg0} is not permitted in a constexpr context

# err_sizeless_in_exception_spec
source: %select{|reference to }0sizeless type %1 is not allowed in exception specification
root: {$arg0 :select s0=|| s1=|reference to |}sizeless type {$arg1} is not allowed in exception specification

# err_sizeless_nonlocal
source: non-local variable with sizeless type %0
root: non-local variable with sizeless type {$arg0}

# err_sizeof_alignof_function_type
source: invalid application of '%0' to a function type
root: invalid application of '{$arg0}' to a function type

# err_sizeof_alignof_incomplete_or_sizeless_type
source: invalid application of '%0' to %select{an incomplete|sizeless}1 type %2
root: invalid application of '{$arg0}' to {$arg1 :select s0=|an incomplete| s1=|sizeless|} type {$arg2}

# err_sizeof_alignof_typeof_bitfield
source: invalid application of '%select{sizeof|alignof|typeof|typeof_unqual}0' to bit-field
root: invalid application of '{$arg0 :select s0=|sizeof| s1=|alignof| s2=|typeof| s3=|typeof_unqual|}' to bit-field

# err_sizeof_nonfragile_interface
source: application of '%select{alignof|sizeof}1' to interface %0 is not supported on this architecture and platform
root: application of '{$arg1 :select s0=|alignof| s1=|sizeof|}' to interface {$arg0} is not supported on this architecture and platform

# err_sizeof_pack_no_pack_name_suggest
source: %0 does not refer to the name of a parameter pack; did you mean %1?
root: {$arg0} does not refer to the name of a parameter pack; did you mean {$arg1}?

# err_sme_attr_mismatch
source: function declared %0 was previously declared %1, which has different SME function attributes
root: function declared {$arg0} was previously declared {$arg1}, which has different SME function attributes

# err_sme_openmp_captured_region
source: OpenMP captured regions are not yet supported in %select{streaming functions|functions with ZA state|functions with ZT0 state}0
root: OpenMP captured regions are not yet supported in {$arg0 :select s0=|streaming functions| s1=|functions with ZA state| s2=|functions with ZT0 state|}

# err_spaceship_argument_narrowing
source: argument to 'operator<=>' %select{cannot be narrowed from type %1 to %2|evaluates to %1, which cannot be narrowed to type %2}0
root: argument to 'operator<=>' {$arg0 :select s0=|cannot be narrowed from type {$arg1} to {$arg2}| s1=|evaluates to {$arg1}, which cannot be narrowed to type {$arg2}|}

# err_spec_member_not_instantiated
source: specialization of member %q0 does not specialize an instantiated member
root: specialization of member {$arg0 :q} does not specialize an instantiated member

# err_specialization_after_instantiation
source: explicit specialization of %0 after instantiation
root: explicit specialization of {$arg0} after instantiation

# err_specialization_not_primary_template
source: cannot reference member of primary template because deduced class template specialization %0 is %select{instantiated from a partial|an explicit}1 specialization
root: cannot reference member of primary template because deduced class template specialization {$arg0} is {$arg1 :select s0=|instantiated from a partial| s1=|an explicit|} specialization

# err_specialize_member_of_template
source: cannot specialize %select{|(with 'template<>') }0a member of an unspecialized template
root: cannot specialize {$arg0 :select s0=|| s1=|(with 'template<>') |}a member of an unspecialized template

# err_standalone_class_nested_name_specifier
source: forward declaration of %0 cannot have a nested name specifier
root: forward declaration of {$arg0} cannot have a nested name specifier

# err_static_assert_failed
source: static assertion failed%select{: %1|}0
root: static assertion failed{$arg0 :select s0=|: {$arg1}| s1=||}

# err_static_assert_requirement_failed
source: static assertion failed due to requirement '%0'%select{: %2|}1
root: static assertion failed due to requirement '{$arg0}'{$arg1 :select s0=|: {$arg2}| s1=||}

# err_static_data_member_not_allowed_in_anon_struct
source: static data member %0 not allowed in anonymous %select{struct|interface|union|class|enum}1
root: static data member {$arg0} not allowed in anonymous {$arg1 :select s0=|struct| s1=|interface| s2=|union| s3=|class| s4=|enum|}

# err_static_data_member_not_allowed_in_local_class
source: static data member %0 not allowed in local %select{struct|interface|union|class|enum}2 %1
root: static data member {$arg0} not allowed in local {$arg2 :select s0=|struct| s1=|interface| s2=|union| s3=|class| s4=|enum|} {$arg1}

# err_static_data_member_reinitialization
source: static data member %0 already has an initializer
root: static data member {$arg0} already has an initializer

# err_static_downcast_via_virtual
source: cannot cast %0 to %1 via virtual base %2
root: cannot cast {$arg0} to {$arg1} via virtual base {$arg2}

# err_static_non_static
source: static declaration of %0 follows non-static declaration
root: static declaration of {$arg0} follows non-static declaration

# err_static_not_bitfield
source: static member %0 cannot be a bit-field
root: static member {$arg0} cannot be a bit-field

# err_static_overrides_virtual
source: 'static' member function %0 overrides a virtual function in a base class
root: 'static' member function {$arg0} overrides a virtual function in a base class

# err_std_compare_type_not_supported
source: standard library implementation of %0 is not supported; %select{member '%2' does not have expected form|member '%2' is missing|the type is not trivially copyable|the type does not have the expected form}1
root: standard library implementation of {$arg0} is not supported; {$arg1 :select s0=|member '{$arg2}' does not have expected form| s1=|member '{$arg2}' is missing| s2=|the type is not trivially copyable| s3=|the type does not have the expected form|}

# err_std_initializer_list_malformed
source: %0 layout not recognized. Must be a non-polymorphic class type with no bases and two fields: a 'const E *' and either another 'const E *' or a 'std::size_t'
root: {$arg0} layout not recognized. Must be a non-polymorphic class type with no bases and two fields: a 'const E *' and either another 'const E *' or a 'std::size_t'

# err_std_type_trait_not_class_template
source: unsupported standard library implementation: 'std::%0' is not a class template
root: unsupported standard library implementation: 'std::{$arg0}' is not a class template

# err_stmt_expr_in_default_arg
source: default %select{argument|non-type template argument}0 may not use a GNU statement expression
root: default {$arg0 :select s0=|argument| s1=|non-type template argument|} may not use a GNU statement expression

# err_storage_spec_on_catch_parm
source: @catch parameter cannot have storage specifier '%0'
root: @catch parameter cannot have storage specifier '{$arg0}'

# err_strong_property
source: existing instance variable %1 for strong property %0 may not be __weak
root: existing instance variable {$arg1} for strong property {$arg0} may not be __weak

# err_subscript_function_type
source: subscript of pointer to function type %0
root: subscript of pointer to function type {$arg0}

# err_subscript_incomplete_or_sizeless_type
source: subscript of pointer to %select{incomplete|sizeless}0 type %1
root: subscript of pointer to {$arg0 :select s0=|incomplete| s1=|sizeless|} type {$arg1}

# err_subscript_nonfragile_interface
source: subscript requires size of interface %0, which is not constant for this architecture and platform
root: subscript requires size of interface {$arg0}, which is not constant for this architecture and platform

# err_sve_vector_in_non_streaming_function
source: SVE vector type %0 cannot be used in a non-streaming function
root: SVE vector type {$arg0} cannot be used in a non-streaming function

# err_sve_vector_in_non_sve_target
source: SVE vector type %0 cannot be used in a target without sve
root: SVE vector type {$arg0} cannot be used in a target without sve

# err_swift_abi_parameter_wrong_type
source: '%0' parameter must have pointer%select{| to unqualified pointer}1 type; type here is %2
root: '{$arg0}' parameter must have pointer{$arg1 :select s0=|| s1=| to unqualified pointer|} type; type here is {$arg2}

# err_swift_async_bad_block_type
source: 'swift_async' completion handler parameter must have block type returning 'void', type here is %0
root: 'swift_async' completion handler parameter must have block type returning 'void', type here is {$arg0}

# err_swift_async_error_no_error_parameter
source: %0 attribute with 'nonnull_error' convention can only be applied to a %select{function|method}1 with a completion handler with an error parameter
root: {$arg0} attribute with 'nonnull_error' convention can only be applied to a {$arg1 :select s0=|function| s1=|method|} with a completion handler with an error parameter

# err_swift_async_error_non_integral
source: %0 attribute with '%1' convention must have an integral-typed parameter in completion handler at index %2, type here is %3
root: {$arg0} attribute with '{$arg1}' convention must have an integral-typed parameter in completion handler at index {$arg2}, type here is {$arg3}

# err_swift_async_error_without_swift_async
source: %0 attribute must be applied to a %select{function|method}1 annotated with non-'none' attribute 'swift_async'
root: {$arg0} attribute must be applied to a {$arg1 :select s0=|function| s1=|method|} annotated with non-'none' attribute 'swift_async'

# err_swift_param_attr_not_swiftcall
source: '%0' parameter can only be used with swiftcall%select{ or swiftasynccall|}1 calling convention%select{|s}1
root: '{$arg0}' parameter can only be used with swiftcall{$arg1 :select s0=| or swiftasynccall| s1=||} calling convention{$arg1 :select s0=|| s1=|s|}

# err_switch_explicit_conversion
source: switch condition type %0 requires explicit conversion to %1
root: switch condition type {$arg0} requires explicit conversion to {$arg1}

# err_switch_incomplete_class_type
source: switch condition has incomplete class type %0
root: switch condition has incomplete class type {$arg0}

# err_switch_multiple_conversions
source: multiple conversions from switch condition type %0 to an integral or enumeration type
root: multiple conversions from switch condition type {$arg0} to an integral or enumeration type

# err_sycl_entry_point_invalid
source: 'sycl_kernel_entry_point' attribute cannot be applied to a %select{non-static member function|variadic function|deleted function|defaulted function|constexpr function|consteval function|function declared with the 'noreturn' attribute|coroutine|function defined with a function try block}0
root: 'sycl_kernel_entry_point' attribute cannot be applied to a {$arg0 :select s0=|non-static member function| s1=|variadic function| s2=|deleted function| s3=|defaulted function| s4=|constexpr function| s5=|consteval function| s6=|function declared with the 'noreturn' attribute| s7=|coroutine| s8=|function defined with a function try block|}

# err_synthesize_on_class_property
source: @synthesize not allowed on a class property %0
root: @synthesize not allowed on a class property {$arg0}

# err_synthesize_variable_sized_ivar
source: synthesized property with variable size type %0 requires an existing instance variable
root: synthesized property with variable size type {$arg0} requires an existing instance variable

# err_tag_definition_of_typedef
source: definition of type %0 conflicts with %select{typedef|type alias}1 of the same name
root: definition of type {$arg0} conflicts with {$arg1 :select s0=|typedef| s1=|type alias|} of the same name

# err_tag_index_out_of_range
source: %select{type tag|argument}0 index %1 is greater than the number of arguments specified
root: {$arg0 :select s0=|type tag| s1=|argument|} index {$arg1} is greater than the number of arguments specified

# err_tag_reference_conflict
source: implicit declaration introduced by elaborated type conflicts with a %select{non-struct type|non-class type|non-union type|non-enum type|typedef|type alias|template|type alias template|template template argument}0 of the same name
root: implicit declaration introduced by elaborated type conflicts with a {$arg0 :select s0=|non-struct type| s1=|non-class type| s2=|non-union type| s3=|non-enum type| s4=|typedef| s5=|type alias| s6=|template| s7=|type alias template| s8=|template template argument|} of the same name

# err_tag_reference_non_tag
source: %select{non-struct type|non-class type|non-union type|non-enum type|typedef|type alias|template|alias template|template template argument}1 %0 cannot be referenced with the '%select{struct|interface|union|class|enum}2' specifier
root: {$arg1 :select s0=|non-struct type| s1=|non-class type| s2=|non-union type| s3=|non-enum type| s4=|typedef| s5=|type alias| s6=|template| s7=|alias template| s8=|template template argument|} {$arg0} cannot be referenced with the '{$arg2 :select s0=|struct| s1=|interface| s2=|union| s3=|class| s4=|enum|}' specifier

# err_target_unsupported_type
source: %0 requires %select{|%2 bit size}1 %3 %select{|return }4type support, but target '%5' does not support it
root: {$arg0} requires {$arg1 :select s0=|| s1=|{$arg2} bit size|} {$arg3} {$arg4 :select s0=|| s1=|return |}type support, but target '{$arg5}' does not support it

# err_tcb_conflicting_attributes
source: attributes '%0("%2")' and '%1("%2")' are mutually exclusive
root: attributes '{$arg0}("{$arg2}")' and '{$arg1}("{$arg2}")' are mutually exclusive

# err_temp_copy_ambiguous
source: ambiguous constructor call when %select{copying variable|copying parameter|initializing template parameter|returning object|initializing statement expression result|throwing object|copying member subobject|copying array element|allocating object|copying temporary|initializing base subobject|initializing vector element|capturing value}0 of type %1
root: ambiguous constructor call when {$arg0 :select s0=|copying variable| s1=|copying parameter| s2=|initializing template parameter| s3=|returning object| s4=|initializing statement expression result| s5=|throwing object| s6=|copying member subobject| s7=|copying array element| s8=|allocating object| s9=|copying temporary| s10=|initializing base subobject| s11=|initializing vector element| s12=|capturing value|} of type {$arg1}
