Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# err_typecheck_vector_not_convertable_implict_truncation
source: cannot convert between %select{scalar|vector}0 type %1 and vector type %2 as implicit conversion would cause truncation
root: cannot convert between {$arg0 :select s0=|scalar| s1=|vector|} type {$arg1} and vector type {$arg2} as implicit conversion would cause truncation

# err_typecheck_vector_not_convertable_non_scalar
source: cannot convert between vector and non-scalar values (%0 and %1)
root: cannot convert between vector and non-scalar values ({$arg0} and {$arg1})

# err_typedef_changes_linkage
source: unsupported: anonymous type given name for linkage purposes by %select{typedef|alias}0 declaration after its linkage was computed; add a tag name here to establish linkage prior to definition
root: unsupported: anonymous type given name for linkage purposes by {$arg0 :select s0=|typedef| s1=|alias|} declaration after its linkage was computed; add a tag name here to establish linkage prior to definition

# err_typedef_not_bitfield
source: typedef member %0 cannot be a bit-field
root: typedef member {$arg0} cannot be a bit-field

# err_typename_nested_not_found
source: no type named %0 in %1
root: no type named {$arg0} in {$arg1}

# err_typename_nested_not_found_enable_if
source: no type named 'type' in %0; 'enable_if' cannot be used to disable this declaration
root: no type named 'type' in {$arg0}; 'enable_if' cannot be used to disable this declaration

# err_typename_nested_not_found_requirement
source: failed requirement '%0'; 'enable_if' cannot be used to disable this declaration
root: failed requirement '{$arg0}'; 'enable_if' cannot be used to disable this declaration

# err_typename_nested_not_type
source: typename specifier refers to non-type member %0 in %1
root: typename specifier refers to non-type member {$arg0} in {$arg1}

# err_typename_not_type
source: typename specifier refers to non-type %0
root: typename specifier refers to non-type {$arg0}

# err_typename_refers_to_using_value_decl
source: typename specifier refers to a dependent using declaration for a value %0 in %1
root: typename specifier refers to a dependent using declaration for a value {$arg0} in {$arg1}

# err_unavailable
source: %0 is unavailable
root: {$arg0} is unavailable

# err_unavailable_in_arc
source: %0 is unavailable in ARC
root: {$arg0} is unavailable in ARC

# err_unavailable_message
source: %0 is unavailable: %1
root: {$arg0} is unavailable: {$arg1}

# err_uncasted_call_of_unknown_any
source: %0 has unknown return type; cast the call to its declared return type
root: {$arg0} has unknown return type; cast the call to its declared return type

# err_uncasted_send_to_unknown_any_method
source: no known method %select{%objcinstance1|%objcclass1}0; cast the message send to the method's return type
root: no known method {$arg0 :select s0=|%objcinstance1| s1=|%objcclass1|}; cast the message send to the method's return type

# err_uncasted_use_of_unknown_any
source: %0 has unknown type; cast it to its declared type to use it
root: {$arg0} has unknown type; cast it to its declared type to use it

# err_undeclared_boxing_method
source: declaration of %0 is missing in %1 class
root: declaration of {$arg0} is missing in {$arg1} class

# err_undeclared_destructor_name
source: undeclared identifier %0 in destructor name
root: undeclared identifier {$arg0} in destructor name

# err_undeclared_label_use
source: use of undeclared label %0
root: use of undeclared label {$arg0}

# err_undeclared_objc_literal_class
source: definition of class %0 must be available to use Objective-C %select{array literals|dictionary literals|numeric literals|boxed expressions|string literals}1
root: definition of class {$arg0} must be available to use Objective-C {$arg1 :select s0=|array literals| s1=|dictionary literals| s2=|numeric literals| s3=|boxed expressions| s4=|string literals|}

# err_undeclared_protocol
source: cannot find protocol declaration for %0
root: cannot find protocol declaration for {$arg0}

# err_undeclared_protocol_suggest
source: cannot find protocol declaration for %0; did you mean %1?
root: cannot find protocol declaration for {$arg0}; did you mean {$arg1}?

# err_undeclared_use
source: use of undeclared %0
root: use of undeclared {$arg0}

# err_undeclared_use_suggest
source: use of undeclared %0; did you mean %1?
root: use of undeclared {$arg0}; did you mean {$arg1}?

# err_undeclared_var_use
source: use of undeclared identifier %0
root: use of undeclared identifier {$arg0}

# err_undeclared_var_use_suggest
source: use of undeclared identifier %0; did you mean %1?
root: use of undeclared identifier {$arg0}; did you mean {$arg1}?

# err_undef_interface
source: cannot find interface declaration for %0
root: cannot find interface declaration for {$arg0}

# err_undef_interface_suggest
source: cannot find interface declaration for %0; did you mean %1?
root: cannot find interface declaration for {$arg0}; did you mean {$arg1}?

# err_undef_superclass
source: cannot find interface declaration for %0, superclass of %1
root: cannot find interface declaration for {$arg0}, superclass of {$arg1}

# err_undef_superclass_suggest
source: cannot find interface declaration for %0, superclass of %1; did you mean %2?
root: cannot find interface declaration for {$arg0}, superclass of {$arg1}; did you mean {$arg2}?

# err_undefined_inline_var
source: inline variable %q0 is not defined
root: inline variable {$arg0 :q} is not defined

# err_undefined_internal_type
source: %select{function|variable}0 %q1 is used but not defined in this translation unit, and cannot be defined in any other translation unit because its type does not have linkage
root: {$arg0 :select s0=|function| s1=|variable|} {$arg1 :q} is used but not defined in this translation unit, and cannot be defined in any other translation unit because its type does not have linkage

# err_underlying_type_of_incomplete_enum
source: cannot determine underlying type of incomplete enumeration type %0
root: cannot determine underlying type of incomplete enumeration type {$arg0}

# err_unexpanded_parameter_pack
source: %select{expression|base type|declaration type|data member type|bit-field size|static assertion|fixed underlying type|enumerator value|using declaration|friend declaration|qualifier|initializer|default argument|non-type template parameter type|exception type|explicit specialization|partial specialization|__if_exists name|__if_not_exists name|lambda|block|type constraint|requirement|requires clause}0 contains%plural{0: an|:}1 unexpanded parameter pack%plural{0:|1: %2|2:s %2 and %3|:s %2, %3, ...}1
root: {$arg0 :select s0=|expression| s1=|base type| s2=|declaration type| s3=|data member type| s4=|bit-field size| s5=|static assertion| s6=|fixed underlying type| s7=|enumerator value| s8=|using declaration| s9=|friend declaration| s10=|qualifier| s11=|initializer| s12=|default argument| s13=|non-type template parameter type| s14=|exception type| s15=|explicit specialization| s16=|partial specialization| s17=|__if_exists name| s18=|__if_not_exists name| s19=|lambda| s20=|block| s21=|type constraint| s22=|requirement| s23=|requires clause|} contains%plural{0: an|:}1 unexpanded parameter pack%plural{0:|1: {$arg2}|2:s {$arg2} and {$arg3}|:s {$arg2}, {$arg3}, ...}1

# err_unexpected_interface
source: unexpected interface name %0: expected expression
root: unexpected interface name {$arg0}: expected expression

# err_unexpected_namespace
source: unexpected namespace name %0: expected expression
root: unexpected namespace name {$arg0}: expected expression

# err_unexpected_typedef
source: unexpected type name %0: expected expression
root: unexpected type name {$arg0}: expected expression

# err_uninitialized_member_for_assign
source: cannot define the implicit copy assignment operator for %0, because non-static %select{reference|const}1 member %2 cannot use copy assignment operator
root: cannot define the implicit copy assignment operator for {$arg0}, because non-static {$arg1 :select s0=|reference| s1=|const|} member {$arg2} cannot use copy assignment operator

# err_uninitialized_member_in_ctor
source: %select{constructor for %1|implicit default constructor for %1|cannot use constructor inherited from %1:}0 must explicitly initialize the %select{reference|const}2 member %3
root: {$arg0 :select s0=|constructor for {$arg1}| s1=|implicit default constructor for {$arg1}| s2=|cannot use constructor inherited from {$arg1}:|} must explicitly initialize the {$arg2 :select s0=|reference| s1=|const|} member {$arg3}

# err_union_member_of_reference_type
source: union member %0 has reference type %1
root: union member {$arg0} has reference type {$arg1}

# err_unknown_any_function
source: function %0 with unknown type must be given a function type
root: function {$arg0} with unknown type must be given a function type

# err_unknown_any_var_function_type
source: variable %0 with unknown type cannot be given a function type
root: variable {$arg0} with unknown type cannot be given a function type

# err_unknown_arm_state
source: unknown state '%0'
root: unknown state '{$arg0}'

# err_unknown_nested_typename_suggest
source: no type named %0 in %1; did you mean %select{|simply }2%3?
root: no type named {$arg0} in {$arg1}; did you mean {$arg2 :select s0=|| s1=|simply |}{$arg3}?

# err_unknown_receiver_suggest
source: unknown receiver %0; did you mean %1?
root: unknown receiver {$arg0}; did you mean {$arg1}?

# err_unknown_type_or_class_name_suggest
source: unknown %select{type|class}1 name %0; did you mean %2?
root: unknown {$arg1 :select s0=|type| s1=|class|} name {$arg0}; did you mean {$arg2}?

# err_unknown_typename
source: unknown type name %0
root: unknown type name {$arg0}

# err_unknown_typename_suggest
source: unknown type name %0; did you mean %1?
root: unknown type name {$arg0}; did you mean {$arg1}?

# err_unsupported_unknown_any_decl
source: %0 has unknown type, which is not supported for this kind of declaration
root: {$arg0} has unknown type, which is not supported for this kind of declaration

# err_upcast_to_inaccessible_base
source: cannot cast %0 to its %select{private|protected}2 base class %1
root: cannot cast {$arg0} to its {$arg2 :select s0=|private| s1=|protected|} base class {$arg1}

# err_use_continuation_class
source: illegal redeclaration of property in class extension %0 (attribute must be 'readwrite', while its primary must be 'readonly')
root: illegal redeclaration of property in class extension {$arg0} (attribute must be 'readwrite', while its primary must be 'readonly')

# err_use_continuation_class_redeclaration_readwrite
source: illegal redeclaration of 'readwrite' property in class extension %0 (perhaps you intended this to be a 'readwrite' redeclaration of a 'readonly' public property?)
root: illegal redeclaration of 'readwrite' property in class extension {$arg0} (perhaps you intended this to be a 'readwrite' redeclaration of a 'readonly' public property?)

# err_use_of_default_argument_to_function_declared_later
source: use of default argument to function %0 that is declared later in class %1
root: use of default argument to function {$arg0} that is declared later in class {$arg1}

# err_use_with_wrong_tag
source: use of %0 with tag type that does not match previous declaration
root: use of {$arg0} with tag type that does not match previous declaration

# err_user_defined_msg_constexpr
source: %select{the message|the expression}0 in %select{a static assertion|this asm operand}0 must be produced by a constant expression
root: {$arg0 :select s0=|the message| s1=|the expression|} in {$arg0 :select s0=|a static assertion| s1=|this asm operand|} must be produced by a constant expression

# err_user_defined_msg_invalid
source: %select{the message|the expression}0 in %select{a static assertion|this asm operand}0 must be a string literal or an object with 'data()' and 'size()' member functions
root: {$arg0 :select s0=|the message| s1=|the expression|} in {$arg0 :select s0=|a static assertion| s1=|this asm operand|} must be a string literal or an object with 'data()' and 'size()' member functions

# err_user_defined_msg_invalid_mem_fn_ret_ty
source: %select{the message|the expression}0 in %select{a static assertion|this asm operand}0 must have a '%select{size|data}1()' member function returning an object convertible to '%select{std::size_t|const char *}1'
root: {$arg0 :select s0=|the message| s1=|the expression|} in {$arg0 :select s0=|a static assertion| s1=|this asm operand|} must have a '{$arg1 :select s0=|size| s1=|data|}()' member function returning an object convertible to '{$arg1 :select s0=|std::size_t| s1=|const char *|}'

# err_user_defined_msg_missing_member_function
source: the %select{message|string}0 object in %select{this static assertion|this asm operand}0 is missing %select{a 'size()' member function|a 'data()' member function|'data()' and 'size()' member functions}1
root: the {$arg0 :select s0=|message| s1=|string|} object in {$arg0 :select s0=|this static assertion| s1=|this asm operand|} is missing {$arg1 :select s0=|a 'size()' member function| s1=|a 'data()' member function| s2=|'data()' and 'size()' member functions|}

# err_using_decl_constructor_not_in_direct_base
source: %0 is not a direct base of %1, cannot inherit constructors
root: {$arg0} is not a direct base of {$arg1}, cannot inherit constructors

# err_using_directive_member_suggest
source: no namespace named %0 in %1; did you mean %select{|simply }2%3?
root: no namespace named {$arg0} in {$arg1}; did you mean {$arg2 :select s0=|| s1=|simply |}{$arg3}?

# err_using_directive_suggest
source: no namespace named %0; did you mean %1?
root: no namespace named {$arg0}; did you mean {$arg1}?

# err_using_enum_not_enum
source: %0 is not an enumerated type
root: {$arg0} is not an enumerated type

# err_using_pack_expansion_empty
source: %select{|member}0 using declaration %1 instantiates to an empty pack
root: {$arg0 :select s0=|| s1=|member|} using declaration {$arg1} instantiates to an empty pack

# err_va_start_used_in_wrong_abi_function
source: 'va_start' used in %select{System V|Win64}0 ABI function
root: 'va_start' used in {$arg0 :select s0=|System V| s1=|Win64|} ABI function

# err_var_partial_spec_redeclared
source: variable template partial specialization %0 cannot be redefined
root: variable template partial specialization {$arg0} cannot be redefined

# err_var_spec_no_template
source: no variable template matches%select{| partial}0 specialization
root: no variable template matches{$arg0 :select s0=|| s1=| partial|} specialization

# err_var_spec_no_template_but_method
source: no variable template matches specialization; did you mean to use %0 as function template instead?
root: no variable template matches specialization; did you mean to use {$arg0} as function template instead?

# err_var_template_spec_type_depends_on_self
source: the type of variable template specialization %0 declared with deduced type %1 depends on itself
root: the type of variable template specialization {$arg0} declared with deduced type {$arg1} depends on itself

# err_variable_instantiates_to_function
source: %select{variable|static data member}0 instantiated with function type %1
root: {$arg0 :select s0=|variable| s1=|static data member|} instantiated with function type {$arg1}

# err_variably_modified_new_type
source: 'new' cannot allocate object of variably modified type %0
root: 'new' cannot allocate object of variably modified type {$arg0}

# err_variably_modified_nontype_template_param
source: non-type template parameter of variably modified type %0
root: non-type template parameter of variably modified type {$arg0}

# err_variably_modified_template_arg
source: variably modified type %0 cannot be used as a template argument
root: variably modified type {$arg0} cannot be used as a template argument

# err_variably_modified_typeid
source: 'typeid' of variably modified type %0
root: 'typeid' of variably modified type {$arg0}

# err_vec_builtin_incompatible_vector
source: %select{first two|all}1 arguments to %0 must have the same type
root: {$arg1 :select s0=|first two| s1=|all|} arguments to {$arg0} must have the same type

# err_vec_builtin_non_vector
source: %select{first two|all}1 arguments to %0 must be vectors
root: {$arg1 :select s0=|first two| s1=|all|} arguments to {$arg0} must be vectors

# err_vecstep_non_scalar_vector_type
source: 'vec_step' requires built-in scalar or vector type, %0 invalid
root: 'vec_step' requires built-in scalar or vector type, {$arg0} invalid

# err_vector_incorrect_bit_count
source: incorrect number of bits in vector operand (expected %select{|a multiple of}0 %1 bits, have %2)
root: incorrect number of bits in vector operand (expected {$arg0 :select s0=|| s1=|a multiple of|} {$arg1} bits, have {$arg2})

# err_vector_incorrect_num_elements
source: %select{too many|too few}0 elements in vector %select{initialization|operand}3 (expected %1 elements, have %2)
root: {$arg0 :select s0=|too many| s1=|too few|} elements in vector {$arg3 :select s0=|initialization| s1=|operand|} (expected {$arg1} elements, have {$arg2})

# err_vla_unsupported
source: variable length arrays are not supported %select{for the current target|in '%1'}0
root: variable length arrays are not supported {$arg0 :select s0=|for the current target| s1=|in '{$arg1}'|}

# err_vsx_builtin_nonconstant_argument
source: argument %0 to %1 must be a 2-bit unsigned literal (i.e. 0, 1, 2 or 3)
root: argument {$arg0} to {$arg1} must be a 2-bit unsigned literal (i.e. 0, 1, 2 or 3)

# err_wasm_ca_reference
source: cannot %select{capture|take address of}0 WebAssembly reference
root: cannot {$arg0 :select s0=|capture| s1=|take address of|} WebAssembly reference

# err_wasm_cast_table
source: cannot cast %select{to|from}0 a WebAssembly table
root: cannot cast {$arg0 :select s0=|to| s1=|from|} a WebAssembly table

# err_wasm_reference_pr
source: %select{pointer|reference}0 to WebAssembly reference type is not allowed
root: {$arg0 :select s0=|pointer| s1=|reference|} to WebAssembly reference type is not allowed

# err_wasm_reftype_tc
source: cannot %select{throw|catch}0 a WebAssembly reference type
root: cannot {$arg0 :select s0=|throw| s1=|catch|} a WebAssembly reference type

# err_wasm_table_art
source: cannot %select{assign|return|throw|subscript}0 a WebAssembly table
root: cannot {$arg0 :select s0=|assign| s1=|return| s2=|throw| s3=|subscript|} a WebAssembly table

# err_wasm_table_invalid_uett_operand
source: invalid application of '%0' to WebAssembly table
root: invalid application of '{$arg0}' to WebAssembly table

# err_wasm_table_pr
source: cannot form a %select{pointer|reference}0 to a WebAssembly table
root: cannot form a {$arg0 :select s0=|pointer| s1=|reference|} to a WebAssembly table

# err_weak_property
source: existing instance variable %1 for __weak property %0 must be __weak
root: existing instance variable {$arg1} for __weak property {$arg0} must be __weak

# error_cconv_unsupported
source: %0 calling convention is not supported %select{for this target|on variadic function|on constructor/destructor|on builtin function}1
root: {$arg0} calling convention is not supported {$arg1 :select s0=|for this target| s1=|on variadic function| s2=|on constructor/destructor| s3=|on builtin function|}

# error_duplicate_asm_operand_name
source: duplicate use of asm operand name "%0"
root: duplicate use of asm operand name "{$arg0}"

# error_hlsl_inout_lvalue
source: cannot bind non-lvalue argument %0 to %select{|in}1out paramemter
root: cannot bind non-lvalue argument {$arg0} to {$arg1 :select s0=|| s1=|in|}out paramemter

# error_hlsl_inout_scalar_extension
source: illegal scalar extension cast on argument %0 to %select{|in}1out paramemter
root: illegal scalar extension cast on argument {$arg0} to {$arg1 :select s0=|| s1=|in|}out paramemter

# error_subscript_overload
source: overloaded %0 cannot have %select{no|a defaulted|more than one}1 parameter before C++23
root: overloaded {$arg0} cannot have {$arg1 :select s0=|no| s1=|a defaulted| s2=|more than one|} parameter before C++23

# ext_anonymous_record_with_anonymous_type
source: anonymous types declared in an anonymous %select{struct|union}0 are an extension
root: anonymous types declared in an anonymous {$arg0 :select s0=|struct| s1=|union|} are an extension

# ext_anonymous_record_with_type
source: types declared in an anonymous %select{struct|union}0 are a Microsoft extension
root: types declared in an anonymous {$arg0 :select s0=|struct| s1=|union|} are a Microsoft extension

# ext_anonymous_struct_union_qualified
source: anonymous %select{struct|union}0 cannot be '%1'
root: anonymous {$arg0 :select s0=|struct| s1=|union|} cannot be '{$arg1}'

# ext_array_size_conversion
source: implicit conversion from array size expression of type %0 to %select{integral|enumeration}1 type %2 is a C++11 extension
root: implicit conversion from array size expression of type {$arg0} to {$arg1 :select s0=|integral| s1=|enumeration|} type {$arg2} is a C++11 extension

# ext_assoc_type_incomplete
source: incomplete type %0 in a '_Generic' association is a C2y extension
root: incomplete type {$arg0} in a '_Generic' association is a C2y extension

# ext_auto_new_list_init
source: ISO C++ standards before C++17 do not allow new expression for type %0 to use list-initialization
root: ISO C++ standards before C++17 do not allow new expression for type {$arg0} to use list-initialization

# ext_bad_cxx_cast_qualifiers_away_incoherent
source: ISO C++ does not allow %select{const_cast|static_cast|reinterpret_cast|dynamic_cast|C-style cast|functional-style cast|}0 from %1 to %2 because it casts away qualifiers, even though the source and destination types are unrelated
root: ISO C++ does not allow {$arg0 :select s0=|const_cast| s1=|static_cast| s2=|reinterpret_cast| s3=|dynamic_cast| s4=|C-style cast| s5=|functional-style cast| s6=||} from {$arg1} to {$arg2} because it casts away qualifiers, even though the source and destination types are unrelated

# ext_c2y_increment_complex
source: '%select{--|++}0' on an object of complex type is a C2y extension
root: '{$arg0 :select s0=|--| s1=|++|}' on an object of complex type is a C2y extension

# ext_c23_enum_value_not_int
source: %select{|incremented }0enumerator value which exceeds the range of 'int' is a C23 extension (%1 is too %select{small|large}2)
root: {$arg0 :select s0=|| s1=|incremented |}enumerator value which exceeds the range of 'int' is a C23 extension ({$arg1} is too {$arg2 :select s0=|small| s1=|large|})

# ext_c99_array_usage
source: %select{qualifier in |static |}0array size %select{||'[*] '}0is a C99 feature
root: {$arg0 :select s0=|qualifier in | s1=|static | s2=||}array size {$arg0 :select s0=|| s1=|| s2=|'[*] '|}is a C99 feature

# ext_cannot_use_trivial_abi
source: 'trivial_abi' cannot be applied to %0
root: 'trivial_abi' cannot be applied to {$arg0}

# ext_compat_template_param_shadow
source: declaration of %0 shadows template parameter
root: declaration of {$arg0} shadows template parameter

# ext_constexpr_function_never_constant_expr
source: %select{constexpr|consteval}1 %select{function|constructor}0 never produces a constant expression
root: {$arg1 :select s0=|constexpr| s1=|consteval|} {$arg0 :select s0=|function| s1=|constructor|} never produces a constant expression

# ext_constinit_missing
source: 'constinit' specifier missing on initializing declaration of %0
root: 'constinit' specifier missing on initializing declaration of {$arg0}

# ext_cxx14_attr
source: use of the %0 attribute is a C++14 extension
root: use of the {$arg0} attribute is a C++14 extension

# ext_cxx17_attr
source: use of the %0 attribute is a C++17 extension
root: use of the {$arg0} attribute is a C++17 extension

# ext_cxx20_attr
source: use of the %0 attribute is a C++20 extension
root: use of the {$arg0} attribute is a C++20 extension
