Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# err_capture_block_variable
source: __block variable %0 cannot be captured in a %select{lambda expression|captured statement}1
root: __block variable {$arg0} cannot be captured in a {$arg1 :select s0=|lambda expression| s1=|captured statement|}

# err_capture_by_attribute_argument_unknown
source: 'lifetime_capture_by' attribute argument %0 is not a known function parameter; must be a function parameter, 'this', 'global' or 'unknown'
root: 'lifetime_capture_by' attribute argument {$arg0} is not a known function parameter; must be a function parameter, 'this', 'global' or 'unknown'

# err_capture_by_param_uses_reserved_name
source: parameter cannot be named '%select{global|unknown}0' while using 'lifetime_capture_by(%select{global|unknown}0)'
root: parameter cannot be named '{$arg0 :select s0=|global| s1=|unknown|}' while using 'lifetime_capture_by({$arg0 :select s0=|global| s1=|unknown|})'

# err_capture_class_member_does_not_name_variable
source: class member %0 cannot appear in capture list as it is not a variable
root: class member {$arg0} cannot appear in capture list as it is not a variable

# err_capture_does_not_name_variable
source: %0 in capture list does not name a variable
root: {$arg0} in capture list does not name a variable

# err_capture_more_than_once
source: %0 can appear only once in a capture list
root: {$arg0} can appear only once in a capture list

# err_capture_non_automatic_variable
source: %0 cannot be captured because it does not have automatic storage duration
root: {$arg0} cannot be captured because it does not have automatic storage duration

# err_capture_of_abstract_type
source: by-copy capture of value of abstract type %0
root: by-copy capture of value of abstract type {$arg0}

# err_capture_of_incomplete_or_sizeless_type
source: by-copy capture of variable %0 with %select{incomplete|sizeless}1 type %2
root: by-copy capture of variable {$arg0} with {$arg1 :select s0=|incomplete| s1=|sizeless|} type {$arg2}

# err_carries_dependency_missing_on_first_decl
source: %select{function|parameter}0 declared '[[carries_dependency]]' after its first declaration
root: {$arg0 :select s0=|function| s1=|parameter|} declared '[[carries_dependency]]' after its first declaration

# err_cast_from_randomized_struct
source: casting from randomized structure pointer type %0 to %1
root: casting from randomized structure pointer type {$arg0} to {$arg1}

# err_cast_pointer_from_non_pointer_int
source: operand of type %0 cannot be cast to a pointer type
root: operand of type {$arg0} cannot be cast to a pointer type

# err_cast_pointer_to_non_pointer_int
source: pointer cannot be cast to type %0
root: pointer cannot be cast to type {$arg0}

# err_catch_incomplete
source: cannot catch incomplete type %0
root: cannot catch incomplete type {$arg0}

# err_catch_incomplete_ptr
source: cannot catch pointer to incomplete type %0
root: cannot catch pointer to incomplete type {$arg0}

# err_catch_incomplete_ref
source: cannot catch reference to incomplete type %0
root: cannot catch reference to incomplete type {$arg0}

# err_catch_sizeless
source: cannot catch %select{|reference to }0sizeless type %1
root: cannot catch {$arg0 :select s0=|| s1=|reference to |}sizeless type {$arg1}

# err_catch_variably_modified
source: cannot catch variably modified type %0
root: cannot catch variably modified type {$arg0}

# err_category_forward_interface
source: cannot define %select{category|class extension}0 for undefined class %1
root: cannot define {$arg0 :select s0=|category| s1=|class extension|} for undefined class {$arg1}

# err_category_property
source: property declared in category %0 cannot be implemented in class implementation
root: property declared in category {$arg0} cannot be implemented in class implementation

# err_cconv_change
source: function declared '%0' here was previously declared %select{'%2'|without calling convention}1
root: function declared '{$arg0}' here was previously declared {$arg1 :select s0=|'{$arg2}'| s1=|without calling convention|}

# err_cconv_incomplete_param_type
source: parameter %0 must have a complete type to use function %1 with the %2 calling convention
root: parameter {$arg0} must have a complete type to use function {$arg1} with the {$arg2} calling convention

# err_cconv_knr
source: function with no prototype cannot use the %0 calling convention
root: function with no prototype cannot use the {$arg0} calling convention

# err_cconv_varargs
source: variadic function cannot use %0 calling convention
root: variadic function cannot use {$arg0} calling convention

# err_class_extension_after_impl
source: cannot declare class extension for %0 after class implementation
root: cannot declare class extension for {$arg0} after class implementation

# err_class_marked_final_used_as_base
source: base %0 is marked '%select{final|sealed}1'
root: base {$arg0} is marked '{$arg1 :select s0=|final| s1=|sealed|}'

# err_class_property_found
source: property %0 is a class property; did you mean to access it with class '%1'?
root: property {$arg0} is a class property; did you mean to access it with class '{$arg1}'?

# err_class_redeclared_with_different_access
source: %0 redeclared with '%1' access
root: {$arg0} redeclared with '{$arg1}' access

# err_collection_expr_type
source: the type %0 is not a pointer to a fast-enumerable object
root: the type {$arg0} is not a pointer to a fast-enumerable object

# err_compound_qualified_function_type
source: %select{block pointer|pointer|reference}0 to function type %select{%2 |}1cannot have '%3' qualifier
root: {$arg0 :select s0=|block pointer| s1=|pointer| s2=|reference|} to function type {$arg1 :select s0=|{$arg2} | s1=||}cannot have '{$arg3}' qualifier

# err_computed_type_in_declarative_nns
source: a %select{pack indexing|'decltype'}0 specifier cannot be used in a declarative nested name specifier
root: a {$arg0 :select s0=|pack indexing| s1=|'decltype'|} specifier cannot be used in a declarative nested name specifier

# err_conditional_vector_element_size
source: vector condition type %0 and result type %1 do not have elements of the same size
root: vector condition type {$arg0} and result type {$arg1} do not have elements of the same size

# err_conditional_vector_has_void
source: GNU vector conditional operand cannot be %select{void|a throw expression}0
root: GNU vector conditional operand cannot be {$arg0 :select s0=|void| s1=|a throw expression|}

# err_conditional_vector_operand_type
source: enumeration type %0 is not allowed in a vector conditional
root: enumeration type {$arg0} is not allowed in a vector conditional

# err_conditional_vector_size
source: vector condition type %0 and result type %1 do not have the same number of elements
root: vector condition type {$arg0} and result type {$arg1} do not have the same number of elements

# err_conditional_void_nonvoid
source: %select{left|right}1 operand to ? is void, but %select{right|left}1 operand is of type %0
root: {$arg1 :select s0=|left| s1=|right|} operand to ? is void, but {$arg1 :select s0=|right| s1=|left|} operand is of type {$arg0}

# err_config_scalar_return
source: CUDA special function '%0' must have scalar return type
root: CUDA special function '{$arg0}' must have scalar return type

# err_conflicting_aliasing_type
source: conflicting types for alias %0
root: conflicting types for alias {$arg0}

# err_conflicting_attributes_arm_state
source: conflicting attributes for state '%0'
root: conflicting attributes for state '{$arg0}'

# err_conflicting_ivar_bitwidth
source: instance variable %0 has conflicting bit-field width
root: instance variable {$arg0} has conflicting bit-field width

# err_conflicting_ivar_name
source: conflicting instance variable names: %0 vs %1
root: conflicting instance variable names: {$arg0} vs {$arg1}

# err_conflicting_ivar_type
source: instance variable %0 has conflicting type%diff{: $ vs $|}1,2
root: instance variable {$arg0} has conflicting type%diff{: $ vs $|}1,2

# err_conflicting_overriding_attributes
source: virtual function %0 has different attributes %diff{($) than the function it overrides (which has $)|than the function it overrides}1,2
root: virtual function {$arg0} has different attributes %diff{($) than the function it overrides (which has $)|than the function it overrides}1,2

# err_conflicting_overriding_cc_attributes
source: virtual function %0 has different calling convention attributes %diff{($) than the function it overrides (which has calling convention $)|than the function it overrides}1,2
root: virtual function {$arg0} has different calling convention attributes %diff{($) than the function it overrides (which has calling convention $)|than the function it overrides}1,2

# err_conflicting_super_class
source: conflicting super class name %0
root: conflicting super class name {$arg0}

# err_conflicting_types
source: conflicting types for %0
root: conflicting types for {$arg0}

# err_constant_integer_arg_type
source: argument to %0 must be a constant integer
root: argument to {$arg0} must be a constant integer

# err_consteval_override
source: consteval function %0 cannot override a non-consteval function
root: consteval function {$arg0} cannot override a non-consteval function

# err_constexpr_body_invalid_stmt
source: statement not allowed in %select{constexpr|consteval}1 %select{function|constructor}0
root: statement not allowed in {$arg1 :select s0=|constexpr| s1=|consteval|} {$arg0 :select s0=|function| s1=|constructor|}

# err_constexpr_body_no_return
source: no return statement in %select{constexpr|consteval}0 function
root: no return statement in {$arg0 :select s0=|constexpr| s1=|consteval|} function

# err_constexpr_dtor
source: destructor cannot be declared %select{<ERROR>|constexpr|consteval|constinit}0
root: destructor cannot be declared {$arg0 :select s0=|<ERROR>| s1=|constexpr| s2=|consteval| s3=|constinit|}

# err_constexpr_dtor_subobject
source: destructor cannot be declared %select{<ERROR>|constexpr|consteval|constinit}0 because %select{data member %2|base class %3}1 does not have a constexpr destructor
root: destructor cannot be declared {$arg0 :select s0=|<ERROR>| s1=|constexpr| s2=|consteval| s3=|constinit|} because {$arg1 :select s0=|data member {$arg2}| s1=|base class {$arg3}|} does not have a constexpr destructor

# err_constexpr_local_var_non_literal_type
source: variable of non-literal type %1 cannot be defined in a constexpr %select{function|constructor}0 before C++23
root: variable of non-literal type {$arg1} cannot be defined in a constexpr {$arg0 :select s0=|function| s1=|constructor|} before C++23

# err_constexpr_main
source: 'main' is not allowed to be declared %select{constexpr|consteval}0
root: 'main' is not allowed to be declared {$arg0 :select s0=|constexpr| s1=|consteval|}

# err_constexpr_non_literal_param
source: %select{constexpr|consteval}2 %select{function|constructor}1's %ordinal0 parameter type %3 is not a literal type
root: {$arg2 :select s0=|constexpr| s1=|consteval|} {$arg1 :select s0=|function| s1=|constructor|}'s %ordinal0 parameter type {$arg3} is not a literal type

# err_constexpr_non_literal_return
source: %select{constexpr|consteval}0 function's return type %1 is not a literal type
root: {$arg0 :select s0=|constexpr| s1=|consteval|} function's return type {$arg1} is not a literal type

# err_constexpr_redecl_mismatch
source: %select{non-constexpr|constexpr|consteval}1 declaration of %0 follows %select{non-constexpr|constexpr|consteval}2 declaration
root: {$arg1 :select s0=|non-constexpr| s1=|constexpr| s2=|consteval|} declaration of {$arg0} follows {$arg2 :select s0=|non-constexpr| s1=|constexpr| s2=|consteval|} declaration

# err_constexpr_return_missing_expr
source: non-void %select{constexpr|consteval}1 function %0 should return a value
root: non-void {$arg1 :select s0=|constexpr| s1=|consteval|} function {$arg0} should return a value

# err_constexpr_static_mem_var_requires_init
source: declaration of constexpr static data member %0 requires an initializer
root: declaration of constexpr static data member {$arg0} requires an initializer

# err_constexpr_tag
source: %select{class|struct|interface|union|enum|enum class|enum struct}0 cannot be marked %select{<ERROR>|constexpr|consteval|constinit}1
root: {$arg0 :select s0=|class| s1=|struct| s2=|interface| s3=|union| s4=|enum| s5=|enum class| s6=|enum struct|} cannot be marked {$arg1 :select s0=|<ERROR>| s1=|constexpr| s2=|consteval| s3=|constinit|}

# err_constexpr_var_non_literal
source: constexpr variable cannot have non-literal type %0
root: constexpr variable cannot have non-literal type {$arg0}

# err_constexpr_var_requires_const_destruction
source: constexpr variable %0 must have constant destruction
root: constexpr variable {$arg0} must have constant destruction

# err_constexpr_var_requires_const_init
source: constexpr variable %0 must be initialized by a constant expression
root: constexpr variable {$arg0} must be initialized by a constant expression

# err_constexpr_virtual_base
source: constexpr %select{member function|constructor}0 not allowed in %select{struct|interface|class}1 with virtual base %plural{1:class|:classes}2
root: constexpr {$arg0 :select s0=|member function| s1=|constructor|} not allowed in {$arg1 :select s0=|struct| s1=|interface| s2=|class|} with virtual base %plural{1:class|:classes}2

# err_constexpr_vla
source: variably-modified type %0 cannot be used in a constexpr %select{function|constructor}1
root: variably-modified type {$arg0} cannot be used in a constexpr {$arg1 :select s0=|function| s1=|constructor|}

# err_constexpr_wrong_decl_kind
source: %select{<ERROR>|constexpr|consteval|constinit}0 can only be used in %select{|variable and function|function|variable}0 declarations
root: {$arg0 :select s0=|<ERROR>| s1=|constexpr| s2=|consteval| s3=|constinit|} can only be used in {$arg0 :select s0=|| s1=|variable and function| s2=|function| s3=|variable|} declarations

# err_constructor_cannot_be
source: constructor cannot be declared '%0'
root: constructor cannot be declared '{$arg0}'

# err_conv_function_with_complex_decl
source: cannot specify any part of a return type in the declaration of a conversion function%select{; put the complete type after 'operator'|; use a typedef to declare a conversion to %1|; use an alias template to declare a conversion to %1|}0
root: cannot specify any part of a return type in the declaration of a conversion function{$arg0 :select s0=|; put the complete type after 'operator'| s1=|; use a typedef to declare a conversion to {$arg1}| s2=|; use an alias template to declare a conversion to {$arg1}| s3=||}

# err_conv_mixed_enum_types
source: invalid %select{arithmetic between|bitwise operation between|comparison of|conditional expression between|compound assignment of}0 different enumeration types%diff{ ($ and $)|}1,2
root: invalid {$arg0 :select s0=|arithmetic between| s1=|bitwise operation between| s2=|comparison of| s3=|conditional expression between| s4=|compound assignment of|} different enumeration types%diff{ ($ and $)|}1,2

# err_convertvector_constexpr_unsupported_vector_cast
source: unsupported vector cast from %0 to %1 in a constant expression
root: unsupported vector cast from {$arg0} to {$arg1} in a constant expression

# err_coroutine_handle_missing_member
source: std::coroutine_handle must have a member named '%0'
root: std::coroutine_handle must have a member named '{$arg0}'

# err_coroutine_invalid_func_context
source: '%1' cannot be used in %select{a constructor|a destructor|the 'main' function|a constexpr function|a function with a deduced return type|a varargs function|a consteval function}0
root: '{$arg1}' cannot be used in {$arg0 :select s0=|a constructor| s1=|a destructor| s2=|the 'main' function| s3=|a constexpr function| s4=|a function with a deduced return type| s5=|a varargs function| s6=|a consteval function|}

# err_coroutine_outside_function
source: '%0' cannot be used outside a function
root: '{$arg0}' cannot be used outside a function

# err_coroutine_promise_get_return_object_on_allocation_failure
source: %0: 'get_return_object_on_allocation_failure()' must be a static member function
root: {$arg0}: 'get_return_object_on_allocation_failure()' must be a static member function

# err_coroutine_promise_incompatible_return_functions
source: the coroutine promise type %0 declares both 'return_value' and 'return_void'
root: the coroutine promise type {$arg0} declares both 'return_value' and 'return_void'

# err_coroutine_promise_new_requires_nothrow
source: %0 is required to have a non-throwing noexcept specification when the promise type declares 'get_return_object_on_allocation_failure()'
root: {$arg0} is required to have a non-throwing noexcept specification when the promise type declares 'get_return_object_on_allocation_failure()'

# err_coroutine_promise_type_incomplete
source: this function cannot be a coroutine: %0 is an incomplete type
root: this function cannot be a coroutine: {$arg0} is an incomplete type

# err_coroutine_promise_unhandled_exception_required
source: %0 is required to declare the member 'unhandled_exception()'
root: {$arg0} is required to declare the member 'unhandled_exception()'

# err_coroutine_return_type
source: function returns a type %0 marked with [[clang::coro_return_type]] but is neither a coroutine nor a coroutine wrapper; non-coroutines should be marked with [[clang::coro_wrapper]] to allow returning coroutine return type
root: function returns a type {$arg0} marked with [[clang::coro_return_type]] but is neither a coroutine nor a coroutine wrapper; non-coroutines should be marked with [[clang::coro_wrapper]] to allow returning coroutine return type

# err_coroutine_type_missing_specialization
source: this function cannot be a coroutine: missing definition of specialization %0
root: this function cannot be a coroutine: missing definition of specialization {$arg0}

# err_coroutine_unevaluated_context
source: '%0' cannot be used in an unevaluated context
root: '{$arg0}' cannot be used in an unevaluated context

# err_coroutine_unfound_nothrow_new
source: unable to find %select{'::operator new(size_t, nothrow_t)'|'::operator new(size_t, align_val_t, nothrow_t)'}1 for %0
root: unable to find {$arg1 :select s0=|'::operator new(size_t, nothrow_t)'| s1=|'::operator new(size_t, align_val_t, nothrow_t)'|} for {$arg0}

# err_coroutine_unusable_new
source: 'operator new' provided by %0 is not usable with the function signature of %1
root: 'operator new' provided by {$arg0} is not usable with the function signature of {$arg1}

# err_coroutine_within_handler
source: '%0' cannot be used in the handler of a try block
root: '{$arg0}' cannot be used in the handler of a try block

# err_count_attr_argument_not_integer
source: '%select{counted_by|sized_by|counted_by_or_null|sized_by_or_null}0' requires a non-boolean integer type argument
root: '{$arg0 :select s0=|counted_by| s1=|sized_by| s2=|counted_by_or_null| s3=|sized_by_or_null|}' requires a non-boolean integer type argument

# err_count_attr_in_union
source: '%select{counted_by|sized_by|counted_by_or_null|sized_by_or_null}0' cannot be applied to a union member
root: '{$arg0 :select s0=|counted_by| s1=|sized_by| s2=|counted_by_or_null| s3=|sized_by_or_null|}' cannot be applied to a union member

# err_count_attr_must_be_in_structure
source: field %0 in '%select{counted_by|sized_by|counted_by_or_null|sized_by_or_null}1' not inside structure
root: field {$arg0} in '{$arg1 :select s0=|counted_by| s1=|sized_by| s2=|counted_by_or_null| s3=|sized_by_or_null|}' not inside structure

# err_count_attr_not_on_ptr_or_flexible_array_member
source: '%select{counted_by|sized_by|counted_by_or_null|sized_by_or_null}0' only applies to pointers%select{ or C99 flexible array members|||}0%select{|; did you mean to use 'counted_by'?}1
root: '{$arg0 :select s0=|counted_by| s1=|sized_by| s2=|counted_by_or_null| s3=|sized_by_or_null|}' only applies to pointers{$arg0 :select s0=| or C99 flexible array members| s1=|| s2=|| s3=||}{$arg1 :select s0=|| s1=|; did you mean to use 'counted_by'?|}

# err_count_attr_only_support_simple_decl_reference
source: '%select{counted_by|sized_by|counted_by_or_null|sized_by_or_null}0' argument must be a simple declaration reference
root: '{$arg0 :select s0=|counted_by| s1=|sized_by| s2=|counted_by_or_null| s3=|sized_by_or_null|}' argument must be a simple declaration reference

# err_count_attr_param_not_in_same_struct
source: '%select{counted_by|sized_by|counted_by_or_null|sized_by_or_null}1' field %0 isn't within the same struct as the annotated %select{pointer|flexible array}2
root: '{$arg1 :select s0=|counted_by| s1=|sized_by| s2=|counted_by_or_null| s3=|sized_by_or_null|}' field {$arg0} isn't within the same struct as the annotated {$arg2 :select s0=|pointer| s1=|flexible array|}

# err_count_attr_refer_to_union
source: '%select{counted_by|sized_by|counted_by_or_null|sized_by_or_null}0' argument cannot refer to a union member
root: '{$arg0 :select s0=|counted_by| s1=|sized_by| s2=|counted_by_or_null| s3=|sized_by_or_null|}' argument cannot refer to a union member

# err_counted_by_attr_pointee_unknown_size
source: '%select{counted_by|sized_by|counted_by_or_null|sized_by_or_null}4' %select{cannot|should not}3 be applied to %select{a pointer with pointee|an array with element}0 of unknown size because %1 is %select{an incomplete type|a sizeless type|a function type|a struct type with a flexible array member%select{|. This will be an error in a future compiler version}3}2
root: '{$arg4 :select s0=|counted_by| s1=|sized_by| s2=|counted_by_or_null| s3=|sized_by_or_null|}' {$arg3 :select s0=|cannot| s1=|should not|} be applied to {$arg0 :select s0=|a pointer with pointee| s1=|an array with element|} of unknown size because {$arg1} is %select{an incomplete type|a sizeless type|a function type|a struct type with a flexible array member{$arg2 :select s0=|| s1=|. This will be an error in a future compiler version}3|}

# err_counted_by_attr_refer_to_itself
source: 'counted_by' cannot refer to the flexible array member %0
root: 'counted_by' cannot refer to the flexible array member {$arg0}

# err_counted_by_on_incomplete_type_on_assign
source: cannot %select{assign to %select{object|'%1'}2 with|pass argument to %select{parameter|parameter '%1'}2 with|return|convert to|%select{|implicitly }3initialize %select{object|'%1'}2 with|pass argument to parameter with|cast to|pass argument to parameter with}0 '%5' attributed type %4 because the pointee type %6 is incomplete
root: cannot %select{assign to {$arg2 :select s0=|object| s1=|'{$arg1}'|} with|pass argument to {$arg2 :select s0=|parameter| s1=|parameter '{$arg1}'|} with|return|convert to|{$arg3 :select s0=|| s1=|implicitly |}initialize {$arg0 :select s0=|object| s1=|'{$arg1}'}2 with| s2=|pass argument to parameter with| s3=|cast to| s4=|pass argument to parameter with|} '{$arg5}' attributed type {$arg4} because the pointee type {$arg6} is incomplete

# err_counted_by_on_incomplete_type_on_use
source: cannot %select{use '%1' with '%4' attributed|call '%1' with '%4' attributed return}0 type %2 because the pointee type %3 is incomplete
root: cannot {$arg0 :select s0=|use '{$arg1}' with '{$arg4}' attributed| s1=|call '{$arg1}' with '{$arg4}' attributed return|} type {$arg2} because the pointee type {$arg3} is incomplete

# err_countof_arg_not_array_type
source: '_Countof' requires an argument of array type; %0 invalid
root: '_Countof' requires an argument of array type; {$arg0} invalid
