Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# note_ovl_candidate_bad_value_category
source: candidate %select{function|function|function (with reversed parameter order)|constructor|constructor (the implicit default constructor)|constructor (the implicit copy constructor)|constructor (the implicit move constructor)|function (the implicit copy assignment operator)|function (the implicit move assignment operator)|function (the implicit 'operator==' for this 'operator<=>)'|inherited constructor}0%select{| template| %2}1 not viable: expects an %select{lvalue|rvalue}5 for %select{%ordinal4 argument|object argument}3
root: candidate {$arg0 :select s0=|function| s1=|function| s2=|function (with reversed parameter order)| s3=|constructor| s4=|constructor (the implicit default constructor)| s5=|constructor (the implicit copy constructor)| s6=|constructor (the implicit move constructor)| s7=|function (the implicit copy assignment operator)| s8=|function (the implicit move assignment operator)| s9=|function (the implicit 'operator==' for this 'operator<=>)'| s10=|inherited constructor|}{$arg1 :select s0=|| s1=| template| s2=| {$arg2}|} not viable: expects an {$arg5 :select s0=|lvalue| s1=|rvalue|} for {$arg3 :select s0=|%ordinal4 argument| s1=|object argument|}

# note_ovl_candidate_constraints_not_satisfied
source: candidate %select{function|function|function (with reversed parameter order)|constructor|constructor (the implicit default constructor)|constructor (the implicit copy constructor)|constructor (the implicit move constructor)|function (the implicit copy assignment operator)|function (the implicit move assignment operator)|function (the implicit 'operator==' for this 'operator<=>)'|inherited constructor}0%select{| template| %2}1 not viable: constraints not satisfied
root: candidate {$arg0 :select s0=|function| s1=|function| s2=|function (with reversed parameter order)| s3=|constructor| s4=|constructor (the implicit default constructor)| s5=|constructor (the implicit copy constructor)| s6=|constructor (the implicit move constructor)| s7=|function (the implicit copy assignment operator)| s8=|function (the implicit move assignment operator)| s9=|function (the implicit 'operator==' for this 'operator<=>)'| s10=|inherited constructor|}{$arg1 :select s0=|| s1=| template| s2=| {$arg2}|} not viable: constraints not satisfied

# note_ovl_candidate_deduced_mismatch
source: candidate template ignored: deduced type %diff{$ of %select{|element of }4%ordinal0 parameter does not match adjusted type $ of %select{|element of }4argument|of %select{|element of }4%ordinal0 parameter does not match adjusted type of %select{|element of }4argument}1,2%3
root: candidate template ignored: deduced type %diff{$ of {$arg4 :select s0=|| s1=|element of |}%ordinal0 parameter does not match adjusted type $ of {$arg4 :select s0=|| s1=|element of |}argument|of {$arg4 :select s0=|| s1=|element of |}%ordinal0 parameter does not match adjusted type of {$arg1 :select s0=|| s1=|element of }4argument|},2{$arg3}

# note_ovl_candidate_deleted
source: candidate %select{function|function|function (with reversed parameter order)|constructor|constructor (the implicit default constructor)|constructor (the implicit copy constructor)|constructor (the implicit move constructor)|function (the implicit copy assignment operator)|function (the implicit move assignment operator)|function (the implicit 'operator==' for this 'operator<=>)'|inherited constructor}0%select{| template| %2}1 has been %select{explicitly made unavailable|explicitly deleted|implicitly deleted}3
root: candidate {$arg0 :select s0=|function| s1=|function| s2=|function (with reversed parameter order)| s3=|constructor| s4=|constructor (the implicit default constructor)| s5=|constructor (the implicit copy constructor)| s6=|constructor (the implicit move constructor)| s7=|function (the implicit copy assignment operator)| s8=|function (the implicit move assignment operator)| s9=|function (the implicit 'operator==' for this 'operator<=>)'| s10=|inherited constructor|}{$arg1 :select s0=|| s1=| template| s2=| {$arg2}|} has been {$arg3 :select s0=|explicitly made unavailable| s1=|explicitly deleted| s2=|implicitly deleted|}

# note_ovl_candidate_disabled_by_enable_if
source: candidate template ignored: disabled by %0%1
root: candidate template ignored: disabled by {$arg0}{$arg1}

# note_ovl_candidate_disabled_by_function_cond_attr
source: candidate disabled: %0
root: candidate disabled: {$arg0}

# note_ovl_candidate_disabled_by_requirement
source: candidate template ignored: requirement '%0' was not satisfied%1
root: candidate template ignored: requirement '{$arg0}' was not satisfied{$arg1}

# note_ovl_candidate_explicit
source: explicit %select{constructor|conversion function|deduction guide}0 is not a candidate%select{| (explicit specifier evaluates to true)}1
root: explicit {$arg0 :select s0=|constructor| s1=|conversion function| s2=|deduction guide|} is not a candidate{$arg1 :select s0=|| s1=| (explicit specifier evaluates to true)|}

# note_ovl_candidate_explicit_arg_mismatch_named
source: candidate template ignored: invalid explicitly-specified argument for template parameter %0
root: candidate template ignored: invalid explicitly-specified argument for template parameter {$arg0}

# note_ovl_candidate_has_pass_object_size_params
source: candidate address cannot be taken because parameter %0 has pass_object_size attribute
root: candidate address cannot be taken because parameter {$arg0} has pass_object_size attribute

# note_ovl_candidate_illegal_constructor
source: candidate %select{constructor|template}0 ignored: instantiation %select{takes|would take}0 its own class type by value
root: candidate {$arg0 :select s0=|constructor| s1=|template|} ignored: instantiation {$arg0 :select s0=|takes| s1=|would take|} its own class type by value

# note_ovl_candidate_illegal_constructor_adrspace_mismatch
source: candidate constructor ignored: cannot be used to construct an object in address space %0
root: candidate constructor ignored: cannot be used to construct an object in address space {$arg0}

# note_ovl_candidate_incomplete_deduction
source: candidate template ignored: couldn't infer template argument %0
root: candidate template ignored: couldn't infer template argument {$arg0}

# note_ovl_candidate_incomplete_deduction_pack
source: candidate template ignored: deduced too few arguments for expanded pack %0; no argument for %ordinal1 expanded parameter in deduced argument pack %2
root: candidate template ignored: deduced too few arguments for expanded pack {$arg0}; no argument for %ordinal1 expanded parameter in deduced argument pack {$arg2}

# note_ovl_candidate_inconsistent_deduction
source: candidate template ignored: deduced %select{conflicting types|conflicting values|conflicting templates|packs of different lengths}0 for parameter %1%diff{ ($ vs. $)|}2,3
root: candidate template ignored: deduced {$arg0 :select s0=|conflicting types| s1=|conflicting values| s2=|conflicting templates| s3=|packs of different lengths|} for parameter {$arg1}%diff{ ($ vs. $)|}2,3

# note_ovl_candidate_inconsistent_deduction_types
source: candidate template ignored: deduced values %diff{of conflicting types for parameter %0 (%1 of type $ vs. %3 of type $)|%1 and %3 of conflicting types for parameter %0}2,4
root: candidate template ignored: deduced values %diff{of conflicting types for parameter {$arg0} ({$arg1} of type $ vs. {$arg3} of type $)|{$arg1} and {$arg3} of conflicting types for parameter {$arg0}}2,4

# note_ovl_candidate_inherited_constructor
source: constructor from base class %0 inherited here
root: constructor from base class {$arg0} inherited here

# note_ovl_candidate_inherited_constructor_slice
source: candidate %select{constructor|template}0 ignored: inherited constructor cannot be used to %select{copy|move}1 object
root: candidate {$arg0 :select s0=|constructor| s1=|template|} ignored: inherited constructor cannot be used to {$arg1 :select s0=|copy| s1=|move|} object

# note_ovl_candidate_non_deduced_mismatch_qualified
source: candidate template ignored: could not match %q0 against %q1
root: candidate template ignored: could not match {$arg0 :q} against {$arg1 :q}

# note_ovl_candidate_substitution_failure
source: candidate template ignored: substitution failure%0%1
root: candidate template ignored: substitution failure{$arg0}{$arg1}

# note_ovl_candidate_underqualified
source: candidate template ignored: cannot deduce a type for %0 that would make %2 equal %1
root: candidate template ignored: cannot deduce a type for {$arg0} that would make {$arg2} equal {$arg1}

# note_ovl_candidate_unsatisfied_constraints
source: candidate template ignored: constraints not satisfied%0
root: candidate template ignored: constraints not satisfied{$arg0}

# note_ovl_surrogate_cand
source: conversion candidate of type %0
root: conversion candidate of type {$arg0}

# note_ovl_surrogate_constraints_not_satisfied
source: conversion candidate %0 not viable: constraints not satisfied
root: conversion candidate {$arg0} not viable: constraints not satisfied

# note_ovl_too_many_candidates
source: remaining %0 candidate%s0 omitted; pass -fshow-overloads=all to show them
root: remaining {$arg0} candidate%s0 omitted; pass -fshow-overloads=all to show them

# note_ownership_returns_index_mismatch
source: declared with index %0 here
root: declared with index {$arg0} here

# note_ownership_takes_class_mismatch
source: declared with class '%0' here
root: declared with class '{$arg0}' here

# note_parameter_named_here
source: passing argument to parameter %0 here
root: passing argument to parameter {$arg0} here

# note_parameter_pack_here
source: parameter pack %0 declared here
root: parameter pack {$arg0} declared here

# note_parameter_type
source: parameter of type %0 is declared here
root: parameter of type {$arg0} is declared here

# note_partial_availability_specified_here
source: %0 has been marked as being introduced in %1 %2 %select{|in %5 environment }4here, but the deployment target is %1 %3%select{| %6 environment }4
root: {$arg0} has been marked as being introduced in {$arg1} {$arg2} {$arg4 :select s0=|| s1=|in {$arg5} environment |}here, but the deployment target is {$arg1} {$arg3}{$arg4 :select s0=|| s1=| {$arg6} environment |}

# note_partial_spec_match
source: partial specialization matches %0
root: partial specialization matches {$arg0}

# note_pointer_declared_here
source: pointer %0 declared here
root: pointer {$arg0} declared here

# note_precedence_bitwise_first
source: place parentheses around the %0 expression to evaluate it first
root: place parentheses around the {$arg0} expression to evaluate it first

# note_prev_module_definition_from_ast_file
source: module loaded from '%0'
root: module loaded from '{$arg0}'

# note_prev_partial_spec_here
source: previous declaration of class template partial specialization %0 is here
root: previous declaration of class template partial specialization {$arg0} is here

# note_previous_access_declaration
source: previously declared '%1' here
root: previously declared '{$arg1}' here

# note_previous_builtin_declaration
source: %0 is a builtin with type %1
root: {$arg0} is a builtin with type {$arg1}

# note_previous_decl
source: %0 declared here
root: {$arg0} declared here

# note_previous_declaration_as
source: previously declared as %0 here
root: previously declared as {$arg0} here

# note_previous_exception_handler
source: for type %0
root: for type {$arg0}

# note_previous_field_init
source: previous initialization for field %0 is here
root: previous initialization for field {$arg0} is here

# note_previous_initializer
source: previous initialization %select{|with side effects }0is here%select{| (side effects will not occur at run time)}0
root: previous initialization {$arg0 :select s0=|| s1=|with side effects |}is here{$arg0 :select s0=|| s1=| (side effects will not occur at run time)|}

# note_previous_namespace_alias
source: previously defined as an alias for %0
root: previously defined as an alias for {$arg0}

# note_printf_c_str
source: did you mean to call the %0 method?
root: did you mean to call the {$arg0} method?

# note_prior_template_arg_substitution
source: while substituting prior template arguments into %select{non-type|template}0 template parameter%1 %2
root: while substituting prior template arguments into {$arg0 :select s0=|non-type| s1=|template|} template parameter{$arg1} {$arg2}

# note_property_attribute
source: property %0 is declared %select{deprecated|unavailable|partial}1 here
root: property {$arg0} is declared {$arg1 :select s0=|deprecated| s1=|unavailable| s2=|partial|} here

# note_protocol_decl_undefined
source: protocol %0 has no definition
root: protocol {$arg0} has no definition

# note_protocol_property_declare
source: it could also be property %select{of type %1|without attribute '%1'|with attribute '%1'|with getter %1|with setter %1}0 declared here
root: it could also be property {$arg0 :select s0=|of type {$arg1}| s1=|without attribute '{$arg1}'| s2=|with attribute '{$arg1}'| s3=|with getter {$arg1}| s4=|with setter {$arg1}|} declared here

# note_ptrauth_virtual_function_incomplete_arg_ret_type
source: %0 is incomplete
root: {$arg0} is incomplete

# note_pure_qualified_call_kext
source: qualified call to %0::%1 is treated as a virtual call to %1 due to -fapple-kext
root: qualified call to {$arg0}::{$arg1} is treated as a virtual call to {$arg1} due to -fapple-kext

# note_pure_virtual_function
source: unimplemented pure virtual method %0 in %1
root: unimplemented pure virtual method {$arg0} in {$arg1}

# note_raii_guard_add_name
source: add a variable name to declare a %0 initialized with %1
root: add a variable name to declare a {$arg0} initialized with {$arg1}

# note_redefinition_include_same_file
source: '%0' included multiple times, additional include site here
root: '{$arg0}' included multiple times, additional include site here

# note_redefinition_modules_same_file
source: '%0' included multiple times, additional include site in header from module '%1'
root: '{$arg0}' included multiple times, additional include site in header from module '{$arg1}'

# note_ref_or_ptr_member_declared_here
source: %select{reference|pointer}0 member declared here
root: {$arg0 :select s0=|reference| s1=|pointer|} member declared here

# note_refconst_member_not_initialized
source: %select{const|reference}0 member %1 will never be initialized
root: {$arg0 :select s0=|const| s1=|reference|} member {$arg1} will never be initialized

# note_reference_is_return_value
source: %0 returns a reference
root: {$arg0} returns a reference

# note_referenced_type_template
source: %select{class|type alias}0 template declared here
root: {$arg0 :select s0=|class| s1=|type alias|} template declared here

# note_reinterpret_updowncast_use_static
source: use 'static_cast' to adjust the pointer correctly while %select{upcasting|downcasting}0
root: use 'static_cast' to adjust the pointer correctly while {$arg0 :select s0=|upcasting| s1=|downcasting|}

# note_related_result_type_explicit
source: %select{overridden|current}0 method is explicitly declared 'instancetype'%select{| and is expected to return an instance of its class type}0
root: {$arg0 :select s0=|overridden| s1=|current|} method is explicitly declared 'instancetype'{$arg0 :select s0=|| s1=| and is expected to return an instance of its class type|}

# note_related_result_type_family
source: %select{overridden|current}0 method is part of the '%select{|alloc|copy|init|mutableCopy|new|autorelease|dealloc|finalize|release|retain|retainCount|self}1' method family%select{| and is expected to return an instance of its class type}0
root: {$arg0 :select s0=|overridden| s1=|current|} method is part of the '{$arg1 :select s0=|| s1=|alloc| s2=|copy| s3=|init| s4=|mutableCopy| s5=|new| s6=|autorelease| s7=|dealloc| s8=|finalize| s9=|release| s10=|retain| s11=|retainCount| s12=|self|}' method family{$arg0 :select s0=|| s1=| and is expected to return an instance of its class type|}

# note_related_result_type_inferred
source: %select{class|instance}0 method %1 is assumed to return an instance of its receiver type (%2)
root: {$arg0 :select s0=|class| s1=|instance|} method {$arg1} is assumed to return an instance of its receiver type ({$arg2})

# note_remove_abs
source: remove the call to '%0' since unsigned values cannot be negative
root: remove the call to '{$arg0}' since unsigned values cannot be negative

# note_replace_abs_function
source: use function '%0' instead
root: use function '{$arg0}' instead

# note_safe_buffer_debug_mode
source: safe buffers debug: %0
root: safe buffers debug: {$arg0}

# note_sentinel_here
source: %select{function|method|block}0 has been explicitly marked sentinel here
root: {$arg0 :select s0=|function| s1=|method| s2=|block|} has been explicitly marked sentinel here

# note_single_arg_concept_specialization_constraint_evaluated_to_false
source: %select{and|because}0 %1 does not satisfy %2
root: {$arg0 :select s0=|and| s1=|because|} {$arg1} does not satisfy {$arg2}

# note_static_for_internal_linkage
source: declare 'static' if the %select{variable|function}0 is not intended to be used outside of this translation unit
root: declare 'static' if the {$arg0 :select s0=|variable| s1=|function|} is not intended to be used outside of this translation unit

# note_struct_class_suggestion
source: did you mean %select{struct|interface|class}0 here?
root: did you mean {$arg0 :select s0=|struct| s1=|interface| s2=|class|} here?

# note_substituted_constraint_expr_is_ill_formed
source: because substituted constraint expression is ill-formed%0
root: because substituted constraint expression is ill-formed{$arg0}

# note_suspicious_sizeof_memset_silence
source: %select{parenthesize the third argument|cast the second argument to 'int'}0 to silence
root: {$arg0 :select s0=|parenthesize the third argument| s1=|cast the second argument to 'int'|} to silence

# note_switch_conversion
source: conversion to %select{integral|enumeration}0 type %1
root: conversion to {$arg0 :select s0=|integral| s1=|enumeration|} type {$arg1}

# note_tail_call_required
source: tail call required by %0 attribute here
root: tail call required by {$arg0} attribute here

# note_template_arg_internal_object
source: non-type template argument refers to %select{function|object}0 here
root: non-type template argument refers to {$arg0 :select s0=|function| s1=|object|} here

# note_template_arg_refers_here_func
source: template argument refers to function template %0, here
root: template argument refers to function template {$arg0}, here

# note_template_class_explicit_specialization_was_here
source: class template %0 was explicitly specialized here
root: class template {$arg0} was explicitly specialized here

# note_template_class_instantiation_here
source: in instantiation of template class %q0 requested here
root: in instantiation of template class {$arg0 :q} requested here

# note_template_class_instantiation_was_here
source: class template %0 was instantiated here
root: class template {$arg0} was instantiated here

# note_template_decl_external
source: template declaration from hidden source: %0
root: template declaration from hidden source: {$arg0}

# note_template_declared_here
source: %select{function template|class template|variable template|type alias template|template template parameter}0 %1 declared here
root: {$arg0 :select s0=|function template| s1=|class template| s2=|variable template| s3=|type alias template| s4=|template template parameter|} {$arg1} declared here

# note_template_enum_def_here
source: in instantiation of enumeration %q0 requested here
root: in instantiation of enumeration {$arg0 :q} requested here

# note_template_exception_spec_instantiation_here
source: in instantiation of exception specification for %0 requested here
root: in instantiation of exception specification for {$arg0} requested here

# note_template_member_class_here
source: in instantiation of member class %q0 requested here
root: in instantiation of member class {$arg0 :q} requested here

# note_template_member_function_here
source: in instantiation of member function %q0 requested here
root: in instantiation of member function {$arg0 :q} requested here

# note_template_nontype_parm_different_type
source: template non-type parameter has a different type %0 in template argument
root: template non-type parameter has a different type {$arg0} in template argument

# note_template_nontype_parm_prev_declaration
source: previous non-type template parameter with type %0 is here
root: previous non-type template parameter with type {$arg0} is here

# note_template_nsdmi_here
source: in instantiation of default member initializer %q0 requested here
root: in instantiation of default member initializer {$arg0 :q} requested here

# note_template_param_external
source: template parameter from hidden source: %0
root: template parameter from hidden source: {$arg0}

# note_template_param_list_different_arity
source: %select{too few|too many}0 template parameters in template template argument
root: {$arg0 :select s0=|too few| s1=|too many|} template parameters in template template argument

# note_template_param_prev_default_arg_in_other_module
source: previous default template argument defined in module %0
root: previous default template argument defined in module {$arg0}

# note_template_parameter_pack_here
source: previous %select{template type|non-type template|template template}0 parameter%select{| pack}1 declared here
root: previous {$arg0 :select s0=|template type| s1=|non-type template| s2=|template template|} parameter{$arg1 :select s0=|| s1=| pack|} declared here

# note_template_parameter_pack_non_pack
source: %select{template type|non-type template|template template}0 parameter%select{| pack}1 does not match %select{template type|non-type template|template template}0 parameter%select{ pack|}1 in template argument
root: {$arg0 :select s0=|template type| s1=|non-type template| s2=|template template|} parameter{$arg1 :select s0=|| s1=| pack|} does not match {$arg0 :select s0=|template type| s1=|non-type template| s2=|template template|} parameter{$arg1 :select s0=| pack| s1=||} in template argument

# note_template_prev_declaration
source: previous template %select{declaration|template parameter}0 is here
root: previous template {$arg0 :select s0=|declaration| s1=|template parameter|} is here

# note_template_static_data_member_def_here
source: in instantiation of static data member %q0 requested here
root: in instantiation of static data member {$arg0 :q} requested here

# note_template_type_alias_instantiation_here
source: in instantiation of template type alias %0 requested here
root: in instantiation of template type alias {$arg0} requested here

# note_template_variable_def_here
source: in instantiation of variable template specialization %q0 requested here
root: in instantiation of variable template specialization {$arg0 :q} requested here

# note_thread_warning_in_fun
source: thread warning in function %0
root: thread warning in function {$arg0}

# note_throw_in_dtor
source: %select{destructor|deallocator}0 has a %select{non-throwing|implicit non-throwing}1 exception specification
root: {$arg0 :select s0=|destructor| s1=|deallocator|} has a {$arg1 :select s0=|non-throwing| s1=|implicit non-throwing|} exception specification

# note_throw_underaligned_obj
source: required alignment of type %0 (%1 bytes) is larger than the supported alignment of C++ exception objects on this target (%2 bytes)
root: required alignment of type {$arg0} ({$arg1} bytes) is larger than the supported alignment of C++ exception objects on this target ({$arg2} bytes)

# note_transparent_union_first_field_size_align
source: %select{alignment|size}0 of first field is %1 bits
root: {$arg0 :select s0=|alignment| s1=|size|} of first field is {$arg1} bits
