Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# warn_qual_return_type
source: '%0' type qualifier%s1 on return type %plural{1:has|:have}1 no effect
root: '{$arg0}' type qualifier%s1 on return type %plural{1:has|:have}1 no effect

# warn_readonly_property
source: attribute 'readonly' of property %0 restricts attribute 'readwrite' of property inherited from %1
root: attribute 'readonly' of property {$arg0} restricts attribute 'readwrite' of property inherited from {$arg1}

# warn_receiver_forward_class
source: receiver %0 is a forward class and corresponding @interface may not exist
root: receiver {$arg0} is a forward class and corresponding @interface may not exist

# warn_receiver_forward_instance
source: receiver type %0 for instance message is a forward declaration
root: receiver type {$arg0} for instance message is a forward declaration

# warn_redecl_library_builtin
source: incompatible redeclaration of library function %0
root: incompatible redeclaration of library function {$arg0}

# warn_redeclaration_without_attribute_prev_attribute_ignored
source: %q0 redeclared without %1 attribute: previous %1 ignored
root: {$arg0 :q} redeclared without {$arg1} attribute: previous {$arg1} ignored

# warn_redeclaration_without_import_attribute
source: %q0 redeclared without 'dllimport' attribute: 'dllexport' attribute added
root: {$arg0 :q} redeclared without 'dllimport' attribute: 'dllexport' attribute added

# warn_redefine_extname_not_applied
source: #pragma redefine_extname is applicable to external C declarations only; not applied to %select{function|variable}0 %1
root: #pragma redefine_extname is applicable to external C declarations only; not applied to {$arg0 :select s0=|function| s1=|variable|} {$arg1}

# warn_redefinition_in_param_list
source: redefinition of %0 will not be visible outside of this function
root: redefinition of {$arg0} will not be visible outside of this function

# warn_redundant_loop_iteration
source: variable %0 is %select{decremented|incremented}1 both in the loop header and in the loop body
root: variable {$arg0} is {$arg1 :select s0=|decremented| s1=|incremented|} both in the loop header and in the loop body

# warn_reference_field_is_uninit
source: reference %0 is not yet bound to a value when used here
root: reference {$arg0} is not yet bound to a value when used here

# warn_reinterpret_different_from_static
source: 'reinterpret_cast' %select{from|to}3 class %0 %select{to|from}3 its %select{virtual base|base at non-zero offset}2 %1 behaves differently from 'static_cast'
root: 'reinterpret_cast' {$arg3 :select s0=|from| s1=|to|} class {$arg0} {$arg3 :select s0=|to| s1=|from|} its {$arg2 :select s0=|virtual base| s1=|base at non-zero offset|} {$arg1} behaves differently from 'static_cast'

# warn_related_result_type_compatibility_protocol
source: protocol method is expected to return an instance of the implementing class, but is declared to return %0
root: protocol method is expected to return an instance of the implementing class, but is declared to return {$arg0}

# warn_remainder_division_by_zero
source: %select{remainder|division}0 by zero is undefined
root: {$arg0 :select s0=|remainder| s1=|division|} by zero is undefined

# warn_reserved_extern_symbol
source: identifier %0 is reserved because %select{<ERROR>|it starts with '_' at global scope|it starts with '_' and has C language linkage|it starts with '__'|it starts with '_' followed by a capital letter|it contains '__'}1
root: identifier {$arg0} is reserved because {$arg1 :select s0=|<ERROR>| s1=|it starts with '_' at global scope| s2=|it starts with '_' and has C language linkage| s3=|it starts with '__'| s4=|it starts with '_' followed by a capital letter| s5=|it contains '__'|}

# warn_reserved_module_name
source: %0 is a reserved name for a module
root: {$arg0} is a reserved name for a module

# warn_ret_local_temp_addr_ref
source: returning %select{address of|reference to}0 local temporary object
root: returning {$arg0 :select s0=|address of| s1=|reference to|} local temporary object

# warn_return_missing_expr
source: non-void %select{function|method}1 %0 should return a value
root: non-void {$arg1 :select s0=|function| s1=|method|} {$arg0} should return a value

# warn_return_typestate_for_unconsumable_type
source: return state set for an unconsumable type '%0'
root: return state set for an unconsumable type '{$arg0}'

# warn_return_typestate_mismatch
source: return value not in expected state; expected '%0', observed '%1'
root: return value not in expected state; expected '{$arg0}', observed '{$arg1}'

# warn_return_value_size
source: return value of %0 is a large (%1 bytes) pass-by-value object; pass it by reference instead ?
root: return value of {$arg0} is a large ({$arg1} bytes) pass-by-value object; pass it by reference instead ?

# warn_return_value_udt
source: %0 has C-linkage specified, but returns user-defined type %1 which is incompatible with C
root: {$arg0} has C-linkage specified, but returns user-defined type {$arg1} which is incompatible with C

# warn_return_value_udt_incomplete
source: %0 has C-linkage specified, but returns incomplete type %1 which could be incompatible with C
root: {$arg0} has C-linkage specified, but returns incomplete type {$arg1} which could be incompatible with C

# warn_root_inst_method_not_found
source: instance method %0 is being used on 'Class' which is not in the root class
root: instance method {$arg0} is being used on 'Class' which is not in the root class

# warn_sampler_initializer_invalid_bits
source: sampler initializer has invalid %0 bits
root: sampler initializer has invalid {$arg0} bits

# warn_second_parameter_to_va_arg_array
source: second argument to 'va_arg' is of array type %0; this va_arg has undefined behavior because arguments will never be compatible with array type
root: second argument to 'va_arg' is of array type {$arg0}; this va_arg has undefined behavior because arguments will never be compatible with array type

# warn_second_parameter_to_va_arg_never_compatible
source: second argument to 'va_arg' is of promotable type %0; this va_arg has undefined behavior because arguments will be promoted to %1
root: second argument to 'va_arg' is of promotable type {$arg0}; this va_arg has undefined behavior because arguments will be promoted to {$arg1}

# warn_second_parameter_to_va_arg_not_pod
source: second argument to 'va_arg' is of non-POD type %0
root: second argument to 'va_arg' is of non-POD type {$arg0}

# warn_second_parameter_to_va_arg_ownership_qualified
source: second argument to 'va_arg' is of ARC ownership-qualified type %0
root: second argument to 'va_arg' is of ARC ownership-qualified type {$arg0}

# warn_section_msvc_compat
source: `#pragma const_seg` for section %1 will not apply to %0 due to the presence of a %select{mutable field||non-trivial constructor|non-trivial destructor}2
root: `#pragma const_seg` for section {$arg1} will not apply to {$arg0} due to the presence of a {$arg2 :select s0=|mutable field| s1=|| s2=|non-trivial constructor| s3=|non-trivial destructor|}

# warn_self_assignment_builtin
source: explicitly assigning value of variable of type %0 to itself%select{|; did you mean to assign to member %2?}1
root: explicitly assigning value of variable of type {$arg0} to itself{$arg1 :select s0=|| s1=|; did you mean to assign to member {$arg2}?|}

# warn_self_assignment_overloaded
source: explicitly assigning value of variable of type %0 to itself%select{|; did you mean to assign to member %2?}1
root: explicitly assigning value of variable of type {$arg0} to itself{$arg1 :select s0=|| s1=|; did you mean to assign to member {$arg2}?|}

# warn_self_move
source: explicitly moving variable of type %0 to itself%select{|; did you mean to move to member %2?}1
root: explicitly moving variable of type {$arg0} to itself{$arg1 :select s0=|| s1=|; did you mean to move to member {$arg2}?|}

# warn_setter_getter_impl_required
source: property %0 requires method %1 to be defined - use @synthesize, @dynamic or provide a method implementation in this class implementation
root: property {$arg0} requires method {$arg1} to be defined - use @synthesize, @dynamic or provide a method implementation in this class implementation

# warn_setter_getter_impl_required_in_category
source: property %0 requires method %1 to be defined - use @dynamic or provide a method implementation in this category
root: property {$arg0} requires method {$arg1} to be defined - use @dynamic or provide a method implementation in this category

# warn_shadow_field
source: %select{parameter|non-static data member}3 %0 %select{|of %1 }3shadows member inherited from type %2
root: {$arg3 :select s0=|parameter| s1=|non-static data member|} {$arg0} {$arg3 :select s0=|| s1=|of {$arg1} |}shadows member inherited from type {$arg2}

# warn_shift_result_gt_typewidth
source: signed shift result (%0) requires %1 bits to represent, but %2 only has %3 bits
root: signed shift result ({$arg0}) requires {$arg1} bits to represent, but {$arg2} only has {$arg3} bits

# warn_shift_result_sets_sign_bit
source: signed shift result (%0) sets the sign bit of the shift expression's type (%1) and becomes negative
root: signed shift result ({$arg0}) sets the sign bit of the shift expression's type ({$arg1}) and becomes negative

# warn_signed_bitfield_enum_conversion
source: signed bit-field %0 needs an extra bit to represent the largest positive enumerators of %1
root: signed bit-field {$arg0} needs an extra bit to represent the largest positive enumerators of {$arg1}

# warn_sizeof_array_decay
source: sizeof on pointer operation will return size of %0 instead of %1
root: sizeof on pointer operation will return size of {$arg0} instead of {$arg1}

# warn_sizeof_array_param
source: sizeof on array function parameter will return size of %0 instead of %1
root: sizeof on array function parameter will return size of {$arg0} instead of {$arg1}

# warn_sizeof_pointer_expr_memaccess
source: '%0' call operates on objects of type %1 while the size is based on a different type %2
root: '{$arg0}' call operates on objects of type {$arg1} while the size is based on a different type {$arg2}

# warn_sizeof_pointer_expr_memaccess_note
source: did you mean to %select{dereference the argument to 'sizeof' (and multiply it by the number of elements)|remove the addressof in the argument to 'sizeof' (and multiply it by the number of elements)|provide an explicit length}0?
root: did you mean to {$arg0 :select s0=|dereference the argument to 'sizeof' (and multiply it by the number of elements)| s1=|remove the addressof in the argument to 'sizeof' (and multiply it by the number of elements)| s2=|provide an explicit length|}?

# warn_sizeof_pointer_type_memaccess
source: argument to 'sizeof' in %0 call is the same pointer type %1 as the %select{destination|source}2; expected %3 or an explicit length
root: argument to 'sizeof' in {$arg0} call is the same pointer type {$arg1} as the {$arg2 :select s0=|destination| s1=|source|}; expected {$arg3} or an explicit length

# warn_sme_locally_streaming_has_vl_args_returns
source: %select{returning|passing}0 a VL-dependent argument %select{from|to}0 a locally streaming function is undefined behaviour when the streaming and non-streaming vector lengths are different at runtime
root: {$arg0 :select s0=|returning| s1=|passing|} a VL-dependent argument {$arg0 :select s0=|from| s1=|to|} a locally streaming function is undefined behaviour when the streaming and non-streaming vector lengths are different at runtime

# warn_sme_streaming_pass_return_vl_to_non_streaming
source: %select{returning|passing}0 a VL-dependent argument %select{from|to}0 a function with a different streaming-mode is undefined behaviour when the streaming and non-streaming vector lengths are different at runtime
root: {$arg0 :select s0=|returning| s1=|passing|} a VL-dependent argument {$arg0 :select s0=|from| s1=|to|} a function with a different streaming-mode is undefined behaviour when the streaming and non-streaming vector lengths are different at runtime

# warn_sometimes_uninit_var
source: variable %0 is %select{used|captured}1 uninitialized whenever %select{'%3' condition is %select{true|false}4|'%3' loop %select{is entered|exits because its condition is false}4|'%3' loop %select{condition is true|exits because its condition is false}4|switch %3 is taken|its declaration is reached|%3 is called}2
root: variable {$arg0} is {$arg1 :select s0=|used| s1=|captured|} uninitialized whenever %select{'{$arg3}' condition is {$arg4 :select s0=|true| s1=|false|}|'{$arg3}' loop {$arg4 :select s0=|is entered| s1=|exits because its condition is false|}|'{$arg3}' loop {$arg2 :select s0=|condition is true| s1=|exits because its condition is false}4| s2=|switch {$arg3} is taken| s3=|its declaration is reached| s4=|{$arg3} is called|}

# warn_standalone_specifier
source: '%0' ignored on this declaration
root: '{$arg0}' ignored on this declaration

# warn_static_array_too_small
source: array argument is too small; %select{contains %0 elements|is of size %0}2, callee requires at least %1
root: array argument is too small; {$arg2 :select s0=|contains {$arg0} elements| s1=|is of size {$arg0}|}, callee requires at least {$arg1}

# warn_static_self_reference_in_init
source: static variable %0 is suspiciously used within its own initialization
root: static variable {$arg0} is suspiciously used within its own initialization

# warn_strict_multiple_method_decl
source: multiple methods named %0 found
root: multiple methods named {$arg0} found

# warn_strict_potentially_direct_selector_expression
source: @selector expression formed with potentially direct selector %0
root: @selector expression formed with potentially direct selector {$arg0}

# warn_strict_prototypes
source: a %select{function|block}0 declaration without a prototype is deprecated %select{in all versions of C|}0
root: a {$arg0 :select s0=|function| s1=|block|} declaration without a prototype is deprecated {$arg0 :select s0=|in all versions of C| s1=||}

# warn_strict_uses_without_prototype
source: passing arguments to %select{a function|%1}0 without a prototype is deprecated in all versions of C and is not supported in C23
root: passing arguments to {$arg0 :select s0=|a function| s1=|{$arg1}|} without a prototype is deprecated in all versions of C and is not supported in C23

# warn_string_plus_char
source: adding %0 to a string pointer does not append to the string
root: adding {$arg0} to a string pointer does not append to the string

# warn_string_plus_int
source: adding %0 to a string does not append to the string
root: adding {$arg0} to a string does not append to the string

# warn_stringcompare
source: result of comparison against %select{a string literal|@encode}0 is unspecified (use an explicit string comparison function instead)
root: result of comparison against {$arg0 :select s0=|a string literal| s1=|@encode|} is unspecified (use an explicit string comparison function instead)

# warn_strlcpycat_wrong_size
source: size argument in %0 call appears to be size of the source; expected the size of the destination
root: size argument in {$arg0} call appears to be size of the source; expected the size of the destination

# warn_struct_class_previous_tag_mismatch
source: %2 defined as %select{a struct|an interface|a class}0%select{| template}1 here but previously declared as %select{a struct|an interface|a class}3%select{| template}1; this is valid, but may result in linker errors under the Microsoft C++ ABI
root: {$arg2} defined as {$arg0 :select s0=|a struct| s1=|an interface| s2=|a class|}{$arg1 :select s0=|| s1=| template|} here but previously declared as {$arg3 :select s0=|a struct| s1=|an interface| s2=|a class|}{$arg1 :select s0=|| s1=| template|}; this is valid, but may result in linker errors under the Microsoft C++ ABI

# warn_struct_class_tag_mismatch
source: %select{struct|interface|class}0%select{| template}1 %2 was previously declared as a %select{struct|interface|class}3%select{| template}1; this is valid, but may result in linker errors under the Microsoft C++ ABI
root: {$arg0 :select s0=|struct| s1=|interface| s2=|class|}{$arg1 :select s0=|| s1=| template|} {$arg2} was previously declared as a {$arg3 :select s0=|struct| s1=|interface| s2=|class|}{$arg1 :select s0=|| s1=| template|}; this is valid, but may result in linker errors under the Microsoft C++ ABI

# warn_sub_ptr_zero_size_types
source: subtraction of pointers to type %0 of zero size has undefined behavior
root: subtraction of pointers to type {$arg0} of zero size has undefined behavior

# warn_suggest_destructor_marked_not_override_overriding
source: %0 overrides a destructor but is not marked 'override'
root: {$arg0} overrides a destructor but is not marked 'override'

# warn_suggest_function_marked_not_override_overriding
source: %0 overrides a member function but is not marked 'override'
root: {$arg0} overrides a member function but is not marked 'override'

# warn_suggest_noreturn_function
source: %select{function|method}0 %1 could be declared with attribute 'noreturn'
root: {$arg0 :select s0=|function| s1=|method|} {$arg1} could be declared with attribute 'noreturn'

# warn_superclass_variable_sized_type_not_at_end
source: field %0 can overwrite instance variable %1 with variable sized type %2 in superclass %3
root: field {$arg0} can overwrite instance variable {$arg1} with variable sized type {$arg2} in superclass {$arg3}

# warn_suspicious_sizeof_memset
source: %select{'size' argument to memset is '0'|setting buffer to a 'sizeof' expression}0; did you mean to transpose the last two arguments?
root: {$arg0 :select s0=|'size' argument to memset is '0'| s1=|setting buffer to a 'sizeof' expression|}; did you mean to transpose the last two arguments?

# warn_sycl_kernel_name_not_a_class_type
source: %0 is not a valid SYCL kernel name type; a non-union class type is required
root: {$arg0} is not a valid SYCL kernel name type; a non-union class type is required

# warn_taking_address_of_packed_member
source: taking address of packed member %0 of class or structure %q1 may result in an unaligned pointer value
root: taking address of packed member {$arg0} of class or structure {$arg1 :q} may result in an unaligned pointer value

# warn_tautological_bool_compare
source: result of comparison of %select{constant %0|true|false}1 with %select{expression of type %2|boolean expression}3 is always %4
root: result of comparison of {$arg1 :select s0=|constant {$arg0}| s1=|true| s2=|false|} with {$arg3 :select s0=|expression of type {$arg2}| s1=|boolean expression|} is always {$arg4}

# warn_tautological_compare_objc_bool
source: result of comparison of constant %0 with expression of type 'BOOL' is always %1, as the only well defined values for 'BOOL' are YES and NO
root: result of comparison of constant {$arg0} with expression of type 'BOOL' is always {$arg1}, as the only well defined values for 'BOOL' are YES and NO

# warn_tautological_compare_value_range
source: result of comparison of %select{%4|%1-bit %select{signed|unsigned}2 value}0 %3 %select{%1-bit %select{signed|unsigned}2 value|%4}0 is always %5
root: result of comparison of %select{{$arg4}|{$arg1}-bit {$arg0 :select s0=|signed| s1=|unsigned}2 value|} {$arg3} %select{{$arg1}-bit {$arg0 :select s0=|signed| s1=|unsigned}2 value| s2=|{$arg4}|} is always {$arg5}

# warn_tautological_constant_compare
source: result of comparison %select{%3|%1}0 %2 %select{%1|%3}0 is always %4
root: result of comparison {$arg0 :select s0=|{$arg3}| s1=|{$arg1}|} {$arg2} {$arg0 :select s0=|{$arg1}| s1=|{$arg3}|} is always {$arg4}

# warn_tcb_enforcement_violation
source: calling %0 is a violation of trusted computing base '%1'
root: calling {$arg0} is a violation of trusted computing base '{$arg1}'

# warn_template_arg_negative
source: non-type template argument with value '%0' converted to '%1' for unsigned template parameter of type %2
root: non-type template argument with value '{$arg0}' converted to '{$arg1}' for unsigned template parameter of type {$arg2}

# warn_template_arg_too_large
source: non-type template argument value '%0' truncated to '%1' for template parameter of type %2
root: non-type template argument value '{$arg0}' truncated to '{$arg1}' for template parameter of type {$arg2}

# warn_this_null_compare
source: 'this' pointer cannot be null in well-defined C++ code; comparison may be assumed to always evaluate to %select{true|false}0
root: 'this' pointer cannot be null in well-defined C++ code; comparison may be assumed to always evaluate to {$arg0 :select s0=|true| s1=|false|}

# warn_thread_attribute_argument_not_lockable
source: %0 attribute requires arguments whose type is annotated with 'capability' attribute; type here is %1
root: {$arg0} attribute requires arguments whose type is annotated with 'capability' attribute; type here is {$arg1}

# warn_thread_attribute_decl_not_lockable
source: %0 attribute can only be applied in a context annotated with 'capability' attribute
root: {$arg0} attribute can only be applied in a context annotated with 'capability' attribute

# warn_thread_attribute_decl_not_pointer
source: %0 only applies to pointer types; type here is %1
root: {$arg0} only applies to pointer types; type here is {$arg1}

# warn_thread_attribute_ignored
source: ignoring %0 attribute because its argument is invalid
root: ignoring {$arg0} attribute because its argument is invalid

# warn_thread_attribute_not_on_capability_member
source: %0 attribute without capability arguments refers to 'this', but %1 isn't annotated with 'capability' or 'scoped_lockable' attribute
root: {$arg0} attribute without capability arguments refers to 'this', but {$arg1} isn't annotated with 'capability' or 'scoped_lockable' attribute

# warn_thread_attribute_not_on_non_static_member
source: %0 attribute without capability arguments can only be applied to non-static methods of a class
root: {$arg0} attribute without capability arguments can only be applied to non-static methods of a class

# warn_thread_attribute_not_on_scoped_lockable_param
source: %0 attribute applies to function parameters only if their type is a reference to a 'scoped_lockable'-annotated type
root: {$arg0} attribute applies to function parameters only if their type is a reference to a 'scoped_lockable'-annotated type

# warn_throw_in_noexcept_func
source: %0 has a non-throwing exception specification but can still throw
root: {$arg0} has a non-throwing exception specification but can still throw

# warn_transparent_union_attribute_field_size_align
source: %select{alignment|size}0 of field %1 (%2 bits) does not match the %select{alignment|size}0 of the first field in transparent union; transparent_union attribute ignored
root: {$arg0 :select s0=|alignment| s1=|size|} of field {$arg1} ({$arg2} bits) does not match the {$arg0 :select s0=|alignment| s1=|size|} of the first field in transparent union; transparent_union attribute ignored

# warn_transparent_union_attribute_floating
source: first field of a transparent union cannot have %select{floating point|vector}0 type %1; transparent_union attribute ignored
root: first field of a transparent union cannot have {$arg0 :select s0=|floating point| s1=|vector|} type {$arg1}; transparent_union attribute ignored

# warn_type_attribute_deprecated_on_decl
source: applying attribute %0 to a declaration is deprecated; apply it to the type instead
root: applying attribute {$arg0} to a declaration is deprecated; apply it to the type instead

# warn_type_attribute_wrong_type
source: '%0' only applies to %select{function|pointer|Objective-C object or block pointer}1 types; type here is %2
root: '{$arg0}' only applies to {$arg1 :select s0=|function| s1=|pointer| s2=|Objective-C object or block pointer|} types; type here is {$arg2}
