Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# err_objc_subscript_dic_object_type
source: method object parameter type %0 is not object type
root: method object parameter type {$arg0} is not object type

# err_objc_subscript_index_type
source: method index parameter type %0 is not integral type
root: method index parameter type {$arg0} is not integral type

# err_objc_subscript_key_type
source: method key parameter type %0 is not object type
root: method key parameter type {$arg0} is not object type

# err_objc_subscript_method_not_found
source: expected method to %select{read|write}1 %select{dictionary|array}2 element not found on object of type %0
root: expected method to {$arg1 :select s0=|read| s1=|write|} {$arg2 :select s0=|dictionary| s1=|array|} element not found on object of type {$arg0}

# err_objc_subscript_object_type
source: cannot assign to this %select{dictionary|array}1 because assigning method's 2nd parameter of type %0 is not an Objective-C pointer type
root: cannot assign to this {$arg1 :select s0=|dictionary| s1=|array|} because assigning method's 2nd parameter of type {$arg0} is not an Objective-C pointer type

# err_objc_subscript_pointer
source: indexing expression is invalid because subscript type %0 is not an Objective-C pointer
root: indexing expression is invalid because subscript type {$arg0} is not an Objective-C pointer

# err_objc_subscript_type_conversion
source: indexing expression is invalid because subscript type %0 is not an integral or Objective-C pointer type
root: indexing expression is invalid because subscript type {$arg0} is not an integral or Objective-C pointer type

# err_objc_synchronized_expects_object
source: @synchronized requires an Objective-C object type (%0 invalid)
root: @synchronized requires an Objective-C object type ({$arg0} invalid)

# err_objc_throw_expects_object
source: @throw requires an Objective-C object type (%0 invalid)
root: @throw requires an Objective-C object type ({$arg0} invalid)

# err_objc_type_arg_does_not_match_bound
source: type argument %0 does not satisfy the bound (%1) of type parameter %2
root: type argument {$arg0} does not satisfy the bound ({$arg1}) of type parameter {$arg2}

# err_objc_type_arg_explicit_nullability
source: type argument %0 cannot explicitly specify nullability
root: type argument {$arg0} cannot explicitly specify nullability

# err_objc_type_arg_missing
source: no type or protocol named %0
root: no type or protocol named {$arg0}

# err_objc_type_arg_missing_star
source: type argument %0 must be a pointer (requires a '*')
root: type argument {$arg0} must be a pointer (requires a '*')

# err_objc_type_arg_not_id_compatible
source: type argument %0 is neither an Objective-C object nor a block type
root: type argument {$arg0} is neither an Objective-C object nor a block type

# err_objc_type_arg_qualified
source: type argument %0 cannot be qualified with '%1'
root: type argument {$arg0} cannot be qualified with '{$arg1}'

# err_objc_type_args_and_protocols
source: angle brackets contain both a %select{type|protocol}0 (%1) and a %select{protocol|type}0 (%2)
root: angle brackets contain both a {$arg0 :select s0=|type| s1=|protocol|} ({$arg1}) and a {$arg0 :select s0=|protocol| s1=|type|} ({$arg2})

# err_objc_type_args_non_class
source: type arguments cannot be applied to non-class type %0
root: type arguments cannot be applied to non-class type {$arg0}

# err_objc_type_args_non_parameterized_class
source: type arguments cannot be applied to non-parameterized class %0
root: type arguments cannot be applied to non-parameterized class {$arg0}

# err_objc_type_args_specialized_class
source: type arguments cannot be applied to already-specialized class type %0
root: type arguments cannot be applied to already-specialized class type {$arg0}

# err_objc_type_args_wrong_arity
source: too %select{many|few}0 type arguments for class %1 (have %2, expected %3)
root: too {$arg0 :select s0=|many| s1=|few|} type arguments for class {$arg1} (have {$arg2}, expected {$arg3})

# err_objc_type_param_arity_mismatch
source: %select{forward class declaration|class definition|category|extension}0 has too %select{few|many}1 type parameters (expected %2, have %3)
root: {$arg0 :select s0=|forward class declaration| s1=|class definition| s2=|category| s3=|extension|} has too {$arg1 :select s0=|few| s1=|many|} type parameters (expected {$arg2}, have {$arg3})

# err_objc_type_param_bound_conflict
source: type bound %0 for type parameter %1 conflicts with %select{implicit|previous}2 bound %3%select{for type parameter %5|}4
root: type bound {$arg0} for type parameter {$arg1} conflicts with {$arg2 :select s0=|implicit| s1=|previous|} bound {$arg3}{$arg4 :select s0=|for type parameter {$arg5}| s1=||}

# err_objc_type_param_bound_explicit_nullability
source: type parameter %0 bound %1 cannot explicitly specify nullability
root: type parameter {$arg0} bound {$arg1} cannot explicitly specify nullability

# err_objc_type_param_bound_missing
source: missing type bound %0 for type parameter %1 in %select{@interface|@class}2
root: missing type bound {$arg0} for type parameter {$arg1} in {$arg2 :select s0=|@interface| s1=|@class|}

# err_objc_type_param_bound_missing_pointer
source: missing '*' in type bound %0 for type parameter %1
root: missing '*' in type bound {$arg0} for type parameter {$arg1}

# err_objc_type_param_bound_nonobject
source: type bound %0 for type parameter %1 is not an Objective-C pointer type
root: type bound {$arg0} for type parameter {$arg1} is not an Objective-C pointer type

# err_objc_type_param_bound_qualified
source: type bound %1 for type parameter %0 cannot be qualified with '%2'
root: type bound {$arg1} for type parameter {$arg0} cannot be qualified with '{$arg2}'

# err_objc_type_param_redecl
source: redeclaration of type parameter %0
root: redeclaration of type parameter {$arg0}

# err_objc_type_param_variance_conflict
source: %select{in|co|contra}0variant type parameter %1 conflicts with previous %select{in|co|contra}2variant type parameter %3
root: {$arg0 :select s0=|in| s1=|co| s2=|contra|}variant type parameter {$arg1} conflicts with previous {$arg2 :select s0=|in| s1=|co| s2=|contra|}variant type parameter {$arg3}

# err_objc_variable_sized_type_not_at_end
source: field %0 with variable sized type %1 is not at the end of class
root: field {$arg0} with variable sized type {$arg1} is not at the end of class

# err_object_cannot_be_passed_returned_by_value
source: interface type %1 cannot be %select{returned|passed}0 by value; did you forget * in %1?
root: interface type {$arg1} cannot be {$arg0 :select s0=|returned| s1=|passed|} by value; did you forget * in {$arg1}?

# err_offsetof_array_type
source: offsetof requires array type, %0 invalid
root: offsetof requires array type, {$arg0} invalid

# err_offsetof_bitfield
source: cannot compute offset of bit-field %0
root: cannot compute offset of bit-field {$arg0}

# err_offsetof_incomplete_type
source: offsetof of incomplete type %0
root: offsetof of incomplete type {$arg0}

# err_offsetof_record_type
source: offsetof requires struct, union, or class type, %0 invalid
root: offsetof requires struct, union, or class type, {$arg0} invalid

# err_omp_adjust_arg_multiple_clauses
source: 'adjust_arg' argument %0 used in multiple clauses
root: 'adjust_arg' argument {$arg0} used in multiple clauses

# err_omp_aligned_expected_array_or_ptr
source: argument of aligned clause should be array%select{ or pointer|, pointer, reference to array or reference to pointer}1, not %0
root: argument of aligned clause should be array{$arg1 :select s0=| or pointer| s1=|, pointer, reference to array or reference to pointer|}, not {$arg0}

# err_omp_ambiguous_conversion
source: ambiguous conversion from type %0 to an integral or unscoped enumeration type
root: ambiguous conversion from type {$arg0} to an integral or unscoped enumeration type

# err_omp_atomic_incompatible_mem_order_clause
source: directive '#pragma omp atomic%select{ %0|}1' cannot be used with '%2' clause
root: directive '#pragma omp atomic{$arg1 :select s0=| {$arg0}| s1=||}' cannot be used with '{$arg2}' clause

# err_omp_atomic_no_compare
source: expected 'compare' clause with the '%0' modifier
root: expected 'compare' clause with the '{$arg0}' modifier

# err_omp_bit_fields_forbidden_in_clause
source: bit fields cannot be used to specify storage in a '%0' clause
root: bit fields cannot be used to specify storage in a '{$arg0}' clause

# err_omp_clause_floating_type_arg
source: arguments of OpenMP clause '%0' with bitwise operators cannot be of floating type
root: arguments of OpenMP clause '{$arg0}' with bitwise operators cannot be of floating type

# err_omp_clause_not_arithmetic_type_arg
source: arguments of OpenMP clause '%0' for 'min' or 'max' must be of %select{scalar|arithmetic}1 type
root: arguments of OpenMP clause '{$arg0}' for 'min' or 'max' must be of {$arg1 :select s0=|scalar| s1=|arithmetic|} type

# err_omp_clause_requires_dispatch_construct
source: '%0' clause requires 'dispatch' context selector
root: '{$arg0}' clause requires 'dispatch' context selector

# err_omp_clauses_mutually_exclusive
source: '%0' and '%1' clause are mutually exclusive and may not appear on the same directive
root: '{$arg0}' and '{$arg1}' clause are mutually exclusive and may not appear on the same directive

# err_omp_const_list_item
source: const-qualified list item cannot be %0
root: const-qualified list item cannot be {$arg0}

# err_omp_const_not_mutable_variable
source: const-qualified variable without mutable fields cannot be %0
root: const-qualified variable without mutable fields cannot be {$arg0}

# err_omp_const_variable
source: const-qualified variable cannot be %0
root: const-qualified variable cannot be {$arg0}

# err_omp_declare_mapper_redefinition
source: redefinition of user-defined mapper for type %0 with name %1
root: redefinition of user-defined mapper for type {$arg0} with name {$arg1}

# err_omp_declare_mapper_wrong_var
source: only variable %0 is allowed in map clauses of this 'omp declare mapper' directive
root: only variable {$arg0} is allowed in map clauses of this 'omp declare mapper' directive

# err_omp_declare_reduction_redefinition
source: redefinition of user-defined reduction for type %0
root: redefinition of user-defined reduction for type {$arg0}

# err_omp_declare_target_to_and_link
source: %0 must not appear in both clauses 'to' and 'link'
root: {$arg0} must not appear in both clauses 'to' and 'link'

# err_omp_declare_variant_diff
source: function with '#pragma omp declare variant' has a different %select{calling convention|return type|constexpr specification|inline specification|storage class|linkage}0
root: function with '#pragma omp declare variant' has a different {$arg0 :select s0=|calling convention| s1=|return type| s2=|constexpr specification| s3=|inline specification| s4=|storage class| s5=|linkage|}

# err_omp_declare_variant_doesnt_support
source: '#pragma omp declare variant' does not support %select{function templates|virtual functions|deduced return types|constructors|destructors|deleted functions|defaulted functions|constexpr functions|consteval function}0
root: '#pragma omp declare variant' does not support {$arg0 :select s0=|function templates| s1=|virtual functions| s2=|deduced return types| s3=|constructors| s4=|destructors| s5=|deleted functions| s6=|defaulted functions| s7=|constexpr functions| s8=|consteval function|}

# err_omp_declare_variant_incompat_types
source: variant in '#pragma omp declare variant' with type %0 is incompatible with type %1%select{| with appended arguments}2
root: variant in '#pragma omp declare variant' with type {$arg0} is incompatible with type {$arg1}{$arg2 :select s0=|| s1=| with appended arguments|}

# err_omp_declare_variant_user_condition_not_constant
source: the user condition in the OpenMP context selector needs to be constant; %0 is not
root: the user condition in the OpenMP context selector needs to be constant; {$arg0} is not

# err_omp_defaultmap_no_attr_for_variable
source: variable %0 must have explicitly specified data sharing attributes, data mapping attributes, or in an is_device_ptr clause
root: variable {$arg0} must have explicitly specified data sharing attributes, data mapping attributes, or in an is_device_ptr clause

# err_omp_depend_clause_thread_simd
source: '%0' clauses cannot be mixed with '%1' clause
root: '{$arg0}' clauses cannot be mixed with '{$arg1}' clause

# err_omp_depend_sink_expected_loop_iteration
source: expected%select{| %1}0 loop iteration variable
root: expected{$arg0 :select s0=|| s1=| {$arg1}|} loop iteration variable

# err_omp_device_type_mismatch
source: 'device_type(%0)' does not match previously specified 'device_type(%1)' for the same declaration
root: 'device_type({$arg0})' does not match previously specified 'device_type({$arg1})' for the same declaration

# err_omp_directive_before_requires
source: '%0' region encountered before requires directive with '%1' clause
root: '{$arg0}' region encountered before requires directive with '{$arg1}' clause

# err_omp_expected_addressable_lvalue_or_array_item
source: expected addressable lvalue expression, array element%select{ or array section|, array section or array shaping expression}0%select{| of non 'omp_depend_t' type}1
root: expected addressable lvalue expression, array element{$arg0 :select s0=| or array section| s1=|, array section or array shaping expression|}{$arg1 :select s0=|| s1=| of non 'omp_depend_t' type|}

# err_omp_expected_array_alloctraits
source: expected constant sized array of 'omp_alloctrait_t' elements, not %0
root: expected constant sized array of 'omp_alloctrait_t' elements, not {$arg0}

# err_omp_expected_base_var_name
source: expected variable name as a base of the array %select{subscript|section}0
root: expected variable name as a base of the array {$arg0 :select s0=|subscript| s1=|section|}

# err_omp_expected_omp_depend_t_lvalue
source: expected lvalue expression%select{ of 'omp_depend_t' type, not %1|}0
root: expected lvalue expression{$arg0 :select s0=| of 'omp_depend_t' type, not {$arg1}| s1=||}

# err_omp_expected_var_arg
source: %0 is not a global variable, static local variable or static data member
root: {$arg0} is not a global variable, static local variable or static data member

# err_omp_expected_var_arg_suggest
source: %0 is not a global variable, static local variable or static data member; did you mean %1
root: {$arg0} is not a global variable, static local variable or static data member; did you mean {$arg1}

# err_omp_expected_var_name_member_expr
source: expected variable name%select{| or data member of current class}0
root: expected variable name{$arg0 :select s0=|| s1=| or data member of current class|}

# err_omp_expected_var_name_member_expr_or_array_item
source: expected variable name%select{|, data member of current class}0, array element or array section
root: expected variable name{$arg0 :select s0=|| s1=|, data member of current class|}, array element or array section

# err_omp_expected_var_name_member_expr_with_type
source: expected variable%select{| or static data member|, static data member, or non-static data member of current class}0 of type '%1'
root: expected variable{$arg0 :select s0=|| s1=| or static data member| s2=|, static data member, or non-static data member of current class|} of type '{$arg1}'

# err_omp_explicit_conversion
source: expression requires explicit conversion from %0 to %1
root: expression requires explicit conversion from {$arg0} to {$arg1}

# err_omp_firstprivate_incomplete_type
source: a firstprivate variable with incomplete type %0
root: a firstprivate variable with incomplete type {$arg0}

# err_omp_flush_order_clause_and_list
source: 'flush' directive with memory order clause '%0' cannot have the list
root: 'flush' directive with memory order clause '{$arg0}' cannot have the list

# err_omp_function_expected
source: '#pragma omp declare %select{simd|variant}0' can only be applied to functions
root: '#pragma omp declare {$arg0 :select s0=|simd| s1=|variant|}' can only be applied to functions

# err_omp_global_var_arg
source: arguments of '#pragma omp %0' must have %select{global storage|static storage duration}1
root: arguments of '#pragma omp {$arg0}' must have {$arg1 :select s0=|global storage| s1=|static storage duration|}

# err_omp_implied_type_not_found
source: '%0' type not found; include <omp.h>
root: '{$arg0}' type not found; include <omp.h>

# err_omp_incomplete_type
source: expression has incomplete class type %0
root: expression has incomplete class type {$arg0}

# err_omp_instantiation_not_supported
source: instantiation of '%0' not supported yet
root: instantiation of '{$arg0}' not supported yet

# err_omp_interchange_permutation_value_range
source: permutation index must be at least 1 and at most %0
root: permutation index must be at least 1 and at most {$arg0}

# err_omp_interchange_permutation_value_repeated
source: index %0 must appear exactly once in the permutation clause
root: index {$arg0} must appear exactly once in the permutation clause

# err_omp_interop_var_multiple_actions
source: interop variable %0 used in multiple action clauses
root: interop variable {$arg0} used in multiple action clauses

# err_omp_interop_variable_expected
source: expected%select{| non-const}0 variable of type 'omp_interop_t'
root: expected{$arg0 :select s0=|| s1=| non-const|} variable of type 'omp_interop_t'

# err_omp_invalid_map_type_for_directive
source: %select{map type '%1' is not allowed|map type must be specified}0 for '#pragma omp %2'
root: {$arg0 :select s0=|map type '{$arg1}' is not allowed| s1=|map type must be specified|} for '#pragma omp {$arg2}'

# err_omp_invalid_map_type_modifier_for_directive
source: map type modifier '%0' is not allowed for '#pragma omp %1'
root: map type modifier '{$arg0}' is not allowed for '#pragma omp {$arg1}'

# err_omp_invalid_mapper
source: cannot find a valid user-defined mapper for type %0 with name %1
root: cannot find a valid user-defined mapper for type {$arg0} with name {$arg1}

# err_omp_invalid_scope
source: '#pragma omp %0' directive must appear only in file scope
root: '#pragma omp {$arg0}' directive must appear only in file scope

# err_omp_invalid_target_decl
source: %0 used in declare target directive is not a variable or a function name
root: {$arg0} used in declare target directive is not a variable or a function name

# err_omp_invariant_or_linear_dependency
source: expected loop invariant expression or '<invariant1> * %0 + <invariant2>' kind of expression
root: expected loop invariant expression or '<invariant1> * {$arg0} + <invariant2>' kind of expression

# err_omp_iterator_not_integral_or_pointer
source: expected integral or pointer type as the iterator-type, not %0
root: expected integral or pointer type as the iterator-type, not {$arg0}

# err_omp_iterator_step_constant_zero
source: iterator step expression %0 evaluates to 0
root: iterator step expression {$arg0} evaluates to 0

# err_omp_iterator_step_not_integral
source: iterator step expression %0 is not the integral expression
root: iterator step expression {$arg0} is not the integral expression

# err_omp_large_expression_in_clause
source: argument to '%0' clause requires a value that can be represented by a 64-bit
root: argument to '{$arg0}' clause requires a value that can be represented by a 64-bit

# err_omp_lastprivate_incomplete_type
source: a lastprivate variable with incomplete type %0
root: a lastprivate variable with incomplete type {$arg0}

# err_omp_lastprivate_loop_var_non_loop_iteration
source: only loop iteration variables are allowed in 'lastprivate' clause in 'omp %0' directives
root: only loop iteration variables are allowed in 'lastprivate' clause in 'omp {$arg0}' directives

# err_omp_linear_expected_int_or_ptr
source: argument of a linear clause should be of integral or pointer type, not %0
root: argument of a linear clause should be of integral or pointer type, not {$arg0}

# err_omp_linear_incomplete_type
source: a linear variable with incomplete type %0
root: a linear variable with incomplete type {$arg0}

# err_omp_loop_bad_collapse_var
source: cannot use variable %1 in collapsed imperfectly-nested loop %select{init|condition|increment}0 statement
root: cannot use variable {$arg1} in collapsed imperfectly-nested loop {$arg0 :select s0=|init| s1=|condition| s2=|increment|} statement

# err_omp_loop_cannot_use_stmt
source: '%0' statement cannot be used in OpenMP for loop
root: '{$arg0}' statement cannot be used in OpenMP for loop

# err_omp_loop_incr_not_compatible
source: increment expression must cause %0 to %select{decrease|increase}1 on each iteration of OpenMP for loop
root: increment expression must cause {$arg0} to {$arg1 :select s0=|decrease| s1=|increase|} on each iteration of OpenMP for loop

# err_omp_loop_not_canonical_cond
source: condition of OpenMP for loop must be a relational comparison ('<', '<=', '>', %select{or '>='|'>=', or '!='}0) of loop variable %1
root: condition of OpenMP for loop must be a relational comparison ('<', '<=', '>', {$arg0 :select s0=|or '>='| s1=|'>=', or '!='|}) of loop variable {$arg1}

# err_omp_loop_not_canonical_incr
source: increment clause of OpenMP for loop must perform simple addition or subtraction on loop variable %0
root: increment clause of OpenMP for loop must perform simple addition or subtraction on loop variable {$arg0}

# err_omp_loop_var_dsa
source: loop iteration variable in the associated loop of 'omp %1' directive may not be %0, predetermined as %2
root: loop iteration variable in the associated loop of 'omp {$arg1}' directive may not be {$arg0}, predetermined as {$arg2}

# err_omp_loop_variable_type
source: variable must be of integer or %select{pointer|random access iterator}0 type
root: variable must be of integer or {$arg0 :select s0=|pointer| s1=|random access iterator|} type

# err_omp_multi_expr_not_allowed
source: only one expression allowed in '%0' clause
root: only one expression allowed in '{$arg0}' clause

# err_omp_negative_expression_in_clause
source: argument to '%0' clause must be a %select{non-negative|strictly positive}1 integer value
root: argument to '{$arg0}' clause must be a {$arg1 :select s0=|non-negative| s1=|strictly positive|} integer value

# err_omp_no_clause_for_directive
source: expected at least one %0 clause for '#pragma omp %1'
root: expected at least one {$arg0} clause for '#pragma omp {$arg1}'

# err_omp_no_dsa_for_variable
source: variable %0 must have explicitly specified data sharing attributes
root: variable {$arg0} must have explicitly specified data sharing attributes

# err_omp_non_lvalue_in_map_or_motion_clauses
source: expected addressable lvalue in '%0' clause
root: expected addressable lvalue in '{$arg0}' clause

# err_omp_not_for
source: %select{statement after '#pragma omp %1' must be a for loop|expected %2 for loops after '#pragma omp %1'%select{|, but found only %4}3}0
root: %select{statement after '#pragma omp {$arg1}' must be a for loop|expected {$arg2} for loops after '#pragma omp {$arg1}'{$arg0 :select s0=|| s1=|, but found only {$arg4}}3|}

# err_omp_not_integral
source: expression must have integral or unscoped enumeration type, not %0
root: expression must have integral or unscoped enumeration type, not {$arg0}

# err_omp_not_resolved_reduction_identifier
source: unable to resolve declare reduction construct for type %0
root: unable to resolve declare reduction construct for type {$arg0}

# err_omp_once_referenced
source: variable can appear only once in OpenMP '%0' clause
root: variable can appear only once in OpenMP '{$arg0}' clause
