Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# err_atomic_builtin_must_be_pointer_intptr
source: address argument to atomic builtin must be a pointer to integer or pointer (%0 invalid)
root: address argument to atomic builtin must be a pointer to integer or pointer ({$arg0} invalid)

# err_atomic_builtin_pointer_size
source: address argument to atomic builtin must be a pointer to 1,2,4,8 or 16 byte type (%0 invalid)
root: address argument to atomic builtin must be a pointer to 1,2,4,8 or 16 byte type ({$arg0} invalid)

# err_atomic_exclusive_builtin_pointer_size
source: address argument to load or store exclusive builtin must be a pointer to 1,2,4 or 8 byte type (%0 invalid)
root: address argument to load or store exclusive builtin must be a pointer to 1,2,4 or 8 byte type ({$arg0} invalid)

# err_atomic_load_store_uses_lib
source: atomic %select{load|store}0 requires runtime support that is not available for this target
root: atomic {$arg0 :select s0=|load| s1=|store|} requires runtime support that is not available for this target

# err_atomic_op_needs_atomic
source: address argument to atomic operation must be a pointer to _Atomic type (%0 invalid)
root: address argument to atomic operation must be a pointer to _Atomic type ({$arg0} invalid)

# err_atomic_op_needs_atomic_int
source: address argument to atomic operation must be a pointer to %select{|atomic }0integer (%1 invalid)
root: address argument to atomic operation must be a pointer to {$arg0 :select s0=|| s1=|atomic |}integer ({$arg1} invalid)

# err_atomic_op_needs_atomic_int_or_fp
source: address argument to atomic operation must be a pointer to %select{|atomic }0integer or supported floating point type (%1 invalid)
root: address argument to atomic operation must be a pointer to {$arg0 :select s0=|| s1=|atomic |}integer or supported floating point type ({$arg1} invalid)

# err_atomic_op_needs_atomic_int_or_ptr
source: address argument to atomic operation must be a pointer to %select{|atomic }0integer or pointer (%1 invalid)
root: address argument to atomic operation must be a pointer to {$arg0 :select s0=|| s1=|atomic |}integer or pointer ({$arg1} invalid)

# err_atomic_op_needs_atomic_int_ptr_or_fp
source: address argument to atomic operation must be a pointer to %select{|atomic }0integer, pointer or supported floating point type (%1 invalid)
root: address argument to atomic operation must be a pointer to {$arg0 :select s0=|| s1=|atomic |}integer, pointer or supported floating point type ({$arg1} invalid)

# err_atomic_op_needs_non_address_discriminated_pointer
source: address argument to %select{atomic|__sync}0 operation must be a pointer to a non address discriminated type (%1 invalid)
root: address argument to {$arg0 :select s0=|atomic| s1=|__sync|} operation must be a pointer to a non address discriminated type ({$arg1} invalid)

# err_atomic_op_needs_non_const_atomic
source: address argument to atomic operation must be a pointer to non-%select{const|constant}0 _Atomic type (%1 invalid)
root: address argument to atomic operation must be a pointer to non-{$arg0 :select s0=|const| s1=|constant|} _Atomic type ({$arg1} invalid)

# err_atomic_op_needs_non_const_pointer
source: address argument to atomic operation must be a pointer to non-const type (%0 invalid)
root: address argument to atomic operation must be a pointer to non-const type ({$arg0} invalid)

# err_atomic_op_needs_trivial_copy
source: address argument to atomic operation must be a pointer to a trivially-copyable type (%0 invalid)
root: address argument to atomic operation must be a pointer to a trivially-copyable type ({$arg0} invalid)

# err_atomic_property_nontrivial_assign_op
source: atomic property of reference type %0 cannot have non-trivial assignment operator
root: atomic property of reference type {$arg0} cannot have non-trivial assignment operator

# err_atomic_specifier_bad_type
source: _Atomic cannot be applied to %select{incomplete |array |function |reference |atomic |qualified |sizeless ||integer |}0type %1 %select{|||||||which is not trivially copyable||in C23}0
root: _Atomic cannot be applied to {$arg0 :select s0=|incomplete | s1=|array | s2=|function | s3=|reference | s4=|atomic | s5=|qualified | s6=|sizeless | s7=|| s8=|integer | s9=||}type {$arg1} {$arg0 :select s0=|| s1=|| s2=|| s3=|| s4=|| s5=|| s6=|| s7=|which is not trivially copyable| s8=|| s9=|in C23|}

# err_atomic_unsupported
source: atomic types are not supported in '%0'
root: atomic types are not supported in '{$arg0}'

# err_atprotocol_protocol
source: @protocol is using a forward protocol declaration of %0
root: @protocol is using a forward protocol declaration of {$arg0}

# err_attr_codemodel_arg
source: code model '%0' is not supported on this target
root: code model '{$arg0}' is not supported on this target

# err_attr_cond_never_constant_expr
source: %0 attribute expression never produces a constant expression
root: {$arg0} attribute expression never produces a constant expression

# err_attr_objc_ownership_redundant
source: the type %0 is already explicitly ownership-qualified
root: the type {$arg0} is already explicitly ownership-qualified

# err_attr_swift_error_no_error_parameter
source: %0 attribute can only be applied to a %select{function|method}1 with an error parameter
root: {$arg0} attribute can only be applied to a {$arg1 :select s0=|function| s1=|method|} with an error parameter

# err_attr_swift_error_return_type
source: %0 attribute with '%1' convention can only be applied to a %select{function|method}2 returning %select{an integral type|a pointer}3
root: {$arg0} attribute with '{$arg1}' convention can only be applied to a {$arg2 :select s0=|function| s1=|method|} returning {$arg3 :select s0=|an integral type| s1=|a pointer|}

# err_attribute_address_space_too_high
source: address space is larger than the maximum supported (%0)
root: address space is larger than the maximum supported ({$arg0})

# err_attribute_aligned_too_great
source: requested alignment must be %0 bytes or smaller
root: requested alignment must be {$arg0} bytes or smaller

# err_attribute_argument_invalid
source: %0 attribute argument is invalid: %select{max must be 0 since min is 0|min must not be greater than max}1
root: {$arg0} attribute argument is invalid: {$arg1 :select s0=|max must be 0 since min is 0| s1=|min must not be greater than max|}

# err_attribute_argument_is_zero
source: %0 attribute must be greater than 0
root: {$arg0} attribute must be greater than 0

# err_attribute_argument_n_type
source: %0 attribute requires parameter %1 to be %select{int or bool|an integer constant|a string|an identifier|a constant expression|a builtin function}2
root: {$arg0} attribute requires parameter {$arg1} to be {$arg2 :select s0=|int or bool| s1=|an integer constant| s2=|a string| s3=|an identifier| s4=|a constant expression| s5=|a builtin function|}

# err_attribute_argument_out_of_bounds
source: %0 attribute parameter %1 is out of bounds
root: {$arg0} attribute parameter {$arg1} is out of bounds

# err_attribute_argument_out_of_bounds_extra_info
source: %0 attribute parameter %1 is out of bounds: %plural{0:no parameters to index into|1:can only be 1, since there is one parameter|:must be between 1 and %2}2
root: {$arg0} attribute parameter {$arg1} is out of bounds: %plural{0:no parameters to index into|1:can only be 1, since there is one parameter|:must be between 1 and {$arg2}}2

# err_attribute_argument_out_of_range
source: %0 attribute requires integer constant between %1 and %2 inclusive
root: {$arg0} attribute requires integer constant between {$arg1} and {$arg2} inclusive

# err_attribute_argument_type
source: %0 attribute requires %select{int or bool|an integer constant|a string|an identifier}1
root: {$arg0} attribute requires {$arg1 :select s0=|int or bool| s1=|an integer constant| s2=|a string| s3=|an identifier|}

# err_attribute_arm_feature_sve_bits_unsupported
source: %0 is only supported when '-msve-vector-bits=<bits>' is specified with a value of 128, 256, 512, 1024 or 2048
root: {$arg0} is only supported when '-msve-vector-bits=<bits>' is specified with a value of 128, 256, 512, 1024 or 2048

# err_attribute_arm_sm_incompat_builtin
source: builtin can only be called from a %0 function
root: builtin can only be called from a {$arg0} function

# err_attribute_bad_rvv_vector_size
source: invalid RVV vector size '%0', expected size is '%1' based on LMUL of type and '-mrvv-vector-bits'
root: invalid RVV vector size '{$arg0}', expected size is '{$arg1}' based on LMUL of type and '-mrvv-vector-bits'

# err_attribute_bad_sve_vector_size
source: invalid SVE vector size '%0', must match value set by '-msve-vector-bits' ('%1')
root: invalid SVE vector size '{$arg0}', must match value set by '-msve-vector-bits' ('{$arg1}')

# err_attribute_bounds_for_function
source: %0 attribute references parameter %1, but the function %2 has only %3 parameters
root: {$arg0} attribute references parameter {$arg1}, but the function {$arg2} has only {$arg3} parameters

# err_attribute_builtin_alias
source: %0 attribute can only be applied to a ARM, HLSL or RISC-V builtin
root: {$arg0} attribute can only be applied to a ARM, HLSL or RISC-V builtin

# err_attribute_cleanup_arg_not_function
source: 'cleanup' argument %select{|%1 |%1 }0is not a %select{||single }0function
root: 'cleanup' argument {$arg0 :select s0=|| s1=|{$arg1} | s2=|{$arg1} |}is not a {$arg0 :select s0=|| s1=|| s2=|single |}function

# err_attribute_cleanup_func_arg_incompatible_type
source: 'cleanup' function %0 parameter has %diff{type $ which is incompatible with type $|incompatible type}1,2
root: 'cleanup' function {$arg0} parameter has %diff{type $ which is incompatible with type $|incompatible type}1,2

# err_attribute_cleanup_func_must_take_one_arg
source: 'cleanup' function %0 must take 1 parameter
root: 'cleanup' function {$arg0} must take 1 parameter

# err_attribute_dll_ambiguous_default_ctor
source: '__declspec(dllexport)' cannot be applied to more than one default constructor in %0
root: '__declspec(dllexport)' cannot be applied to more than one default constructor in {$arg0}

# err_attribute_dll_deleted
source: attribute %q0 cannot be applied to a deleted function
root: attribute {$arg0 :q} cannot be applied to a deleted function

# err_attribute_dll_lambda
source: lambda cannot be declared %0
root: lambda cannot be declared {$arg0}

# err_attribute_dll_member_of_dll_class
source: attribute %q0 cannot be applied to member of %q1 class
root: attribute {$arg0 :q} cannot be applied to member of {$arg1 :q} class

# err_attribute_dll_not_extern
source: %q0 must have external linkage when declared %q1
root: {$arg0 :q} must have external linkage when declared {$arg1 :q}

# err_attribute_dll_redeclaration
source: redeclaration of %q0 cannot add %q1 attribute
root: redeclaration of {$arg0 :q} cannot add {$arg1 :q} attribute

# err_attribute_dll_thread_local
source: %q0 cannot be thread local when declared %q1
root: {$arg0 :q} cannot be thread local when declared {$arg1 :q}

# err_attribute_integers_only
source: %0 attribute argument may only refer to a function parameter of integer type
root: {$arg0} attribute argument may only refer to a function parameter of integer type

# err_attribute_invalid_argument
source: %select{a reference type|an array type|a non-vector or non-vectorizable scalar type}0 is an invalid argument to attribute %1
root: {$arg0 :select s0=|a reference type| s1=|an array type| s2=|a non-vector or non-vectorizable scalar type|} is an invalid argument to attribute {$arg1}

# err_attribute_invalid_atomic_argument
source: invalid argument '%0' to atomic attribute; valid options are: 'remote_memory', 'fine_grained_memory', 'ignore_denormal_mode' (optionally prefixed with 'no_')
root: invalid argument '{$arg0}' to atomic attribute; valid options are: 'remote_memory', 'fine_grained_memory', 'ignore_denormal_mode' (optionally prefixed with 'no_')

# err_attribute_invalid_implicit_this_argument
source: %0 attribute is invalid for the implicit this argument
root: {$arg0} attribute is invalid for the implicit this argument

# err_attribute_invalid_matrix_type
source: invalid matrix element type %0
root: invalid matrix element type {$arg0}

# err_attribute_invalid_on_decl
source: %0%select{ attribute|}1 cannot be applied to a declaration
root: {$arg0}{$arg1 :select s0=| attribute| s1=||} cannot be applied to a declaration

# err_attribute_invalid_rvv_type
source: %0 attribute applied to non-RVV type %1
root: {$arg0} attribute applied to non-RVV type {$arg1}

# err_attribute_invalid_sve_type
source: %0 attribute applied to non-SVE type %1
root: {$arg0} attribute applied to non-SVE type {$arg1}

# err_attribute_invalid_vector_type
source: invalid vector element type %0
root: invalid vector element type {$arg0}

# err_attribute_malloc_arg_not_function
source: 'malloc' argument %select{for deallocator |%1 |%1 }0is not a %select{||single }0function
root: 'malloc' argument {$arg0 :select s0=|for deallocator | s1=|{$arg1} | s2=|{$arg1} |}is not a {$arg0 :select s0=|| s1=|| s2=|single |}function

# err_attribute_malloc_arg_not_function_with_pointer_arg
source: 'malloc' argument %0 must take a pointer type as its first argument
root: 'malloc' argument {$arg0} must take a pointer type as its first argument

# err_attribute_malloc_arg_refers_to_non_pointer_type
source: 'malloc' argument '%0' refers to non-pointer type %1 of %2
root: 'malloc' argument '{$arg0}' refers to non-pointer type {$arg1} of {$arg2}

# err_attribute_missing_on_first_decl
source: %0 attribute does not appear on the first declaration
root: {$arg0} attribute does not appear on the first declaration

# err_attribute_no_builtin_on_defaulted_deleted_function
source: %0 attribute has no effect on defaulted or deleted functions
root: {$arg0} attribute has no effect on defaulted or deleted functions

# err_attribute_no_builtin_on_non_definition
source: %0 attribute is permitted on definitions only
root: {$arg0} attribute is permitted on definitions only

# err_attribute_no_builtin_wildcard_or_builtin_name
source: empty %0 cannot be composed with named ones
root: empty {$arg0} cannot be composed with named ones

# err_attribute_no_member_function
source: %0 attribute cannot be applied to non-static member functions
root: {$arg0} attribute cannot be applied to non-static member functions

# err_attribute_no_member_pointers
source: %0 attribute cannot be used with pointers to members
root: {$arg0} attribute cannot be used with pointers to members

# err_attribute_not_clinkage
source: function type with %0 attribute must have C linkage
root: function type with {$arg0} attribute must have C linkage

# err_attribute_not_supported_in_lang
source: %0 attribute is not supported in %select{C|C++|Objective-C}1
root: {$arg0} attribute is not supported in {$arg1 :select s0=|C| s1=|C++| s2=|Objective-C|}

# err_attribute_not_supported_on_arch
source: %0 attribute is not supported on '%1'
root: {$arg0} attribute is not supported on '{$arg1}'

# err_attribute_only_once_per_parameter
source: %0 attribute can only be applied once per parameter
root: {$arg0} attribute can only be applied once per parameter

# err_attribute_overloadable_mismatch
source: redeclaration of %0 must %select{not |}1have the 'overloadable' attribute
root: redeclaration of {$arg0} must {$arg1 :select s0=|not | s1=||}have the 'overloadable' attribute

# err_attribute_overloadable_no_prototype
source: 'overloadable' function %0 must have a prototype
root: 'overloadable' function {$arg0} must have a prototype

# err_attribute_parameter_types
source: %0 attribute parameter types do not match: parameter %1 of function %2 has type %3, but parameter %4 of function %5 has type %6
root: {$arg0} attribute parameter types do not match: parameter {$arg1} of function {$arg2} has type {$arg3}, but parameter {$arg4} of function {$arg5} has type {$arg6}

# err_attribute_patchable_function_entry_invalid_section
source: section argument to 'patchable_function_entry' attribute is not valid for this target: %0
root: section argument to 'patchable_function_entry' attribute is not valid for this target: {$arg0}

# err_attribute_pointers_only
source: %0 attribute only applies to%select{| constant}1 pointer arguments
root: {$arg0} attribute only applies to{$arg1 :select s0=|| s1=| constant|} pointer arguments

# err_attribute_power_of_two_in_range
source: %0 attribute requires an integer argument which is a constant power of two between %1 and %2 inclusive; provided argument was %3
root: {$arg0} attribute requires an integer argument which is a constant power of two between {$arg1} and {$arg2} inclusive; provided argument was {$arg3}

# err_attribute_preferred_name_arg_invalid
source: argument %0 to 'preferred_name' attribute is not a typedef for a specialization of %1
root: argument {$arg0} to 'preferred_name' attribute is not a typedef for a specialization of {$arg1}

# err_attribute_regparm_invalid_number
source: 'regparm' parameter must be between 0 and %0 inclusive
root: 'regparm' parameter must be between 0 and {$arg0} inclusive

# err_attribute_requires_opencl_version
source: attribute %0 is supported in the OpenCL version %1%select{| onwards}2
root: attribute {$arg0} is supported in the OpenCL version {$arg1}{$arg2 :select s0=|| s1=| onwards|}

# err_attribute_requires_positive_integer
source: %0 attribute requires a %select{positive|non-negative}1 integral compile time constant expression
root: {$arg0} attribute requires a {$arg1 :select s0=|positive| s1=|non-negative|} integral compile time constant expression

# err_attribute_riscv_rvv_bits_unsupported
source: %0 is only supported when '-mrvv-vector-bits=<bits>' is specified with a value of "zvl" or a power 2 in the range [64,65536]
root: {$arg0} is only supported when '-mrvv-vector-bits=<bits>' is specified with a value of "zvl" or a power 2 in the range [64,65536]

# err_attribute_section_invalid_for_target
source: argument to %select{'code_seg'|'section'}1 attribute is not valid for this target: %0
root: argument to {$arg1 :select s0=|'code_seg'| s1=|'section'|} attribute is not valid for this target: {$arg0}

# err_attribute_size_too_large
source: %0 size too large
root: {$arg0} size too large

# err_attribute_sizeless_type
source: %0 attribute cannot be applied to sizeless type %1
root: {$arg0} attribute cannot be applied to sizeless type {$arg1}

# err_attribute_too_few_arguments
source: %0 attribute takes at least %1 argument%s1
root: {$arg0} attribute takes at least {$arg1} argument%s1

# err_attribute_too_many_arguments
source: %0 attribute takes no more than %1 argument%s1
root: {$arg0} attribute takes no more than {$arg1} argument%s1

# err_attribute_unsupported
source: %0 attribute is not supported on targets missing %1; specify an appropriate -march= or -mcpu=
root: {$arg0} attribute is not supported on targets missing {$arg1}; specify an appropriate -march= or -mcpu=

# err_attribute_unsupported_m_profile
source: on M-profile architectures %0 attribute is not supported on targets missing %1; specify an appropriate -march= or -mcpu=
root: on M-profile architectures {$arg0} attribute is not supported on targets missing {$arg1}; specify an appropriate -march= or -mcpu=

# err_attribute_weakref_not_global_context
source: weakref declaration of %0 must be in a global context
root: weakref declaration of {$arg0} must be in a global context

# err_attribute_weakref_without_alias
source: weakref declaration of %0 must also have an alias attribute
root: weakref declaration of {$arg0} must also have an alias attribute

# err_attribute_wrong_decl_type_str
source: %0%select{ attribute|}1 only applies to %2
root: {$arg0}{$arg1 :select s0=| attribute| s1=||} only applies to {$arg2}

# err_attribute_wrong_number_arguments
source: %0 attribute %plural{0:takes no arguments|1:takes one argument|:requires exactly %1 arguments}1
root: {$arg0} attribute %plural{0:takes no arguments|1:takes one argument|:requires exactly {$arg1} arguments}1

# err_attribute_wrong_number_arguments_for
source: %0 attribute references function %1, which %plural{0:takes no arguments|1:takes one argument|:takes exactly %2 arguments}2
root: {$arg0} attribute references function {$arg1}, which %plural{0:takes no arguments|1:takes one argument|:takes exactly {$arg2} arguments}2

# err_attribute_zero_size
source: zero %0 size
root: zero {$arg0} size

# err_attributes_are_not_compatible
source: %0 and %1%select{ attributes|}2 are not compatible
root: {$arg0} and {$arg1}{$arg2 :select s0=| attributes| s1=||} are not compatible

# err_auto_different_deductions
source: %select{'auto'|'decltype(auto)'|'__auto_type'|template arguments}0 deduced as %1 in declaration of %2 and deduced as %3 in declaration of %4
root: {$arg0 :select s0=|'auto'| s1=|'decltype(auto)'| s2=|'__auto_type'| s3=|template arguments|} deduced as {$arg1} in declaration of {$arg2} and deduced as {$arg3} in declaration of {$arg4}

# err_auto_expr_deduction_failure
source: functional-style cast to %0 has incompatible initializer of type %1
root: functional-style cast to {$arg0} has incompatible initializer of type {$arg1}

# err_auto_expr_init_multiple_expressions
source: initializer for functional-style cast to %0 contains multiple expressions
root: initializer for functional-style cast to {$arg0} contains multiple expressions

# err_auto_expr_init_no_expression
source: initializer for functional-style cast to %0 is empty
root: initializer for functional-style cast to {$arg0} is empty

# err_auto_expr_init_paren_braces
source: cannot deduce actual type for %1 from %select{parenthesized|nested}0 initializer list
root: cannot deduce actual type for {$arg1} from {$arg0 :select s0=|parenthesized| s1=|nested|} initializer list

# err_auto_fn_deduction_failure
source: cannot deduce return type %0 from returned value of type %1
root: cannot deduce return type {$arg0} from returned value of type {$arg1}

# err_auto_fn_different_deductions
source: '%select{auto|decltype(auto)}0' in return type deduced as %1 here but deduced as %2 in earlier return statement
root: '{$arg0 :select s0=|auto| s1=|decltype(auto)|}' in return type deduced as {$arg1} here but deduced as {$arg2} in earlier return statement

# err_auto_fn_no_return_but_not_auto
source: cannot deduce return type %0 for function with no return statements
root: cannot deduce return type {$arg0} for function with no return statements

# err_auto_fn_return_void_but_not_auto
source: cannot deduce return type %0 from omitted return expression
root: cannot deduce return type {$arg0} from omitted return expression

# err_auto_fn_used_before_defined
source: function %0 with deduced return type cannot be used before it is defined
root: function {$arg0} with deduced return type cannot be used before it is defined

# err_auto_init_list_from_c
source: cannot use %select{'auto'|<ERROR>|'__auto_type'}0 with %select{initializer list|array}1 in C
root: cannot use {$arg0 :select s0=|'auto'| s1=|<ERROR>| s2=|'__auto_type'|} with {$arg1 :select s0=|initializer list| s1=|array|} in C

# err_auto_new_ctor_multiple_expressions
source: new expression for type %0 contains multiple constructor arguments
root: new expression for type {$arg0} contains multiple constructor arguments

# err_auto_new_deduction_failure
source: new expression for type %0 has incompatible constructor argument of type %1
root: new expression for type {$arg0} has incompatible constructor argument of type {$arg1}

# err_auto_new_requires_ctor_arg
source: new expression for type %0 requires a constructor argument
root: new expression for type {$arg0} requires a constructor argument
