Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# err_covariant_return_ambiguous_derived_to_base_conv
source: return type of virtual function %3 is not covariant with the return type of the function it overrides (ambiguous conversion from derived class %0 to base class %1:%2)
root: return type of virtual function {$arg3} is not covariant with the return type of the function it overrides (ambiguous conversion from derived class {$arg0} to base class {$arg1}:{$arg2})

# err_covariant_return_inaccessible_base
source: invalid covariant return for virtual function: %1 is a %select{private|protected}2 base class of %0
root: invalid covariant return for virtual function: {$arg1} is a {$arg2 :select s0=|private| s1=|protected|} base class of {$arg0}

# err_covariant_return_incomplete
source: return type of virtual function %0 is not covariant with the return type of the function it overrides (%1 is incomplete)
root: return type of virtual function {$arg0} is not covariant with the return type of the function it overrides ({$arg1} is incomplete)

# err_covariant_return_not_derived
source: return type of virtual function %0 is not covariant with the return type of the function it overrides (%1 is not derived from %2)
root: return type of virtual function {$arg0} is not covariant with the return type of the function it overrides ({$arg1} is not derived from {$arg2})

# err_covariant_return_type_class_type_not_same_or_less_qualified
source: return type of virtual function %0 is not covariant with the return type of the function it overrides (class type %1 does not have the same cv-qualification as or less cv-qualification than class type %2)
root: return type of virtual function {$arg0} is not covariant with the return type of the function it overrides (class type {$arg1} does not have the same cv-qualification as or less cv-qualification than class type {$arg2})

# err_covariant_return_type_different_qualifications
source: return type of virtual function %0 is not covariant with the return type of the function it overrides (%1 has different qualifiers than %2)
root: return type of virtual function {$arg0} is not covariant with the return type of the function it overrides ({$arg1} has different qualifiers than {$arg2})

# err_cpu_specific_multiple_defs
source: multiple 'cpu_specific' functions cannot specify the same CPU: %0
root: multiple 'cpu_specific' functions cannot specify the same CPU: {$arg0}

# err_ctor_dtor_returns_void
source: %select{constructor|destructor}1 %0 must not return void expression
root: {$arg1 :select s0=|constructor| s1=|destructor|} {$arg0} must not return void expression

# err_cuda_ctor_dtor_attrs
source: CUDA does not support global %0 for __device__ functions
root: CUDA does not support global {$arg0} for __device__ functions

# err_cuda_device_builtin_surftex_cls_template
source: illegal device builtin %select{surface|texture}0 reference class template %1 declared here
root: illegal device builtin {$arg0 :select s0=|surface| s1=|texture|} reference class template {$arg1} declared here

# err_cuda_device_builtin_surftex_ref_decl
source: illegal device builtin %select{surface|texture}0 reference type %1 declared here
root: illegal device builtin {$arg0 :select s0=|surface| s1=|texture|} reference type {$arg1} declared here

# err_cuda_device_exceptions
source: cannot use '%0' in %select{__device__|__global__|__host__|__host__ __device__}1 function
root: cannot use '{$arg0}' in {$arg1 :select s0=|__device__| s1=|__global__| s2=|__host__| s3=|__host__ __device__|} function

# err_cuda_extern_shared
source: __shared__ variable %0 cannot be 'extern'
root: __shared__ variable {$arg0} cannot be 'extern'

# err_cuda_host_shared
source: __shared__ local variables not allowed in %select{__device__|__global__|__host__|__host__ __device__}0 functions
root: __shared__ local variables not allowed in {$arg0 :select s0=|__device__| s1=|__global__| s2=|__host__| s3=|__host__ __device__|} functions

# err_cuda_ovl_target
source: %select{__device__|__global__|__host__|__host__ __device__}0 function %1 cannot overload %select{__device__|__global__|__host__|__host__ __device__}2 function %3
root: {$arg0 :select s0=|__device__| s1=|__global__| s2=|__host__| s3=|__host__ __device__|} function {$arg1} cannot overload {$arg2 :select s0=|__device__| s1=|__global__| s2=|__host__| s3=|__host__ __device__|} function {$arg3}

# err_cuda_unattributed_constexpr_cannot_overload_device
source: constexpr function %0 without __host__ or __device__ attributes cannot overload __device__ function with the same signature; add a __host__ attribute, or build with -fno-cuda-host-device-constexpr
root: constexpr function {$arg0} without __host__ or __device__ attributes cannot overload __device__ function with the same signature; add a __host__ attribute, or build with -fno-cuda-host-device-constexpr

# err_cuda_vla
source: cannot use variable-length arrays in %select{__device__|__global__|__host__|__host__ __device__}0 functions
root: cannot use variable-length arrays in {$arg0 :select s0=|__device__| s1=|__global__| s2=|__host__| s3=|__host__ __device__|} functions

# err_current_module_name_mismatch
source: module name '%0' specified on command line does not match name of module
root: module name '{$arg0}' specified on command line does not match name of module

# err_dangling_member
source: %select{reference|backing array for 'std::initializer_list'}2 %select{|subobject of }1member %0 %select{binds to|is}2 a temporary object whose lifetime would be shorter than the lifetime of the constructed object
root: {$arg2 :select s0=|reference| s1=|backing array for 'std::initializer_list'|} {$arg1 :select s0=|| s1=|subobject of |}member {$arg0} {$arg2 :select s0=|binds to| s1=|is|} a temporary object whose lifetime would be shorter than the lifetime of the constructed object

# err_dealloc_bad_result_type
source: dealloc return type must be correctly specified as 'void' under ARC, instead of %0
root: dealloc return type must be correctly specified as 'void' under ARC, instead of {$arg0}

# err_decl_attribute_invalid_on_stmt
source: %0%select{ attribute|}1 cannot be applied to a statement
root: {$arg0}{$arg1 :select s0=| attribute| s1=||} cannot be applied to a statement

# err_decl_negative_array_size
source: '%0' declared as an array with a negative size
root: '{$arg0}' declared as an array with a negative size

# err_declspec_keyword_has_no_effect
source: %0 cannot appear here, place it after "%select{class|struct|interface|union|enum}1" to apply it to the type declaration
root: {$arg0} cannot appear here, place it after "{$arg1 :select s0=|class| s1=|struct| s2=|interface| s3=|union| s4=|enum|}" to apply it to the type declaration

# err_decltype_auto_compound_type
source: cannot form %select{pointer to|reference to|array of}0 'decltype(auto)'
root: cannot form {$arg0 :select s0=|pointer to| s1=|reference to| s2=|array of|} 'decltype(auto)'

# err_decomp_decl_ambiguous_base
source: cannot decompose members of ambiguous base class %1 of %0:%2
root: cannot decompose members of ambiguous base class {$arg1} of {$arg0}:{$arg2}

# err_decomp_decl_anon_union_member
source: cannot decompose class type %0 because it has an anonymous %select{struct|union}1 member
root: cannot decompose class type {$arg0} because it has an anonymous {$arg1 :select s0=|struct| s1=|union|} member

# err_decomp_decl_inaccessible_base
source: cannot decompose members of inaccessible base class %1 of %0
root: cannot decompose members of inaccessible base class {$arg1} of {$arg0}

# err_decomp_decl_inaccessible_field
source: cannot decompose %select{private|protected}0 member %1 of %3
root: cannot decompose {$arg0 :select s0=|private| s1=|protected|} member {$arg1} of {$arg3}

# err_decomp_decl_multiple_bases_with_members
source: cannot decompose class type %1: %select{its base classes %2 and|both it and its base class}0 %3 have non-static data members
root: cannot decompose class type {$arg1}: {$arg0 :select s0=|its base classes {$arg2} and| s1=|both it and its base class|} {$arg3} have non-static data members

# err_decomp_decl_requires_init
source: decomposition declaration %0 requires an initializer
root: decomposition declaration {$arg0} requires an initializer

# err_decomp_decl_spec
source: decomposition declaration cannot be declared %plural{1:'%1'|:with '%1' specifiers}0
root: decomposition declaration cannot be declared %plural{1:'{$arg1}'|:with '{$arg1}' specifiers}0

# err_decomp_decl_std_tuple_element_not_specialized
source: cannot decompose this type; 'std::tuple_element<%0>::type' does not name a type
root: cannot decompose this type; 'std::tuple_element<{$arg0}>::type' does not name a type

# err_decomp_decl_std_tuple_size_not_constant
source: cannot decompose this type; 'std::tuple_size<%0>::value' is not a valid integral constant expression
root: cannot decompose this type; 'std::tuple_size<{$arg0}>::value' is not a valid integral constant expression

# err_decomp_decl_type
source: decomposition declaration cannot be declared with type %0; declared type must be 'auto' or reference to 'auto'
root: decomposition declaration cannot be declared with type {$arg0}; declared type must be 'auto' or reference to 'auto'

# err_decomp_decl_unbindable_type
source: cannot decompose %select{union|non-class, non-array}1 type %2
root: cannot decompose {$arg1 :select s0=|union| s1=|non-class, non-array|} type {$arg2}

# err_decomp_decl_wrong_number_bindings
source: type %0 decomposes into %3 %plural{1:element|:elements}2, but %select{%plural{0:no|:only %1}1|%1}4 %plural{1:name was|:names were}1 provided
root: type {$arg0} decomposes into {$arg3} %plural{1:element|:elements}2, but %select{%plural{0:no|:only {$arg1}}1|{$arg1}}4 %plural{1:name was|:names were}1 provided

# err_deduced_class_template_ctor_ambiguous
source: ambiguous deduction for template arguments of %0
root: ambiguous deduction for template arguments of {$arg0}

# err_deduced_class_template_ctor_no_viable
source: no viable constructor or deduction guide for deduction of template arguments of %0
root: no viable constructor or deduction guide for deduction of template arguments of {$arg0}

# err_deduced_class_template_deleted
source: class template argument deduction for %0 selected a deleted constructor
root: class template argument deduction for {$arg0} selected a deleted constructor

# err_deduced_class_template_explicit
source: class template argument deduction for %0 selected an explicit %select{constructor|deduction guide}1 for copy-list-initialization
root: class template argument deduction for {$arg0} selected an explicit {$arg1 :select s0=|constructor| s1=|deduction guide|} for copy-list-initialization

# err_deduced_class_template_incomplete
source: template %0 has no definition and no %select{|viable }1deduction guides for deduction of template arguments
root: template {$arg0} has no definition and no {$arg1 :select s0=|| s1=|viable |}deduction guides for deduction of template arguments

# err_deduced_non_class_or_alias_template_specialization_type
source: %select{<error>|function template|variable template|alias template|template template parameter|concept|template}0 %1 requires template arguments; argument deduction only allowed for class templates or alias templates
root: {$arg0 :select s0=|<error>| s1=|function template| s2=|variable template| s3=|alias template| s4=|template template parameter| s5=|concept| s6=|template|} {$arg1} requires template arguments; argument deduction only allowed for class templates or alias templates

# err_deduced_tst
source: typename specifier refers to %select{class template|function template|variable template|alias template|template template parameter|template}0; argument deduction not allowed here
root: typename specifier refers to {$arg0 :select s0=|class template| s1=|function template| s2=|variable template| s3=|alias template| s4=|template template parameter| s5=|template|}; argument deduction not allowed here

# err_deduction_guide_bad_trailing_return_type
source: deduced type %1 of deduction guide is not %select{|written as }2a specialization of template %0
root: deduced type {$arg1} of deduction guide is not {$arg2 :select s0=|| s1=|written as |}a specialization of template {$arg0}

# err_deduction_guide_invalid_specifier
source: deduction guide cannot be declared '%0'
root: deduction guide cannot be declared '{$arg0}'

# err_deduction_guide_name_not_class_template
source: cannot specify deduction guide for %select{<error>|function template|variable template|alias template|template template parameter|concept|dependent template name}0 %1
root: cannot specify deduction guide for {$arg0 :select s0=|<error>| s1=|function template| s2=|variable template| s3=|alias template| s4=|template template parameter| s5=|concept| s6=|dependent template name|} {$arg1}

# err_deduction_guide_specialized
source: deduction guide cannot be %select{explicitly instantiated|explicitly specialized}0
root: deduction guide cannot be {$arg0 :select s0=|explicitly instantiated| s1=|explicitly specialized|}

# err_deduction_guide_template_not_deducible
source: deduction guide template contains %select{a template parameter|template parameters}0 that cannot be deduced
root: deduction guide template contains {$arg0 :select s0=|a template parameter| s1=|template parameters|} that cannot be deduced

# err_deduction_guide_wrong_scope
source: deduction guide must be declared in the same scope as template %q0
root: deduction guide must be declared in the same scope as template {$arg0 :q}

# err_deep_exception_specs_differ
source: exception specifications of %select{return|argument}0 types differ
root: exception specifications of {$arg0 :select s0=|return| s1=|argument|} types differ

# err_default_arg_makes_ctor_special
source: addition of default argument on redeclaration makes this constructor a %select{default|copy|move}0 constructor
root: addition of default argument on redeclaration makes this constructor a {$arg0 :select s0=|default| s1=|copy| s2=|move|} constructor

# err_default_init_const
source: default initialization of an object of const type %0%select{| without a user-provided default constructor}1
root: default initialization of an object of const type {$arg0}{$arg1 :select s0=|| s1=| without a user-provided default constructor|}

# err_default_member_initializer_cycle
source: default member initializer for %0 uses itself
root: default member initializer for {$arg0} uses itself

# err_default_member_initializer_not_yet_parsed
source: default member initializer for %1 needed within definition of enclosing class %0 outside of member functions
root: default member initializer for {$arg1} needed within definition of enclosing class {$arg0} outside of member functions

# err_defaulted_comparison_cannot_deduce_undeduced_auto
source: return type of defaulted 'operator<=>' cannot be deduced because three-way comparison for %select{|member|base class}0 %1 has a deduced return type and is not yet defined
root: return type of defaulted 'operator<=>' cannot be deduced because three-way comparison for {$arg0 :select s0=|| s1=|member| s2=|base class|} {$arg1} has a deduced return type and is not yet defined

# err_defaulted_comparison_deduced_return_type_not_auto
source: deduced return type for defaulted %select{<ERROR>|equality|three-way|equality|relational}0 comparison operator must be 'auto', not %1
root: deduced return type for defaulted {$arg0 :select s0=|<ERROR>| s1=|equality| s2=|three-way| s3=|equality| s4=|relational|} comparison operator must be 'auto', not {$arg1}

# err_defaulted_comparison_non_const
source: defaulted member %select{<ERROR>|equality|three-way|equality|relational}0 comparison operator must be const-qualified
root: defaulted member {$arg0 :select s0=|<ERROR>| s1=|equality| s2=|three-way| s3=|equality| s4=|relational|} comparison operator must be const-qualified

# err_defaulted_comparison_not_friend
source: %select{<ERROR>|equality|three-way|equality|relational}0 comparison operator is not a friend of %select{|incomplete class }1%2
root: {$arg0 :select s0=|<ERROR>| s1=|equality| s2=|three-way| s3=|equality| s4=|relational|} comparison operator is not a friend of {$arg1 :select s0=|| s1=|incomplete class |}{$arg2}

# err_defaulted_comparison_num_args
source: %select{non-member|member}0 %select{<ERROR>|equality|three-way|equality|relational}1 comparison operator must have %select{2|1}0 parameters
root: {$arg0 :select s0=|non-member| s1=|member|} {$arg1 :select s0=|<ERROR>| s1=|equality| s2=|three-way| s3=|equality| s4=|relational|} comparison operator must have {$arg0 :select s0=|2| s1=|1|} parameters

# err_defaulted_comparison_param
source: invalid parameter type for defaulted %select{<ERROR>|equality|three-way|equality|relational}0 comparison operator; found %1, expected %2%select{| or %4}3
root: invalid parameter type for defaulted {$arg0 :select s0=|<ERROR>| s1=|equality| s2=|three-way| s3=|equality| s4=|relational|} comparison operator; found {$arg1}, expected {$arg2}{$arg3 :select s0=|| s1=| or {$arg4}|}

# err_defaulted_comparison_param_mismatch
source: parameters for defaulted %select{<ERROR>|equality|three-way|equality|relational}0 comparison operator must have the same type%diff{ (found $ vs $)|}1,2
root: parameters for defaulted {$arg0 :select s0=|<ERROR>| s1=|equality| s2=|three-way| s3=|equality| s4=|relational|} comparison operator must have the same type%diff{ (found $ vs $)|}1,2

# err_defaulted_comparison_param_unknown
source: invalid parameter type for non-member defaulted %select{<ERROR>|equality|three-way|equality|relational}0 comparison operator; found %1, expected class or reference to a constant class
root: invalid parameter type for non-member defaulted {$arg0 :select s0=|<ERROR>| s1=|equality| s2=|three-way| s3=|equality| s4=|relational|} comparison operator; found {$arg1}, expected class or reference to a constant class

# err_defaulted_comparison_return_type_not_bool
source: return type for defaulted %select{<ERROR>|equality|three-way|equality|relational}0 comparison operator must be 'bool', not %1
root: return type for defaulted {$arg0 :select s0=|<ERROR>| s1=|equality| s2=|three-way| s3=|equality| s4=|relational|} comparison operator must be 'bool', not {$arg1}

# err_defaulted_special_member_copy_const_param
source: the parameter for this explicitly-defaulted copy %select{constructor|assignment operator}0 is const, but a member or base requires it to be non-const
root: the parameter for this explicitly-defaulted copy {$arg0 :select s0=|constructor| s1=|assignment operator|} is const, but a member or base requires it to be non-const

# err_defaulted_special_member_move_const_param
source: the parameter for an explicitly-defaulted move %select{constructor|assignment operator}0 may not be const
root: the parameter for an explicitly-defaulted move {$arg0 :select s0=|constructor| s1=|assignment operator|} may not be const

# err_defaulted_special_member_params
source: an explicitly-defaulted %select{default constructor|copy constructor|move constructor|copy assignment operator|move assignment operator|destructor}0 cannot have default arguments
root: an explicitly-defaulted {$arg0 :select s0=|default constructor| s1=|copy constructor| s2=|move constructor| s3=|copy assignment operator| s4=|move assignment operator| s5=|destructor|} cannot have default arguments

# err_defaulted_special_member_quals
source: an explicitly-defaulted %select{copy|move}0 assignment operator may not have 'const'%select{, 'constexpr'|}1 or 'volatile' qualifiers
root: an explicitly-defaulted {$arg0 :select s0=|copy| s1=|move|} assignment operator may not have 'const'{$arg1 :select s0=|, 'constexpr'| s1=||} or 'volatile' qualifiers

# err_defaulted_special_member_return_type
source: explicitly-defaulted %select{copy|move}0 assignment operator must return %1
root: explicitly-defaulted {$arg0 :select s0=|copy| s1=|move|} assignment operator must return {$arg1}

# err_defaulted_special_member_variadic
source: an explicitly-defaulted %select{default constructor|copy constructor|move constructor|copy assignment operator|move assignment operator|destructor}0 cannot be variadic
root: an explicitly-defaulted {$arg0 :select s0=|default constructor| s1=|copy constructor| s2=|move constructor| s3=|copy assignment operator| s4=|move assignment operator| s5=|destructor|} cannot be variadic

# err_defaulted_special_member_volatile_param
source: the parameter for an explicitly-defaulted %select{default constructor|copy constructor|move constructor|copy assignment operator|move assignment operator|destructor}0 may not be volatile
root: the parameter for an explicitly-defaulted {$arg0 :select s0=|default constructor| s1=|copy constructor| s2=|move constructor| s3=|copy assignment operator| s4=|move assignment operator| s5=|destructor|} may not be volatile

# err_definition_of_explicitly_defaulted_member
source: definition of explicitly defaulted %select{default constructor|copy constructor|move constructor|copy assignment operator|move assignment operator|destructor|function}0
root: definition of explicitly defaulted {$arg0 :select s0=|default constructor| s1=|copy constructor| s2=|move constructor| s3=|copy assignment operator| s4=|move assignment operator| s5=|destructor| s6=|function|}

# err_definition_of_implicitly_declared_member
source: definition of implicitly declared %select{default constructor|copy constructor|move constructor|copy assignment operator|move assignment operator|destructor|function}1
root: definition of implicitly declared {$arg1 :select s0=|default constructor| s1=|copy constructor| s2=|move constructor| s3=|copy assignment operator| s4=|move assignment operator| s5=|destructor| s6=|function|}

# err_delete_explicit_conversion
source: converting delete expression from type %0 to type %1 invokes an explicit conversion function
root: converting delete expression from type {$arg0} to type {$arg1} invokes an explicit conversion function

# err_delete_incomplete
source: cannot delete pointer to incomplete type %0
root: cannot delete pointer to incomplete type {$arg0}

# err_delete_incomplete_class_type
source: deleting incomplete class type %0; no conversions to pointer type
root: deleting incomplete class type {$arg0}; no conversions to pointer type

# err_delete_operand
source: cannot delete expression of type %0
root: cannot delete expression of type {$arg0}

# err_deleted_function_use
source: attempt to use a deleted function%select{|: %1}0
root: attempt to use a deleted function{$arg0 :select s0=|| s1=|: {$arg1}|}

# err_deleted_inherited_ctor_use
source: constructor inherited by %0 from base class %1 is implicitly deleted
root: constructor inherited by {$arg0} from base class {$arg1} is implicitly deleted

# err_deleted_override
source: deleted function %0 cannot override a non-deleted function
root: deleted function {$arg0} cannot override a non-deleted function

# err_dependent_deduced_tst
source: typename specifier refers to %select{class template|function template|variable template|alias template|template template parameter|template}0 member in %1; argument deduction not allowed here
root: typename specifier refers to {$arg0 :select s0=|class template| s1=|function template| s2=|variable template| s3=|alias template| s4=|template template parameter| s5=|template|} member in {$arg1}; argument deduction not allowed here

# err_dependent_function_template_spec_no_match
source: no candidate function template was found for dependent %select{member|friend}0 function template specialization
root: no candidate function template was found for dependent {$arg0 :select s0=|member| s1=|friend|} function template specialization
