Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# err_auto_non_deduced_not_alone
source: %select{function with deduced return type|declaration with trailing return type}0 must be the only declaration in its group
root: {$arg0 :select s0=|function with deduced return type| s1=|declaration with trailing return type|} must be the only declaration in its group

# err_auto_not_allowed
source: %select{'auto'|'decltype(auto)'|'__auto_type'|use of %select{class template|function template|variable template|alias template|template template parameter|concept|template}2 %3 requires template arguments; argument deduction}0 not allowed %select{in function prototype|in non-static struct member|in struct member|in non-static union member|in union member|in non-static class member|in interface member|in exception declaration|in template parameter until C++17|in block literal|in template argument|in typedef|in type alias|in function return type|in conversion function type|here|in lambda parameter|in type allocated by 'new'|in K&R-style function parameter|in template parameter|in friend declaration|in function prototype that is not a function declaration|in requires expression parameter|in array declaration|in declaration of conversion function template|in lambda parameter before C++14}1
root: %select{'auto'|'decltype(auto)'|'__auto_type'|use of {$arg0 :select s0=|class template| s1=|function template| s2=|variable template| s3=|alias template| s4=|template template parameter| s5=|concept| s6=|template}2 {$arg3} requires template arguments; argument deduction|} not allowed {$arg1 :select s0=|in function prototype| s1=|in non-static struct member| s2=|in struct member| s3=|in non-static union member| s4=|in union member| s5=|in non-static class member| s6=|in interface member| s7=|in exception declaration| s8=|in template parameter until C++17| s9=|in block literal| s10=|in template argument| s11=|in typedef| s12=|in type alias| s13=|in function return type| s14=|in conversion function type| s15=|here| s16=|in lambda parameter| s17=|in type allocated by 'new'| s18=|in K&R-style function parameter| s19=|in template parameter| s20=|in friend declaration| s21=|in function prototype that is not a function declaration| s22=|in requires expression parameter| s23=|in array declaration| s24=|in declaration of conversion function template| s25=|in lambda parameter before C++14|}

# err_auto_var_deduction_failure
source: variable %0 with type %1 has incompatible initializer of type %2
root: variable {$arg0} with type {$arg1} has incompatible initializer of type {$arg2}

# err_auto_var_deduction_failure_from_init_list
source: cannot deduce actual type for variable %0 with type %1 from initializer list
root: cannot deduce actual type for variable {$arg0} with type {$arg1} from initializer list

# err_auto_var_init_multiple_expressions
source: initializer for variable %0 with type %1 contains multiple expressions
root: initializer for variable {$arg0} with type {$arg1} contains multiple expressions

# err_auto_var_init_no_expression
source: initializer for variable %0 with type %1 is empty
root: initializer for variable {$arg0} with type {$arg1} is empty

# err_auto_var_init_paren_braces
source: cannot deduce type for variable %1 with type %2 from %select{parenthesized|nested}0 initializer list
root: cannot deduce type for variable {$arg1} with type {$arg2} from {$arg0 :select s0=|parenthesized| s1=|nested|} initializer list

# err_auto_var_requires_init
source: declaration of variable %0 with deduced type %1 requires an initializer
root: declaration of variable {$arg0} with deduced type {$arg1} requires an initializer

# err_availability_unexpected_parameter
source: unexpected parameter '%0' in availability attribute, not permitted in %select{HLSL|C/C++}1
root: unexpected parameter '{$arg0}' in availability attribute, not permitted in {$arg1 :select s0=|HLSL| s1=|C/C++|}

# err_await_suspend_invalid_return_type
source: return type of 'await_suspend' is required to be 'void' or 'bool' (have %0)
root: return type of 'await_suspend' is required to be 'void' or 'bool' (have {$arg0})

# err_bad_cast_incomplete
source: %0 is an incomplete type
root: {$arg0} is an incomplete type

# err_bad_category_property_decl
source: property implementation must have its declaration in the category %0
root: property implementation must have its declaration in the category {$arg0}

# err_bad_const_cast_dest
source: %select{const_cast||||C-style cast|functional-style cast|}0 to %2, which is not a reference, pointer-to-object, or pointer-to-data-member
root: {$arg0 :select s0=|const_cast| s1=|| s2=|| s3=|| s4=|C-style cast| s5=|functional-style cast| s6=||} to {$arg2}, which is not a reference, pointer-to-object, or pointer-to-data-member

# err_bad_cstyle_cast_overload
source: address of overloaded function %0 cannot be cast to type %1
root: address of overloaded function {$arg0} cannot be cast to type {$arg1}

# err_bad_cxx_cast_addr_space_mismatch
source: %select{const_cast|static_cast|reinterpret_cast|dynamic_cast|C-style cast|functional-style cast|addrspace_cast}0 from %1 to %2 converts between mismatching address spaces
root: {$arg0 :select s0=|const_cast| s1=|static_cast| s2=|reinterpret_cast| s3=|dynamic_cast| s4=|C-style cast| s5=|functional-style cast| s6=|addrspace_cast|} from {$arg1} to {$arg2} converts between mismatching address spaces

# err_bad_cxx_cast_bitfield
source: %select{const_cast|static_cast|reinterpret_cast|dynamic_cast|C-style cast|functional-style cast|}0 from bit-field lvalue to reference type %2
root: {$arg0 :select s0=|const_cast| s1=|static_cast| s2=|reinterpret_cast| s3=|dynamic_cast| s4=|C-style cast| s5=|functional-style cast| s6=||} from bit-field lvalue to reference type {$arg2}

# err_bad_cxx_cast_generic
source: %select{const_cast|static_cast|reinterpret_cast|dynamic_cast|C-style cast|functional-style cast|addrspace_cast}0 from %1 to %2 is not allowed
root: {$arg0 :select s0=|const_cast| s1=|static_cast| s2=|reinterpret_cast| s3=|dynamic_cast| s4=|C-style cast| s5=|functional-style cast| s6=|addrspace_cast|} from {$arg1} to {$arg2} is not allowed

# err_bad_cxx_cast_member_pointer_size
source: cannot %select{||reinterpret_cast||C-style cast||}0 from member pointer type %1 to member pointer type %2 of different size
root: cannot {$arg0 :select s0=|| s1=|| s2=|reinterpret_cast| s3=|| s4=|C-style cast| s5=|| s6=||} from member pointer type {$arg1} to member pointer type {$arg2} of different size

# err_bad_cxx_cast_qualifiers_away
source: %select{const_cast|static_cast|reinterpret_cast|dynamic_cast|C-style cast|functional-style cast|}0 from %1 to %2 casts away qualifiers
root: {$arg0 :select s0=|const_cast| s1=|static_cast| s2=|reinterpret_cast| s3=|dynamic_cast| s4=|C-style cast| s5=|functional-style cast| s6=||} from {$arg1} to {$arg2} casts away qualifiers

# err_bad_cxx_cast_rvalue
source: %select{const_cast|static_cast|reinterpret_cast|dynamic_cast|C-style cast|functional-style cast|addrspace_cast}0 from rvalue to reference type %2
root: {$arg0 :select s0=|const_cast| s1=|static_cast| s2=|reinterpret_cast| s3=|dynamic_cast| s4=|C-style cast| s5=|functional-style cast| s6=|addrspace_cast|} from rvalue to reference type {$arg2}

# err_bad_cxx_cast_scalar_to_vector_different_size
source: %select{||reinterpret_cast||C-style cast||}0 from scalar %1 to vector %2 of different size
root: {$arg0 :select s0=|| s1=|| s2=|reinterpret_cast| s3=|| s4=|C-style cast| s5=|| s6=||} from scalar {$arg1} to vector {$arg2} of different size

# err_bad_cxx_cast_unrelated_class
source: %select{const_cast|static_cast|reinterpret_cast|dynamic_cast|C-style cast|functional-style cast|}0 from %1 to %2, which are not related by inheritance, is not allowed
root: {$arg0 :select s0=|const_cast| s1=|static_cast| s2=|reinterpret_cast| s3=|dynamic_cast| s4=|C-style cast| s5=|functional-style cast| s6=||} from {$arg1} to {$arg2}, which are not related by inheritance, is not allowed

# err_bad_cxx_cast_vector_to_scalar_different_size
source: %select{||reinterpret_cast||C-style cast||}0 from vector %1 to scalar %2 of different size
root: {$arg0 :select s0=|| s1=|| s2=|reinterpret_cast| s3=|| s4=|C-style cast| s5=|| s6=||} from vector {$arg1} to scalar {$arg2} of different size

# err_bad_cxx_cast_vector_to_vector_different_size
source: %select{||reinterpret_cast||C-style cast||}0 from vector %1 to vector %2 of different size
root: {$arg0 :select s0=|| s1=|| s2=|reinterpret_cast| s3=|| s4=|C-style cast| s5=|| s6=||} from vector {$arg1} to vector {$arg2} of different size

# err_bad_dynamic_cast_not_class
source: %0 is not a class type
root: {$arg0} is not a class type

# err_bad_dynamic_cast_not_polymorphic
source: %0 is not polymorphic
root: {$arg0} is not polymorphic

# err_bad_dynamic_cast_not_ptr
source: cannot use dynamic_cast to convert from %0 to %1
root: cannot use dynamic_cast to convert from {$arg0} to {$arg1}

# err_bad_dynamic_cast_not_ref_or_ptr
source: invalid target type %0 for dynamic_cast; target type must be a reference or pointer type to a defined class
root: invalid target type {$arg0} for dynamic_cast; target type must be a reference or pointer type to a defined class

# err_bad_kernel_param_type
source: %0 cannot be used as the type of a kernel parameter
root: {$arg0} cannot be used as the type of a kernel parameter

# err_bad_lvalue_to_rvalue_cast
source: cannot cast from lvalue of type %1 to rvalue reference type %2; types are not compatible
root: cannot cast from lvalue of type {$arg1} to rvalue reference type {$arg2}; types are not compatible

# err_bad_memptr_lhs
source: left hand operand to %0 must be a %select{|pointer to }1class compatible with the right hand operand, but is %2
root: left hand operand to {$arg0} must be a {$arg1 :select s0=|| s1=|pointer to |}class compatible with the right hand operand, but is {$arg2}

# err_bad_memptr_rhs
source: right hand operand to %0 has non-pointer-to-member type %1
root: right hand operand to {$arg0} has non-pointer-to-member type {$arg1}

# err_bad_multiversion_option
source: function multiversioning doesn't support %select{feature|architecture}0 '%1'
root: function multiversioning doesn't support {$arg0 :select s0=|feature| s1=|architecture|} '{$arg1}'

# err_bad_new_type
source: cannot allocate %select{function|reference}1 type %0 with new
root: cannot allocate {$arg1 :select s0=|function| s1=|reference|} type {$arg0} with new

# err_bad_parameter_name
source: %0 cannot be the name of a parameter
root: {$arg0} cannot be the name of a parameter

# err_bad_property_decl
source: property implementation must have its declaration in interface %0 or one of its extensions
root: property implementation must have its declaration in interface {$arg0} or one of its extensions

# err_bad_receiver_type
source: bad receiver type %0
root: bad receiver type {$arg0}

# err_bad_reinterpret_cast_overload
source: reinterpret_cast cannot resolve overloaded function %0 to type %1
root: reinterpret_cast cannot resolve overloaded function {$arg0} to type {$arg1}

# err_bad_reinterpret_cast_reference
source: reinterpret_cast of a %0 to %1 needs its address, which is not allowed
root: reinterpret_cast of a {$arg0} to {$arg1} needs its address, which is not allowed

# err_bad_reinterpret_cast_small_int
source: cast from pointer to smaller type %2 loses information
root: cast from pointer to smaller type {$arg2} loses information

# err_bad_rvalue_to_rvalue_cast
source: cannot cast from rvalue of type %1 to rvalue reference type %2; types are not compatible
root: cannot cast from rvalue of type {$arg1} to rvalue reference type {$arg2}; types are not compatible

# err_bad_static_cast_member_pointer_nonmp
source: cannot cast from type %1 to member pointer type %2
root: cannot cast from type {$arg1} to member pointer type {$arg2}

# err_bad_static_cast_overload
source: address of overloaded function %0 cannot be static_cast to type %1
root: address of overloaded function {$arg0} cannot be static_cast to type {$arg1}

# err_bad_static_cast_pointer_nonpointer
source: cannot cast from type %1 to pointer type %2
root: cannot cast from type {$arg1} to pointer type {$arg2}

# err_bad_variable_name
source: %0 cannot be the name of a variable or data member
root: {$arg0} cannot be the name of a variable or data member

# err_base_class_has_flexible_array_member
source: base class %0 has a flexible array member
root: base class {$arg0} has a flexible array member

# err_base_init_direct_and_virtual
source: base class initializer %0 names both a direct base class and an inherited virtual base class
root: base class initializer {$arg0} names both a direct base class and an inherited virtual base class

# err_base_init_does_not_name_class
source: constructor initializer %0 does not name a class
root: constructor initializer {$arg0} does not name a class

# err_base_specifier_attribute
source: %0%select{ attribute|}1 cannot be applied to a base specifier
root: {$arg0}{$arg1 :select s0=| attribute| s1=||} cannot be applied to a base specifier

# err_binding_cannot_appear_in_own_initializer
source: binding %0 cannot appear in the initializer of its own decomposition declaration
root: binding {$arg0} cannot appear in the initializer of its own decomposition declaration

# err_bit_int_bad_size
source: %select{signed|unsigned}0 _BitInt must have a bit size of at least %select{2|1}0
root: {$arg0 :select s0=|signed| s1=|unsigned|} _BitInt must have a bit size of at least {$arg0 :select s0=|2| s1=|1|}

# err_bit_int_max_size
source: %select{signed|unsigned}0 _BitInt of bit sizes greater than %1 not supported
root: {$arg0 :select s0=|signed| s1=|unsigned|} _BitInt of bit sizes greater than {$arg1} not supported

# err_bitfield_has_negative_width
source: bit-field %0 has negative width (%1)
root: bit-field {$arg0} has negative width ({$arg1})

# err_bitfield_has_zero_width
source: named bit-field %0 has zero width
root: named bit-field {$arg0} has zero width

# err_bitfield_too_wide
source: %select{bit-field %1|anonymous bit-field}0 is too wide (%2 bits)
root: {$arg0 :select s0=|bit-field {$arg1}| s1=|anonymous bit-field|} is too wide ({$arg2} bits)

# err_bitfield_width_exceeds_type_width
source: width of%select{ anonymous|}0 bit-field%select{| %1}0 (%2 bits) exceeds the %select{width|size}3 of its type (%4 bit%s4)
root: width of{$arg0 :select s0=| anonymous| s1=||} bit-field{$arg0 :select s0=|| s1=| {$arg1}|} ({$arg2} bits) exceeds the {$arg3 :select s0=|width| s1=|size|} of its type ({$arg4} bit%s4)

# err_block_returning_array_function
source: block cannot return %select{array|function}0 type %1
root: block cannot return {$arg0 :select s0=|array| s1=|function|} type {$arg1}

# err_blocks_disable
source: blocks support disabled - compile with -fblocks or %select{pick a deployment target that supports them|for OpenCL C 2.0 or OpenCL C 3.0 with __opencl_c_device_enqueue feature}0
root: blocks support disabled - compile with -fblocks or {$arg0 :select s0=|pick a deployment target that supports them| s1=|for OpenCL C 2.0 or OpenCL C 3.0 with __opencl_c_device_enqueue feature|}

# err_bound_member_function
source: reference to non-static member function must be called%select{|; did you mean to call it with no arguments?}0
root: reference to non-static member function must be called{$arg0 :select s0=|| s1=|; did you mean to call it with no arguments?|}

# err_box_literal_collection
source: %select{string|character|boolean|numeric}0 literal must be prefixed by '@' in a collection
root: {$arg0 :select s0=|string| s1=|character| s2=|boolean| s3=|numeric|} literal must be prefixed by '@' in a collection

# err_btf_type_id_not_const
source: __builtin_btf_type_id argument %0 not a constant
root: __builtin_btf_type_id argument {$arg0} not a constant

# err_builtin_counted_by_ref_cannot_leak_reference
source: value returned by '__builtin_counted_by_ref' cannot be %select{assigned to a variable|passed into a function|returned from a function}0
root: value returned by '__builtin_counted_by_ref' cannot be {$arg0 :select s0=|assigned to a variable| s1=|passed into a function| s2=|returned from a function|}

# err_builtin_counted_by_ref_invalid_use
source: value returned by '__builtin_counted_by_ref' cannot be used in %select{an array subscript|a binary}0 expression
root: value returned by '__builtin_counted_by_ref' cannot be used in {$arg0 :select s0=|an array subscript| s1=|a binary|} expression

# err_builtin_definition
source: definition of builtin function %0
root: definition of builtin function {$arg0}

# err_builtin_is_within_lifetime_invalid_arg
source: %select{non-|function }0pointer argument to '__builtin_is_within_lifetime' is not allowed
root: {$arg0 :select s0=|non-| s1=|function |}pointer argument to '__builtin_is_within_lifetime' is not allowed

# err_builtin_launder_invalid_arg
source: %select{non-pointer|function pointer|void pointer}0 argument to '__builtin_launder' is not allowed
root: {$arg0 :select s0=|non-pointer| s1=|function pointer| s2=|void pointer|} argument to '__builtin_launder' is not allowed

# err_builtin_matrix_invalid_dimension
source: %0 dimension is outside the allowed range [1, %1]
root: {$arg0} dimension is outside the allowed range [1, {$arg1}]

# err_builtin_matrix_pointer_arg_mismatch
source: the pointee of the 2nd argument must match the element type of the 1st argument (%0 != %1)
root: the pointee of the 2nd argument must match the element type of the 1st argument ({$arg0} != {$arg1})

# err_builtin_matrix_scalar_unsigned_arg
source: %0 argument must be a constant unsigned integer expression
root: {$arg0} argument must be a constant unsigned integer expression

# err_builtin_move_forward_unsupported
source: unsupported signature for %q0
root: unsupported signature for {$arg0 :q}

# err_builtin_non_vector_type
source: %0 argument to %1 must be of vector type
root: {$arg0} argument to {$arg1} must be of vector type

# err_builtin_operator_new_delete_not_usual
source: call to '%select{__builtin_operator_new|__builtin_operator_delete}0' selects non-usual %select{allocation|deallocation}0 function
root: call to '{$arg0 :select s0=|__builtin_operator_new| s1=|__builtin_operator_delete|}' selects non-usual {$arg0 :select s0=|allocation| s1=|deallocation|} function

# err_builtin_pass_in_regs_non_class
source: argument %0 is not an unqualified class type
root: argument {$arg0} is not an unqualified class type

# err_builtin_redeclare
source: cannot redeclare builtin function %0
root: cannot redeclare builtin function {$arg0}

# err_builtin_requires_language
source: '%0' is only available in %1
root: '{$arg0}' is only available in {$arg1}

# err_builtin_trivially_relocate_invalid_arg_type
source: first%select{||| and second}0 argument%select{|||s}0 to '__builtin_trivially_relocate' must be %select{a pointer|non-const|relocatable|of the same type}0
root: first{$arg0 :select s0=|| s1=|| s2=|| s3=| and second|} argument{$arg0 :select s0=|| s1=|| s2=|| s3=|s|} to '__builtin_trivially_relocate' must be {$arg0 :select s0=|a pointer| s1=|non-const| s2=|relocatable| s3=|of the same type|}

# err_builtin_verbose_trap_arg
source: argument to __builtin_verbose_trap must %select{be a pointer to a constant string|not contain $}0
root: argument to __builtin_verbose_trap must {$arg0 :select s0=|be a pointer to a constant string| s1=|not contain $|}

# err_c23_constexpr_init_not_representable
source: constexpr initializer evaluates to %0 which is not exactly representable in type %1
root: constexpr initializer evaluates to {$arg0} which is not exactly representable in type {$arg1}

# err_c23_constexpr_init_type_mismatch
source: constexpr initializer for type %0 is of type %1
root: constexpr initializer for type {$arg0} is of type {$arg1}

# err_c23_constexpr_invalid_type
source: constexpr variable cannot have type %0
root: constexpr variable cannot have type {$arg0}

# err_c99_array_usage_cxx
source: %select{qualifier in |static |}0array size %select{||'[*] '}0is a C99 feature, not permitted in C++
root: {$arg0 :select s0=|qualifier in | s1=|static | s2=||}array size {$arg0 :select s0=|| s1=|| s2=|'[*] '|}is a C99 feature, not permitted in C++

# err_call_function_incomplete_return
source: calling %0 with incomplete return type %1
root: calling {$arg0} with incomplete return type {$arg1}

# err_call_incomplete_argument
source: argument type %0 is incomplete
root: argument type {$arg0} is incomplete

# err_call_incomplete_return
source: calling function with incomplete return type %0
root: calling function with incomplete return type {$arg0}

# err_callback_attribute_argument_unknown
source: 'callback' attribute argument %0 is not a known function parameter
root: 'callback' attribute argument {$arg0} is not a known function parameter

# err_callback_attribute_wrong_arg_count
source: 'callback' attribute references function of type %0 which expects %1 %plural{1:argument|:arguments}1 but attribute specifies %2 parameter index %plural{1:argument|:arguments}2
root: 'callback' attribute references function of type {$arg0} which expects {$arg1} %plural{1:argument|:arguments}1 but attribute specifies {$arg2} parameter index %plural{1:argument|:arguments}2

# err_callback_implicit_this_not_available
source: 'callback' argument at position %0 references unavailable implicit 'this'
root: 'callback' argument at position {$arg0} references unavailable implicit 'this'

# err_cannot_find_suitable_accessor
source: cannot find suitable %select{getter|setter}0 for property %1
root: cannot find suitable {$arg0 :select s0=|getter| s1=|setter|} for property {$arg1}

# err_cannot_form_pointer_to_member_of_reference_type
source: cannot form a pointer-to-member to member %0 of reference type %1
root: cannot form a pointer-to-member to member {$arg0} of reference type {$arg1}

# err_cannot_pass_non_trivial_c_struct_to_vararg
source: cannot pass non-trivial C object of type %0 by value to variadic %select{function|block|method|constructor}1
root: cannot pass non-trivial C object of type {$arg0} by value to variadic {$arg1 :select s0=|function| s1=|block| s2=|method| s3=|constructor|}

# err_cannot_pass_objc_interface_to_vararg
source: cannot pass object with interface type %0 by value through variadic %select{function|block|method|constructor}1
root: cannot pass object with interface type {$arg0} by value through variadic {$arg1 :select s0=|function| s1=|block| s2=|method| s3=|constructor|}

# err_cannot_pass_objc_interface_to_vararg_format
source: cannot pass object with interface type %1 by value to variadic %select{function|block|method|constructor}2; expected type from format string was %3
root: cannot pass object with interface type {$arg1} by value to variadic {$arg2 :select s0=|function| s1=|block| s2=|method| s3=|constructor|}; expected type from format string was {$arg3}

# err_cannot_pass_to_vararg
source: cannot pass %select{expression of type %1|initializer list}0 to variadic %select{function|block|method|constructor}2
root: cannot pass {$arg0 :select s0=|expression of type {$arg1}| s1=|initializer list|} to variadic {$arg2 :select s0=|function| s1=|block| s2=|method| s3=|constructor|}

# err_cannot_pass_to_vararg_format
source: cannot pass %select{expression of type %1|initializer list}0 to variadic %select{function|block|method|constructor}2; expected type from format string was %3
root: cannot pass {$arg0 :select s0=|expression of type {$arg1}| s1=|initializer list|} to variadic {$arg2 :select s0=|function| s1=|block| s2=|method| s3=|constructor|}; expected type from format string was {$arg3}

# err_capture_bad_target
source: capture host variable %0 by reference in device or host device lambda function
root: capture host variable {$arg0} by reference in device or host device lambda function
