Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# err_hlsl_attr_unsupported_in_stage
source: attribute %0 is unsupported in '%1' shaders, requires %select{|one of the following: }2%3
root: attribute {$arg0} is unsupported in '{$arg1}' shaders, requires {$arg2 :select s0=|| s1=|one of the following: |}{$arg3}

# err_hlsl_attribute_in_wrong_shader_model
source: attribute %0 requires shader model %1 or greater
root: attribute {$arg0} requires shader model {$arg1} or greater

# err_hlsl_attribute_needs_intangible_type
source: attribute %0 can be used only on HLSL intangible type %1
root: attribute {$arg0} can be used only on HLSL intangible type {$arg1}

# err_hlsl_attribute_number_arguments_insufficient_shader_model
source: attribute %0 with %1 arguments requires shader model %2 or greater
root: attribute {$arg0} with {$arg1} arguments requires shader model {$arg2} or greater

# err_hlsl_attribute_param_mismatch
source: %0 attribute parameters do not match the previous declaration
root: {$arg0} attribute parameters do not match the previous declaration

# err_hlsl_binding_type_invalid
source: binding type '%0' is invalid
root: binding type '{$arg0}' is invalid

# err_hlsl_binding_type_mismatch
source: binding type '%select{t|u|b|s|c}0' only applies to %select{SRV resources|UAV resources|constant buffer resources|sampler state|numeric variables in the global scope}0
root: binding type '{$arg0 :select s0=|t| s1=|u| s2=|b| s3=|s| s4=|c|}' only applies to {$arg0 :select s0=|SRV resources| s1=|UAV resources| s2=|constant buffer resources| s3=|sampler state| s4=|numeric variables in the global scope|}

# err_hlsl_builtin_scalar_vector_mismatch
source: %select{all|second and third}0 arguments to %1 must be of scalar or vector type with matching scalar element type%diff{: $ vs $|}2,3
root: {$arg0 :select s0=|all| s1=|second and third|} arguments to {$arg1} must be of scalar or vector type with matching scalar element type%diff{: $ vs $|}2,3

# err_hlsl_duplicate_parameter_modifier
source: duplicate parameter modifier %0
root: duplicate parameter modifier {$arg0}

# err_hlsl_duplicate_register_annotation
source: binding type '%select{t|u|b|s|c|i}0' cannot be applied more than once
root: binding type '{$arg0 :select s0=|t| s1=|u| s2=|b| s3=|s| s4=|c| s5=|i|}' cannot be applied more than once

# err_hlsl_entry_shader_attr_mismatch
source: %0 attribute on entry function does not match the target profile
root: {$arg0} attribute on entry function does not match the target profile

# err_hlsl_expect_arg_const_int_one_or_neg_one
source: argument %0 must be constant integer 1 or -1
root: argument {$arg0} must be constant integer 1 or -1

# err_hlsl_expected_space
source: invalid space specifier '%0' used; expected 'space' followed by an integer, like space1
root: invalid space specifier '{$arg0}' used; expected 'space' followed by an integer, like space1

# err_hlsl_incorrect_num_initializers
source: too %select{few|many}0 initializers in list for type %1 (expected %2 but found %3)
root: too {$arg0 :select s0=|few| s1=|many|} initializers in list for type {$arg1} (expected {$arg2} but found {$arg3})

# err_hlsl_missing_numthreads
source: missing numthreads attribute for %0 shader entry
root: missing numthreads attribute for {$arg0} shader entry

# err_hlsl_numthreads_argument_oor
source: argument '%select{X|Y|Z}0' to numthreads attribute cannot exceed %1
root: argument '{$arg0 :select s0=|X| s1=|Y| s2=|Z|}' to numthreads attribute cannot exceed {$arg1}

# err_hlsl_numthreads_invalid
source: total number of threads cannot exceed %0
root: total number of threads cannot exceed {$arg0}

# err_hlsl_operator_unsupported
source: the '%select{&|*|->}0' operator is unsupported in HLSL
root: the '{$arg0 :select s0=|&| s1=|*| s2=|->|}' operator is unsupported in HLSL

# err_hlsl_packoffset_alignment_mismatch
source: packoffset at 'y' not match alignment %0 required by %1
root: packoffset at 'y' not match alignment {$arg0} required by {$arg1}

# err_hlsl_packoffset_overlap
source: packoffset overlap between %0, %1
root: packoffset overlap between {$arg0}, {$arg1}

# err_hlsl_param_qualifier_mismatch
source: conflicting parameter qualifier %0 on parameter %1
root: conflicting parameter qualifier {$arg0} on parameter {$arg1}

# err_hlsl_pointers_unsupported
source: %select{pointers|references}0 are unsupported in HLSL
root: {$arg0 :select s0=|pointers| s1=|references|} are unsupported in HLSL

# err_hlsl_vector_compound_assignment_truncation
source: left hand operand of type %0 to compound assignment cannot be truncated when used with right hand operand of type %1
root: left hand operand of type {$arg0} to compound assignment cannot be truncated when used with right hand operand of type {$arg1}

# err_iboutletcollection_type
source: invalid type %0 as argument of iboutletcollection attribute
root: invalid type {$arg0} as argument of iboutletcollection attribute

# err_ice_ambiguous_conversion
source: ambiguous conversion from type %0 to an integral or unscoped enumeration type
root: ambiguous conversion from type {$arg0} to an integral or unscoped enumeration type

# err_ice_explicit_conversion
source: integral constant expression requires explicit conversion from %0 to %1
root: integral constant expression requires explicit conversion from {$arg0} to {$arg1}

# err_ice_incomplete_type
source: integral constant expression has incomplete class type %0
root: integral constant expression has incomplete class type {$arg0}

# err_ice_not_integral
source: %select{integer|integral}1 constant expression must have %select{integer|integral or unscoped enumeration}1 type, not %0
root: {$arg1 :select s0=|integer| s1=|integral|} constant expression must have {$arg1 :select s0=|integer| s1=|integral or unscoped enumeration|} type, not {$arg0}

# err_ice_too_large
source: integer constant expression evaluates to value %0 that cannot be represented in a %1-bit %select{signed|unsigned}2 integer type
root: integer constant expression evaluates to value {$arg0} that cannot be represented in a {$arg1}-bit {$arg2 :select s0=|signed| s1=|unsigned|} integer type

# err_illegal_decl_array_of_functions
source: '%0' declared as array of functions of type %1
root: '{$arg0}' declared as array of functions of type {$arg1}

# err_illegal_decl_array_of_references
source: '%0' declared as array of references of type %1
root: '{$arg0}' declared as array of references of type {$arg1}

# err_illegal_decl_mempointer_to_reference
source: '%0' declared as a member pointer to a reference of type %1
root: '{$arg0}' declared as a member pointer to a reference of type {$arg1}

# err_illegal_decl_mempointer_to_void
source: '%0' declared as a member pointer to void
root: '{$arg0}' declared as a member pointer to void

# err_illegal_decl_pointer_to_reference
source: '%0' declared as a pointer to a reference of type %1
root: '{$arg0}' declared as a pointer to a reference of type {$arg1}

# err_illegal_initializer_type
source: illegal initializer type %0
root: illegal initializer type {$arg0}

# err_illegal_message_expr_incomplete_type
source: Objective-C message has incomplete result type %0
root: Objective-C message has incomplete result type {$arg0}

# err_illegal_union_or_anon_struct_member
source: %select{anonymous struct|union}0 member %1 has a non-trivial %select{default constructor|copy constructor|move constructor|copy assignment operator|move assignment operator|destructor}2
root: {$arg0 :select s0=|anonymous struct| s1=|union|} member {$arg1} has a non-trivial {$arg2 :select s0=|default constructor| s1=|copy constructor| s2=|move constructor| s3=|copy assignment operator| s4=|move assignment operator| s5=|destructor|}

# err_immediate_function_used_before_definition
source: immediate function %0 used before it is defined
root: immediate function {$arg0} used before it is defined

# err_impcast_complex_scalar
source: implicit conversion from %0 to %1 is not permitted in C++
root: implicit conversion from {$arg0} to {$arg1} is not permitted in C++

# err_implicit_instantiate_member_undefined
source: implicit instantiation of undefined member %0
root: implicit instantiation of undefined member {$arg0}

# err_implied_comparison_category_type_not_found
source: cannot %select{use builtin operator '<=>'|default 'operator<=>'}1 because type '%0' was not found; include <compare>
root: cannot {$arg1 :select s0=|use builtin operator '<=>'| s1=|default 'operator<=>'|} because type '{$arg0}' was not found; include <compare>

# err_implied_coroutine_type_not_found
source: %0 type was not found; include <coroutine> before defining a coroutine
root: {$arg0} type was not found; include <coroutine> before defining a coroutine

# err_implied_std_coroutine_traits_promise_type_not_class
source: this function cannot be a coroutine: %0 is not a class
root: this function cannot be a coroutine: {$arg0} is not a class

# err_implied_std_coroutine_traits_promise_type_not_found
source: this function cannot be a coroutine: %q0 has no member named 'promise_type'
root: this function cannot be a coroutine: {$arg0 :q} has no member named 'promise_type'

# err_in_class_initializer_bad_type
source: static data member of type %0 must be initialized out of line
root: static data member of type {$arg0} must be initialized out of line

# err_in_class_initializer_literal_type
source: in-class initializer for static data member of type %0 requires 'constexpr' specifier
root: in-class initializer for static data member of type {$arg0} requires 'constexpr' specifier

# err_incompatible_replacement_type
source: API notes replacement type %0 has a different size from original type %1
root: API notes replacement type {$arg0} has a different size from original type {$arg1}

# err_incomplete_enum
source: enumeration %0 is incomplete
root: enumeration {$arg0} is incomplete

# err_incomplete_in_exception_spec
source: %select{|pointer to |reference to }0incomplete type %1 is not allowed in exception specification
root: {$arg0 :select s0=|| s1=|pointer to | s2=|reference to |}incomplete type {$arg1} is not allowed in exception specification

# err_incomplete_member_access
source: member access into incomplete type %0
root: member access into incomplete type {$arg0}

# err_incomplete_nested_name_spec
source: incomplete type %0 named in nested name specifier
root: incomplete type {$arg0} named in nested name specifier

# err_incomplete_object_call
source: incomplete type in call to object of type %0
root: incomplete type in call to object of type {$arg0}

# err_incomplete_receiver_type
source: incomplete receiver type %0
root: incomplete receiver type {$arg0}

# err_incomplete_synthesized_property
source: cannot synthesize property %0 with incomplete type %1
root: cannot synthesize property {$arg0} with incomplete type {$arg1}

# err_incomplete_type
source: incomplete type %0 where a complete type is required
root: incomplete type {$arg0} where a complete type is required

# err_incomplete_type_objc_at_encode
source: '@encode' of incomplete type %0
root: '@encode' of incomplete type {$arg0}

# err_incomplete_type_used_in_type_trait_expr
source: incomplete type %0 used in type trait expression
root: incomplete type {$arg0} used in type trait expression

# err_incomplete_type_vtable_pointer_auth
source: cannot set vtable pointer authentication on an incomplete type %0
root: cannot set vtable pointer authentication on an incomplete type {$arg0}

# err_incomplete_typeid
source: 'typeid' of incomplete type %0
root: 'typeid' of incomplete type {$arg0}

# err_incorrect_defaulted_constexpr
source: defaulted definition of %select{default constructor|copy constructor|move constructor|copy assignment operator|move assignment operator|destructor}0 cannot be marked %select{constexpr|consteval}1 before C++23
root: defaulted definition of {$arg0 :select s0=|default constructor| s1=|copy constructor| s2=|move constructor| s3=|copy assignment operator| s4=|move assignment operator| s5=|destructor|} cannot be marked {$arg1 :select s0=|constexpr| s1=|consteval|} before C++23

# err_incorrect_defaulted_constexpr_with_vb
source: %select{default constructor|copy constructor|move constructor|copy assignment operator|move assignment operator|destructor}0 cannot be 'constexpr' in a class with virtual base class
root: {$arg0 :select s0=|default constructor| s1=|copy constructor| s2=|move constructor| s3=|copy assignment operator| s4=|move assignment operator| s5=|destructor|} cannot be 'constexpr' in a class with virtual base class

# err_increment_decrement_enum
source: cannot %select{decrement|increment}0 expression of enum type %1
root: cannot {$arg0 :select s0=|decrement| s1=|increment|} expression of enum type {$arg1}

# err_indirect_goto_in_protected_scope
source: cannot jump from this %select{indirect|asm}0 goto statement to one of its possible targets
root: cannot jump from this {$arg0 :select s0=|indirect| s1=|asm|} goto statement to one of its possible targets

# err_init_capture_deduction_failure
source: cannot deduce type for lambda capture %0 from initializer of type %2
root: cannot deduce type for lambda capture {$arg0} from initializer of type {$arg2}

# err_init_capture_deduction_failure_from_init_list
source: cannot deduce type for lambda capture %0 from initializer list
root: cannot deduce type for lambda capture {$arg0} from initializer list

# err_init_capture_multiple_expressions
source: initializer for lambda capture %0 contains multiple expressions
root: initializer for lambda capture {$arg0} contains multiple expressions

# err_init_capture_no_expression
source: initializer missing for lambda capture %0
root: initializer missing for lambda capture {$arg0}

# err_init_capture_paren_braces
source: cannot deduce type for lambda capture %1 from %select{parenthesized|nested}0 initializer list
root: cannot deduce type for lambda capture {$arg1} from {$arg0 :select s0=|parenthesized| s1=|nested|} initializer list

# err_init_conversion_failed
source: cannot initialize %select{a variable|a parameter|template parameter|return object|statement expression result|an exception object|a member subobject|an array element|a new value|a value|a base class|a constructor delegation|a vector element|a block element|a block element|a complex element|a lambda capture|a compound literal initializer|a related result|a parameter of CF audited function|a structured binding|a member subobject}0 %diff{of type $ with an %select{rvalue|lvalue}2 of type $|with an %select{rvalue|lvalue}2 of incompatible type}1,3%select{|: different classes%diff{ ($ vs $)|}5,6|: different number of parameters (%5 vs %6)|: type mismatch at %ordinal5 parameter%diff{ ($ vs $)|}6,7|: different return type%diff{ ($ vs $)|}5,6|: different qualifiers (%5 vs %6)|: different exception specifications}4
root: cannot initialize {$arg0 :select s0=|a variable| s1=|a parameter| s2=|template parameter| s3=|return object| s4=|statement expression result| s5=|an exception object| s6=|a member subobject| s7=|an array element| s8=|a new value| s9=|a value| s10=|a base class| s11=|a constructor delegation| s12=|a vector element| s13=|a block element| s14=|a block element| s15=|a complex element| s16=|a lambda capture| s17=|a compound literal initializer| s18=|a related result| s19=|a parameter of CF audited function| s20=|a structured binding| s21=|a member subobject|} %diff{of type $ with an {$arg2 :select s0=|rvalue| s1=|lvalue|} of type $|with an {$arg1 :select s0=|rvalue| s1=|lvalue}2 of incompatible type|},3%select{|: different classes%diff{ ($ vs $)|}5,6|: different number of parameters ({$arg5} vs {$arg6})|: type mismatch at %ordinal5 parameter%diff{ ($ vs $)|}6,7|: different return type%diff{ ($ vs $)|}5,6|: different qualifiers ({$arg5} vs {$arg6})|: different exception specifications}4

# err_init_for_function_type
source: cannot create object of function type %0
root: cannot create object of function type {$arg0}

# err_init_incomplete_type
source: initialization of incomplete type %0
root: initialization of incomplete type {$arg0}

# err_init_list_bad_dest_type
source: %select{|non-aggregate }0type %1 cannot be initialized with an initializer list
root: {$arg0 :select s0=|| s1=|non-aggregate |}type {$arg1} cannot be initialized with an initializer list

# err_init_method_bad_return_type
source: init methods must return an object pointer type, not %0
root: init methods must return an object pointer type, not {$arg0}

# err_init_non_aggr_init_list
source: initialization of non-aggregate type %0 with an initializer list
root: initialization of non-aggregate type {$arg0} with an initializer list

# err_init_objc_class
source: cannot initialize Objective-C class type %0
root: cannot initialize Objective-C class type {$arg0}

# err_init_reference_member_uninitialized
source: reference member of type %0 uninitialized
root: reference member of type {$arg0} uninitialized

# err_initializer_overrides_destructed
source: initializer would partially override prior initialization of object of type %1 with non-trivial destruction
root: initializer would partially override prior initialization of object of type {$arg1} with non-trivial destruction

# err_initializer_string_for_char_array_too_long
source: initializer-string for char array is too long, array size is %0 but initializer has size %1 (including the null terminating character)
root: initializer-string for char array is too long, array size is {$arg0} but initializer has size {$arg1} (including the null terminating character)

# err_inline_decl_follows_def
source: inline declaration of %0 follows non-inline definition
root: inline declaration of {$arg0} follows non-inline definition

# err_inline_declaration_block_scope
source: inline declaration of %0 not allowed in block scope
root: inline declaration of {$arg0} not allowed in block scope

# err_inline_non_function
source: 'inline' can only appear on functions%select{| and non-local variables}0
root: 'inline' can only appear on functions{$arg0 :select s0=|| s1=| and non-local variables|}

# err_integer_incorrect_bit_count
source: incorrect number of bits in integer (expected %0 bits, have %1)
root: incorrect number of bits in integer (expected {$arg0} bits, have {$arg1})

# err_introducing_special_friend
source: %plural{[0,2]:must use a qualified name when declaring|3:cannot declare}0 a %select{constructor|destructor|conversion operator|deduction guide}0 as a friend
root: %plural{[0,2]:must use a qualified name when declaring|3:cannot declare}0 a {$arg0 :select s0=|constructor| s1=|destructor| s2=|conversion operator| s3=|deduction guide|} as a friend

# err_invalid_address_discrimination
source: invalid address discrimination mode %0
root: invalid address discrimination mode {$arg0}

# err_invalid_asm_value_for_constraint
source: value '%0' out of range for constraint '%1'
root: value '{$arg0}' out of range for constraint '{$arg1}'

# err_invalid_astype_of_different_size
source: invalid reinterpretation: sizes of %0 and %1 must match
root: invalid reinterpretation: sizes of {$arg0} and {$arg1} must match

# err_invalid_authentication_key
source: invalid authentication key %0
root: invalid authentication key {$arg0}

# err_invalid_base_in_interface
source: interface type cannot inherit from %select{struct|non-public interface|class}0 %1
root: interface type cannot inherit from {$arg0 :select s0=|struct| s1=|non-public interface| s2=|class|} {$arg1}

# err_invalid_branch_protection_spec
source: invalid or misplaced branch protection specification '%0'
root: invalid or misplaced branch protection specification '{$arg0}'

# err_invalid_collection_element
source: collection element of type %0 is not an Objective-C object
root: collection element of type {$arg0} is not an Objective-C object

# err_invalid_complex_spec
source: '_Complex %0' is invalid
root: '_Complex {$arg0}' is invalid

# err_invalid_consteval_call
source: call to %select{immediate|consteval}1 function %q0 is not a constant expression
root: call to {$arg1 :select s0=|immediate| s1=|consteval|} function {$arg0 :q} is not a constant expression

# err_invalid_consteval_decl_kind
source: %0 cannot be declared consteval
root: {$arg0} cannot be declared consteval

# err_invalid_consteval_take_address
source: cannot take address of %select{immediate|consteval}2 %select{function|call operator of}1 %0 outside of an immediate invocation
root: cannot take address of {$arg2 :select s0=|immediate| s1=|consteval|} {$arg1 :select s0=|function| s1=|call operator of|} {$arg0} outside of an immediate invocation

# err_invalid_constexpr
source: %select{function parameter|typedef}0 cannot be %select{<ERROR>|constexpr|consteval|constinit}1
root: {$arg0 :select s0=|function parameter| s1=|typedef|} cannot be {$arg1 :select s0=|<ERROR>| s1=|constexpr| s2=|consteval| s3=|constinit|}

# err_invalid_constexpr_member
source: non-static data member cannot be constexpr%select{; did you intend to make it %select{const|static}0?|}1
root: non-static data member cannot be constexpr%select{; did you intend to make it {$arg1 :select s0=|const| s1=|static}0?| s2=||}

# err_invalid_conversion_between_ext_vectors
source: invalid conversion between ext-vector type %0 and %1
root: invalid conversion between ext-vector type {$arg0} and {$arg1}

# err_invalid_conversion_between_matrix_and_type
source: conversion between matrix type %0 and incompatible type %1 is not allowed
root: conversion between matrix type {$arg0} and incompatible type {$arg1} is not allowed

# err_invalid_conversion_between_vector_and_integer
source: invalid conversion between vector type %0 and integer type %1 of different size
root: invalid conversion between vector type {$arg0} and integer type {$arg1} of different size

# err_invalid_conversion_between_vector_and_scalar
source: invalid conversion between vector type %0 and scalar type %1
root: invalid conversion between vector type {$arg0} and scalar type {$arg1}

# err_invalid_cpu_specific_dispatch_value
source: invalid option '%0' for %select{cpu_specific|cpu_dispatch}1
root: invalid option '{$arg0}' for {$arg1 :select s0=|cpu_specific| s1=|cpu_dispatch|}

# err_invalid_ctor_dtor_decl
source: invalid %select{constructor|destructor}0 declaration
root: invalid {$arg0 :select s0=|constructor| s1=|destructor|} declaration

# err_invalid_decl_spec_combination
source: cannot combine with previous '%0' declaration specifier
root: cannot combine with previous '{$arg0}' declaration specifier

# err_invalid_declarator_global_scope
source: definition or redeclaration of %0 cannot name the global scope
root: definition or redeclaration of {$arg0} cannot name the global scope

# err_invalid_declarator_in_block
source: definition or redeclaration of %0 not allowed inside a block
root: definition or redeclaration of {$arg0} not allowed inside a block

# err_invalid_declarator_in_function
source: definition or redeclaration of %0 not allowed inside a function
root: definition or redeclaration of {$arg0} not allowed inside a function

# err_invalid_declarator_scope
source: cannot define or redeclare %0 here because namespace %1 does not enclose namespace %2
root: cannot define or redeclare {$arg0} here because namespace {$arg1} does not enclose namespace {$arg2}

# err_invalid_explicit_object_type_in_lambda
source: invalid explicit object parameter type %0 in lambda with capture; the type must be the same as, or derived from, the lambda
root: invalid explicit object parameter type {$arg0} in lambda with capture; the type must be the same as, or derived from, the lambda

# err_invalid_extra_discrimination
source: invalid extra discrimination selection %0
root: invalid extra discrimination selection {$arg0}

# err_invalid_incomplete_type_use
source: invalid use of incomplete type %0
root: invalid use of incomplete type {$arg0}
