Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# warn_coroutine_handle_address_invalid_return_type
source: return type of 'coroutine_handle<>::address should be 'void*' (have %0) in order to get capability with existing async C API
root: return type of 'coroutine_handle<>::address should be 'void*' (have {$arg0}) in order to get capability with existing async C API

# warn_coroutine_promise_unhandled_exception_required_with_exceptions
source: %0 is required to declare the member 'unhandled_exception()' when exceptions are enabled
root: {$arg0} is required to declare the member 'unhandled_exception()' when exceptions are enabled

# warn_coroutine_type_aware_allocator_ignored
source: type aware %0 will not be used for coroutine allocation
root: type aware {$arg0} will not be used for coroutine allocation

# warn_counted_by_attr_elt_type_unknown_size
source: '%select{counted_by|sized_by|counted_by_or_null|sized_by_or_null}4' %select{cannot|should not}3 be applied to %select{a pointer with pointee|an array with element}0 of unknown size because %1 is %select{an incomplete type|a sizeless type|a function type|a struct type with a flexible array member%select{|. This will be an error in a future compiler version}3}2
root: '{$arg4 :select s0=|counted_by| s1=|sized_by| s2=|counted_by_or_null| s3=|sized_by_or_null|}' {$arg3 :select s0=|cannot| s1=|should not|} be applied to {$arg0 :select s0=|a pointer with pointee| s1=|an array with element|} of unknown size because {$arg1} is %select{an incomplete type|a sizeless type|a function type|a struct type with a flexible array member{$arg2 :select s0=|| s1=|. This will be an error in a future compiler version}3|}

# warn_cpp_compat_indirect_goto_in_protected_scope
source: jump from this %select{indirect|asm}0 goto statement to one of its possible targets is incompatible with C++
root: jump from this {$arg0 :select s0=|indirect| s1=|asm|} goto statement to one of its possible targets is incompatible with C++

# warn_cstruct_memaccess
source: %select{destination for|source of|first operand of|second operand of}0 this %1 call is a pointer to record %2 that is not trivial to %select{primitive-default-initialize|primitive-copy}3
root: {$arg0 :select s0=|destination for| s1=|source of| s2=|first operand of| s3=|second operand of|} this {$arg1} call is a pointer to record {$arg2} that is not trivial to {$arg3 :select s0=|primitive-default-initialize| s1=|primitive-copy|}

# warn_ctad_maybe_unsupported
source: %0 may not intend to support class template argument deduction
root: {$arg0} may not intend to support class template argument deduction

# warn_ctor_parm_shadows_field
source: constructor parameter %0 shadows the field %1 of %2
root: constructor parameter {$arg0} shadows the field {$arg1} of {$arg2}

# warn_cuda_maxclusterrank_sm_90
source: maxclusterrank requires sm_90 or higher, CUDA arch provided: %0, ignoring %1 attribute
root: maxclusterrank requires sm_90 or higher, CUDA arch provided: {$arg0}, ignoring {$arg1} attribute

# warn_cxx11_gnu_attribute_on_type
source: attribute %0 ignored, because it cannot be applied to a type
root: attribute {$arg0} ignored, because it cannot be applied to a type

# warn_cxx14_compat_class_template_argument_deduction
source: class template argument deduction is incompatible with C++ standards before C++17%select{|; for compatibility, use explicit type name %1}0
root: class template argument deduction is incompatible with C++ standards before C++17{$arg0 :select s0=|| s1=|; for compatibility, use explicit type name {$arg1}|}

# warn_cxx14_compat_template_nontype_parm_auto_type
source: non-type template parameters declared with %0 are incompatible with C++ standards before C++17
root: non-type template parameters declared with {$arg0} are incompatible with C++ standards before C++17

# warn_cxx17_compat_aggregate_init_paren_list
source: aggregate initialization of type %0 from a parenthesized list of values is a C++20 extension
root: aggregate initialization of type {$arg0} from a parenthesized list of values is a C++20 extension

# warn_cxx17_compat_defaulted_method_type_mismatch
source: explicitly defaulting this %select{default constructor|copy constructor|move constructor|copy assignment operator|move assignment operator|destructor}0 with a type different from the implicit type is incompatible with C++ standards before C++20
root: explicitly defaulting this {$arg0 :select s0=|default constructor| s1=|copy constructor| s2=|move constructor| s3=|copy assignment operator| s4=|move assignment operator| s5=|destructor|} with a type different from the implicit type is incompatible with C++ standards before C++20

# warn_cxx17_compat_exception_spec_in_signature
source: mangled name of %0 will change in C++17 due to non-throwing exception specification in function signature
root: mangled name of {$arg0} will change in C++17 due to non-throwing exception specification in function signature

# warn_cxx17_compat_lambda_def_ctor_assign
source: %select{default construction|assignment}0 of lambda is incompatible with C++ standards before C++20
root: {$arg0 :select s0=|default construction| s1=|assignment|} of lambda is incompatible with C++ standards before C++20

# warn_cxx17_compat_template_nontype_parm_type
source: non-type template parameter of type %0 is incompatible with C++ standards before C++20
root: non-type template parameter of type {$arg0} is incompatible with C++ standards before C++20

# warn_cxx17_compat_using_decl_non_member_enumerator
source: member using declaration naming non-class '%0' enumerator is incompatible with C++ standards before C++20
root: member using declaration naming non-class '{$arg0}' enumerator is incompatible with C++ standards before C++20

# warn_cxx20_compat_aggregate_init_with_ctors
source: aggregate initialization of type %0 with user-declared constructors is incompatible with C++20
root: aggregate initialization of type {$arg0} with user-declared constructors is incompatible with C++20

# warn_cxx20_compat_operator_overload_static
source: declaring overloaded %0 as 'static' is incompatible with C++ standards before C++23
root: declaring overloaded {$arg0} as 'static' is incompatible with C++ standards before C++23

# warn_cxx98_compat_array_size_conversion
source: implicit conversion from array size expression of type %0 to %select{integral|enumeration}1 type %2 is incompatible with C++98
root: implicit conversion from array size expression of type {$arg0} to {$arg1 :select s0=|integral| s1=|enumeration|} type {$arg2} is incompatible with C++98

# warn_cxx98_compat_empty_sizeless_initializer
source: initializing %0 from an empty initializer list is incompatible with C++98
root: initializing {$arg0} from an empty initializer list is incompatible with C++98

# warn_cxx98_compat_indirect_goto_in_protected_scope
source: jump from this %select{indirect|asm}0 goto statement to one of its possible targets is incompatible with C++98
root: jump from this {$arg0 :select s0=|indirect| s1=|asm|} goto statement to one of its possible targets is incompatible with C++98

# warn_cxx98_compat_non_static_member_use
source: use of non-static data member %0 in an unevaluated context is incompatible with C++98
root: use of non-static data member {$arg0} in an unevaluated context is incompatible with C++98

# warn_cxx98_compat_nontrivial_union_or_anon_struct_member
source: %select{anonymous struct|union}0 member %1 with a non-trivial %select{default constructor|copy constructor|move constructor|copy assignment operator|move assignment operator|destructor}2 is incompatible with C++98
root: {$arg0 :select s0=|anonymous struct| s1=|union|} member {$arg1} with a non-trivial {$arg2 :select s0=|default constructor| s1=|copy constructor| s2=|move constructor| s3=|copy assignment operator| s4=|move assignment operator| s5=|destructor|} is incompatible with C++98

# warn_cxx98_compat_pass_non_pod_arg_to_vararg
source: passing object of trivial but non-POD type %0 through variadic %select{function|block|method|constructor}1 is incompatible with C++98
root: passing object of trivial but non-POD type {$arg0} through variadic {$arg1 :select s0=|function| s1=|block| s2=|method| s3=|constructor|} is incompatible with C++98

# warn_cxx98_compat_temp_copy
source: %select{copying variable|copying parameter|initializing template parameter|returning object|initializing statement expression result|throwing object|copying member subobject|copying array element|allocating object|copying temporary|initializing base subobject|initializing vector element|capturing value}1 of type %2 when binding a reference to a temporary would %select{invoke an inaccessible constructor|find no viable constructor|find ambiguous constructors|invoke a deleted constructor}0 in C++98
root: {$arg1 :select s0=|copying variable| s1=|copying parameter| s2=|initializing template parameter| s3=|returning object| s4=|initializing statement expression result| s5=|throwing object| s6=|copying member subobject| s7=|copying array element| s8=|allocating object| s9=|copying temporary| s10=|initializing base subobject| s11=|initializing vector element| s12=|capturing value|} of type {$arg2} when binding a reference to a temporary would {$arg0 :select s0=|invoke an inaccessible constructor| s1=|find no viable constructor| s2=|find ambiguous constructors| s3=|invoke a deleted constructor|} in C++98

# warn_cxx98_compat_template_arg_local_type
source: local type %0 as template argument is incompatible with C++98
root: local type {$arg0} as template argument is incompatible with C++98

# warn_cxx98_compat_template_arg_object_internal
source: non-type template argument referring to %select{function|object}0 %1 with internal linkage is incompatible with C++98
root: non-type template argument referring to {$arg0 :select s0=|function| s1=|object|} {$arg1} with internal linkage is incompatible with C++98

# warn_cxx98_compat_unelaborated_friend_type
source: befriending %1 without '%select{struct|interface|union|class|enum}0' keyword is incompatible with C++98
root: befriending {$arg1} without '{$arg0 :select s0=|struct| s1=|interface| s2=|union| s3=|class| s4=|enum|}' keyword is incompatible with C++98

# warn_cxx98_compat_unicode_type
source: '%0' type specifier is incompatible with C++98
root: '{$arg0}' type specifier is incompatible with C++98

# warn_cxx_compat_tentative_definition
source: duplicate declaration of %0 is invalid in C++
root: duplicate declaration of {$arg0} is invalid in C++

# warn_cxxstruct_memaccess
source: first argument in call to %0 is a pointer to non-trivially copyable type %1
root: first argument in call to {$arg0} is a pointer to non-trivially copyable type {$arg1}

# warn_dangling_lifetime_pointer_assignment
source: object backing the pointer %0 will be destroyed at the end of the full-expression
root: object backing the pointer {$arg0} will be destroyed at the end of the full-expression

# warn_dangling_lifetime_pointer_member
source: initializing pointer member %0 to point to a temporary object whose lifetime is shorter than the lifetime of the constructed object
root: initializing pointer member {$arg0} to point to a temporary object whose lifetime is shorter than the lifetime of the constructed object

# warn_dangling_member
source: %select{reference|backing array for 'std::initializer_list'}2 %select{|subobject of }1member %0 %select{binds to|is}2 a temporary object whose lifetime is shorter than the lifetime of the constructed object
root: {$arg2 :select s0=|reference| s1=|backing array for 'std::initializer_list'|} {$arg1 :select s0=|| s1=|subobject of |}member {$arg0} {$arg2 :select s0=|binds to| s1=|is|} a temporary object whose lifetime is shorter than the lifetime of the constructed object

# warn_dangling_variable
source: %select{temporary %select{whose address is used as value of|%select{|implicitly }2bound to}4 %select{%select{|reference }4member of local variable|local %select{variable|reference}4}1|array backing %select{initializer list subobject of local variable|local initializer list}1}0 %select{%3 |}2will be destroyed at the end of the full-expression
root: %select{temporary %select{whose address is used as value of|{$arg4 :select s0=|| s1=|implicitly }2bound to|} %select{{$arg4 :select s0=|| s1=|reference |}member of local variable|local {$arg1 :select s0=|variable| s1=|reference}4|}|array backing {$arg0 :select s0=|initializer list subobject of local variable| s1=|local initializer list}1|} {$arg2 :select s0=|{$arg3} | s1=||}will be destroyed at the end of the full-expression

# warn_decl_hidden_in_cpp
source: %select{struct|union|enum}0 defined within a struct or union is not visible in C++
root: {$arg0 :select s0=|struct| s1=|union| s2=|enum|} defined within a struct or union is not visible in C++

# warn_decl_in_param_list
source: declaration of %0 will not be visible outside of this function
root: declaration of {$arg0} will not be visible outside of this function

# warn_decl_shadow
source: declaration shadows a %select{local variable|variable in %2|static data member of %2|field of %2|typedef in %2|type alias in %2|structured binding}1
root: declaration shadows a {$arg1 :select s0=|local variable| s1=|variable in {$arg2}| s2=|static data member of {$arg2}| s3=|field of {$arg2}| s4=|typedef in {$arg2}| s5=|type alias in {$arg2}| s6=|structured binding|}

# warn_decl_shadow_uncaptured_local
source: declaration shadows a %select{local variable|variable in %2|static data member of %2|field of %2|typedef in %2|type alias in %2|structured binding}1
root: declaration shadows a {$arg1 :select s0=|local variable| s1=|variable in {$arg2}| s2=|static data member of {$arg2}| s3=|field of {$arg2}| s4=|typedef in {$arg2}| s5=|type alias in {$arg2}| s6=|structured binding|}

# warn_declspec_allocator_nonpointer
source: ignoring __declspec(allocator) because the function return type %0 is not a pointer or reference type
root: ignoring __declspec(allocator) because the function return type {$arg0} is not a pointer or reference type

# warn_declspec_attribute_ignored
source: attribute %0 is ignored, place it after "%select{class|struct|interface|union|enum|enum class|enum struct}1" to apply attribute to type declaration
root: attribute {$arg0} is ignored, place it after "{$arg1 :select s0=|class| s1=|struct| s2=|interface| s3=|union| s4=|enum| s5=|enum class| s6=|enum struct|}" to apply attribute to type declaration

# warn_deep_exception_specs_differ
source: exception specifications of %select{return|argument}0 types differ
root: exception specifications of {$arg0 :select s0=|return| s1=|argument|} types differ

# warn_def_missing_case
source: %plural{1:enumeration value %1 not explicitly handled in switch|2:enumeration values %1 and %2 not explicitly handled in switch|3:enumeration values %1, %2, and %3 not explicitly handled in switch|:%0 enumeration values not explicitly handled in switch: %1, %2, %3...}0
root: %plural{1:enumeration value {$arg1} not explicitly handled in switch|2:enumeration values {$arg1} and {$arg2} not explicitly handled in switch|3:enumeration values {$arg1}, {$arg2}, and {$arg3} not explicitly handled in switch|:{$arg0} enumeration values not explicitly handled in switch: {$arg1}, {$arg2}, {$arg3}...}0

# warn_default_atomic_custom_getter_setter
source: atomic by default property %0 has a user defined %select{getter|setter}1 (property should be marked 'atomic' if this is intended)
root: atomic by default property {$arg0} has a user defined {$arg1 :select s0=|getter| s1=|setter|} (property should be marked 'atomic' if this is intended)

# warn_default_init_const
source: default initialization of an object of type %0 is incompatible with C++
root: default initialization of an object of type {$arg0} is incompatible with C++

# warn_default_init_const_field
source: default initialization of an object of type %0 with const member is incompatible with C++
root: default initialization of an object of type {$arg0} with const member is incompatible with C++

# warn_default_init_const_field_unsafe
source: default initialization of an object of type %0 with const member leaves the object uninitialized%select{| and is incompatible with C++}1
root: default initialization of an object of type {$arg0} with const member leaves the object uninitialized{$arg1 :select s0=|| s1=| and is incompatible with C++|}

# warn_default_init_const_unsafe
source: default initialization of an object of type %0 leaves the object uninitialized%select{| and is incompatible with C++}1
root: default initialization of an object of type {$arg0} leaves the object uninitialized{$arg1 :select s0=|| s1=| and is incompatible with C++|}

# warn_defaulted_comparison_deleted
source: explicitly defaulted %select{<ERROR>|equality|three-way|equality|relational}0 comparison operator is implicitly deleted
root: explicitly defaulted {$arg0 :select s0=|<ERROR>| s1=|equality| s2=|three-way| s3=|equality| s4=|relational|} comparison operator is implicitly deleted

# warn_defaulted_method_deleted
source: explicitly defaulted %select{default constructor|copy constructor|move constructor|copy assignment operator|move assignment operator|destructor}0 is implicitly deleted
root: explicitly defaulted {$arg0 :select s0=|default constructor| s1=|copy constructor| s2=|move constructor| s3=|copy assignment operator| s4=|move assignment operator| s5=|destructor|} is implicitly deleted

# warn_delegating_ctor_cycle
source: constructor for %0 creates a delegation cycle
root: constructor for {$arg0} creates a delegation cycle

# warn_delete_abstract_non_virtual_dtor
source: %select{delete|destructor}0 called on %1 that is abstract but has non-virtual destructor
root: {$arg0 :select s0=|delete| s1=|destructor|} called on {$arg1} that is abstract but has non-virtual destructor

# warn_delete_array_type
source: 'delete' applied to a pointer-to-array type %0 treated as 'delete[]'
root: 'delete' applied to a pointer-to-array type {$arg0} treated as 'delete[]'

# warn_delete_incomplete
source: deleting pointer to incomplete type %0 is incompatible with C++2c and may cause undefined behavior
root: deleting pointer to incomplete type {$arg0} is incompatible with C++2c and may cause undefined behavior

# warn_delete_non_virtual_dtor
source: %select{delete|destructor}0 called on non-final %1 that has virtual functions but non-virtual destructor
root: {$arg0 :select s0=|delete| s1=|destructor|} called on non-final {$arg1} that has virtual functions but non-virtual destructor

# warn_deprecated
source: %0 is deprecated
root: {$arg0} is deprecated

# warn_deprecated_builtin
source: builtin %0 is deprecated; use %1 instead
root: builtin {$arg0} is deprecated; use {$arg1} instead

# warn_deprecated_copy
source: definition of implicit copy %select{constructor|assignment operator}1 for %0 is deprecated because it has a user-declared copy %select{assignment operator|constructor}1
root: definition of implicit copy {$arg1 :select s0=|constructor| s1=|assignment operator|} for {$arg0} is deprecated because it has a user-declared copy {$arg1 :select s0=|assignment operator| s1=|constructor|}

# warn_deprecated_copy_with_dtor
source: definition of implicit copy %select{constructor|assignment operator}1 for %0 is deprecated because it has a user-declared destructor
root: definition of implicit copy {$arg1 :select s0=|constructor| s1=|assignment operator|} for {$arg0} is deprecated because it has a user-declared destructor

# warn_deprecated_copy_with_user_provided_copy
source: definition of implicit copy %select{constructor|assignment operator}1 for %0 is deprecated because it has a user-provided copy %select{assignment operator|constructor}1
root: definition of implicit copy {$arg1 :select s0=|constructor| s1=|assignment operator|} for {$arg0} is deprecated because it has a user-provided copy {$arg1 :select s0=|assignment operator| s1=|constructor|}

# warn_deprecated_copy_with_user_provided_dtor
source: definition of implicit copy %select{constructor|assignment operator}1 for %0 is deprecated because it has a user-provided destructor
root: definition of implicit copy {$arg1 :select s0=|constructor| s1=|assignment operator|} for {$arg0} is deprecated because it has a user-provided destructor

# warn_deprecated_def
source: implementing deprecated %select{method|class|category}0
root: implementing deprecated {$arg0 :select s0=|method| s1=|class| s2=|category|}

# warn_deprecated_fwdclass_message
source: %0 may be deprecated because the receiver type is unknown
root: {$arg0} may be deprecated because the receiver type is unknown

# warn_deprecated_ignored_on_using
source: %0 currently has no effect on a using declaration
root: {$arg0} currently has no effect on a using declaration

# warn_deprecated_increment_decrement_volatile
source: %select{decrement|increment}0 of object of volatile-qualified type %1 is deprecated
root: {$arg0 :select s0=|decrement| s1=|increment|} of object of volatile-qualified type {$arg1} is deprecated

# warn_deprecated_lax_vec_conv_all
source: implicit conversion between vector types ('%0' and '%1') is deprecated; in the future, the behavior implied by '-fno-lax-vector-conversions' will be the default
root: implicit conversion between vector types ('{$arg0}' and '{$arg1}') is deprecated; in the future, the behavior implied by '-fno-lax-vector-conversions' will be the default

# warn_deprecated_literal_operator_id
source: identifier %0 preceded by whitespace in a literal operator declaration is deprecated
root: identifier {$arg0} preceded by whitespace in a literal operator declaration is deprecated

# warn_deprecated_message
source: %0 is deprecated: %1
root: {$arg0} is deprecated: {$arg1}

# warn_deprecated_simple_assign_volatile
source: use of result of assignment to object of volatile-qualified type %0 is deprecated
root: use of result of assignment to object of volatile-qualified type {$arg0} is deprecated

# warn_deprecated_string_literal_conversion
source: conversion from string literal to %0 is deprecated
root: conversion from string literal to {$arg0} is deprecated

# warn_deprecated_volatile_param
source: volatile-qualified parameter type %0 is deprecated
root: volatile-qualified parameter type {$arg0} is deprecated

# warn_deprecated_volatile_return
source: volatile-qualified return type %0 is deprecated
root: volatile-qualified return type {$arg0} is deprecated

# warn_dereference_of_noderef_type
source: dereferencing %0; was declared with a 'noderef' type
root: dereferencing {$arg0}; was declared with a 'noderef' type

# warn_direct_ivar_access
source: instance variable %0 is being directly accessed
root: instance variable {$arg0} is being directly accessed

# warn_division_sizeof_array
source: expression does not compute the number of elements in this array; element type is %0, not %1
root: expression does not compute the number of elements in this array; element type is {$arg0}, not {$arg1}

# warn_dllimport_dropped_from_inline_function
source: %q0 redeclared inline; %1 attribute ignored
root: {$arg0 :q} redeclared inline; {$arg1} attribute ignored

# warn_double_const_requires_fp64
source: double precision constant requires %select{cl_khr_fp64|cl_khr_fp64 and __opencl_c_fp64}0, casting to single precision
root: double precision constant requires {$arg0 :select s0=|cl_khr_fp64| s1=|cl_khr_fp64 and __opencl_c_fp64|}, casting to single precision

# warn_double_lock
source: acquiring %0 '%1' that is already held
root: acquiring {$arg0} '{$arg1}' that is already held

# warn_duplicate_attribute
source: attribute %0 is already applied with different arguments
root: attribute {$arg0} is already applied with different arguments

# warn_duplicate_attribute_exact
source: attribute %0 is already applied
root: attribute {$arg0} is already applied
