Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# err_musttail_callconv_mismatch
source: cannot perform a tail call to function%select{| %1}0 because it uses an incompatible calling convention
root: cannot perform a tail call to function{$arg0 :select s0=|| s1=| {$arg1}|} because it uses an incompatible calling convention

# err_musttail_forbidden_from_this_context
source: %0 attribute cannot be used from %select{a block|an Objective-C function|this context}1
root: {$arg0} attribute cannot be used from {$arg1 :select s0=|a block| s1=|an Objective-C function| s2=|this context|}

# err_musttail_member_mismatch
source: %select{non-member|static member|non-static member}0 function cannot perform a tail call to %select{non-member|static member|non-static member|pointer-to-member}1 function%select{| %3}2
root: {$arg0 :select s0=|non-member| s1=|static member| s2=|non-static member|} function cannot perform a tail call to {$arg1 :select s0=|non-member| s1=|static member| s2=|non-static member| s3=|pointer-to-member|} function{$arg2 :select s0=|| s1=| {$arg3}|}

# err_musttail_mismatch
source: cannot perform a tail call to function%select{| %1}0 because its signature is incompatible with the calling function
root: cannot perform a tail call to function{$arg0 :select s0=|| s1=| {$arg1}|} because its signature is incompatible with the calling function

# err_musttail_needs_call
source: %0 attribute requires that the return value is the result of a function call
root: {$arg0} attribute requires that the return value is the result of a function call

# err_musttail_needs_prototype
source: %0 attribute requires that both caller and callee functions have a prototype
root: {$arg0} attribute requires that both caller and callee functions have a prototype

# err_musttail_no_return
source: %0 attribute may not be used with no-return-attribute functions
root: {$arg0} attribute may not be used with no-return-attribute functions

# err_musttail_no_variadic
source: %0 attribute may not be used with variadic functions
root: {$arg0} attribute may not be used with variadic functions

# err_musttail_structors_forbidden
source: cannot perform a tail call %select{from|to}0 a %select{constructor|destructor}1
root: cannot perform a tail call {$arg0 :select s0=|from| s1=|to|} a {$arg1 :select s0=|constructor| s1=|destructor|}

# err_need_header_before_placement_new
source: no matching %0 function for non-allocating placement new expression; include <new>
root: no matching {$arg0} function for non-allocating placement new expression; include <new>

# err_nested_name_member_ref_lookup_ambiguous
source: lookup of %0 in member access expression is ambiguous
root: lookup of {$arg0} in member access expression is ambiguous

# err_nested_name_spec_is_not_class
source: %0 cannot appear before '::' because it is not a class%select{ or namespace|, namespace, or enumeration}1; did you mean ':'?
root: {$arg0} cannot appear before '::' because it is not a class{$arg1 :select s0=| or namespace| s1=|, namespace, or enumeration|}; did you mean ':'?

# err_nested_name_spec_non_tag
source: type %0 cannot be used prior to '::' because it has no members
root: type {$arg0} cannot be used prior to '::' because it has no members

# err_nested_non_static_member_use
source: %select{call to non-static member function|use of non-static data member}0 %2 of %1 from nested type %3
root: {$arg0 :select s0=|call to non-static member function| s1=|use of non-static data member|} {$arg2} of {$arg1} from nested type {$arg3}

# err_nested_redefinition
source: nested redefinition of %0
root: nested redefinition of {$arg0}

# err_new_abi_tag_on_redeclaration
source: 'abi_tag' %0 missing in original declaration
root: 'abi_tag' {$arg0} missing in original declaration

# err_new_incomplete_or_sizeless_type
source: allocation of %select{incomplete|sizeless}0 type %1
root: allocation of {$arg0 :select s0=|incomplete| s1=|sizeless|} type {$arg1}

# err_no_accessor_for_property
source: no %select{getter|setter}0 defined for property %1
root: no {$arg0 :select s0=|getter| s1=|setter|} defined for property {$arg1}

# err_no_base_classes
source: invalid use of '__super', %0 has no base classes
root: invalid use of '__super', {$arg0} has no base classes

# err_no_default_vtable_pointer_auth
source: cannot specify a default vtable pointer authentication %select{key|address discrimination mode|discriminator}0 with no default set
root: cannot specify a default vtable pointer authentication {$arg0 :select s0=|key| s1=|address discrimination mode| s2=|discriminator|} with no default set

# err_no_member
source: no member named %0 in %1
root: no member named {$arg0} in {$arg1}

# err_no_member_overloaded_arrow
source: no member named %0 in %1; did you mean to use '->' instead of '.'?
root: no member named {$arg0} in {$arg1}; did you mean to use '->' instead of '.'?

# err_no_member_suggest
source: no member named %0 in %1; did you mean %select{|simply }2%3?
root: no member named {$arg0} in {$arg1}; did you mean {$arg2 :select s0=|| s1=|simply |}{$arg3}?

# err_no_member_template
source: no template named %0 in %1
root: no template named {$arg0} in {$arg1}

# err_no_member_template_suggest
source: no template named %0 in %1; did you mean %select{|simply }2%3?
root: no template named {$arg0} in {$arg1}; did you mean {$arg2 :select s0=|| s1=|simply |}{$arg3}?

# err_no_nsconstant_string_class
source: cannot find interface declaration for %0
root: cannot find interface declaration for {$arg0}

# err_no_suitable_delete_member_function_found
source: no suitable member %0 in %1
root: no suitable member {$arg0} in {$arg1}

# err_no_super_class_message
source: no @interface declaration found in class messaging of %0
root: no @interface declaration found in class messaging of {$arg0}

# err_no_template
source: no template named %0
root: no template named {$arg0}

# err_no_template_suggest
source: no template named %0; did you mean %1?
root: no template named {$arg0}; did you mean {$arg1}?

# err_no_viable_destructor
source: no viable destructor found for class %0
root: no viable destructor found for class {$arg0}

# err_nogetter_property_incdec
source: no getter method %1 for %select{increment|decrement}0 of property
root: no getter method {$arg1} for {$arg0 :select s0=|increment| s1=|decrement|} of property

# err_non_bool_atomic_constraint
source: atomic constraint must be of type 'bool' (found %0)
root: atomic constraint must be of type 'bool' (found {$arg0})

# err_non_c_like_anon_struct_in_typedef
source: anonymous non-C-compatible type given name for linkage purposes by %select{typedef|alias}0 declaration after its linkage was computed; add a tag name here to establish linkage prior to definition
root: anonymous non-C-compatible type given name for linkage purposes by {$arg0 :select s0=|typedef| s1=|alias|} declaration after its linkage was computed; add a tag name here to establish linkage prior to definition

# err_non_consteval_override
source: non-consteval function %0 cannot override a consteval function
root: non-consteval function {$arg0} cannot override a consteval function

# err_non_deleted_override
source: non-deleted function %0 cannot override a deleted function
root: non-deleted function {$arg0} cannot override a deleted function

# err_non_extern_extern
source: non-extern declaration of %0 follows extern declaration
root: non-extern declaration of {$arg0} follows extern declaration

# err_non_first_default_compare_deletes
source: defaulting %select{this %select{<ERROR>|equality|three-way|equality|relational}1 comparison operator|the corresponding implicit 'operator==' for this defaulted 'operator<=>'}0 would delete it after its first declaration
root: defaulting %select{this {$arg0 :select s0=|<ERROR>| s1=|equality| s2=|three-way| s3=|equality| s4=|relational}1 comparison operator| s5=|the corresponding implicit 'operator==' for this defaulted 'operator<=>'|} would delete it after its first declaration

# err_non_first_default_compare_in_class
source: defaulting this %select{<ERROR>|equality|three-way|equality|relational}0 comparison operator is not allowed because it was already declared outside the class
root: defaulting this {$arg0 :select s0=|<ERROR>| s1=|equality| s2=|three-way| s3=|equality| s4=|relational|} comparison operator is not allowed because it was already declared outside the class

# err_non_polymorphic_vtable_pointer_auth
source: cannot set vtable pointer authentication on monomorphic type %0
root: cannot set vtable pointer authentication on monomorphic type {$arg0}

# err_non_static_static
source: non-static declaration of %0 follows static declaration
root: non-static declaration of {$arg0} follows static declaration

# err_non_temp_spec_requires_clause
source: %select{explicit|friend}0 specialization cannot have a trailing requires clause unless it declares a function template
root: {$arg0 :select s0=|explicit| s1=|friend|} specialization cannot have a trailing requires clause unless it declares a function template

# err_non_template_in_member_template_id_suggest
source: member %0 of %1 is not a template; did you mean %select{|simply }2%3?
root: member {$arg0} of {$arg1} is not a template; did you mean {$arg2 :select s0=|| s1=|simply |}{$arg3}?

# err_non_template_in_template_id
source: %0 does not name a template but is followed by template arguments
root: {$arg0} does not name a template but is followed by template arguments

# err_non_template_in_template_id_suggest
source: %0 does not name a template but is followed by template arguments; did you mean %1?
root: {$arg0} does not name a template but is followed by template arguments; did you mean {$arg1}?

# err_non_thread_thread
source: non-thread-local declaration of %0 follows thread-local declaration
root: non-thread-local declaration of {$arg0} follows thread-local declaration

# err_non_top_level_vtable_pointer_auth
source: cannot set vtable pointer authentication on %0 which is a subclass of polymorphic type %1
root: cannot set vtable pointer authentication on {$arg0} which is a subclass of polymorphic type {$arg1}

# err_non_trivial_c_union_in_invalid_context
source: cannot %select{use type %1 for a function/method parameter|use type %1 for function/method return|default-initialize an object of type %1|declare an automatic variable of type %1|copy-initialize an object of type %1|assign to a variable of type %1|construct an automatic compound literal of type %1|capture a variable of type %1|cannot use volatile type %1 where it causes an lvalue-to-rvalue conversion}3 since it %select{contains|is}2 a union that is non-trivial to %select{default-initialize|destruct|copy}0
root: cannot {$arg3 :select s0=|use type {$arg1} for a function/method parameter| s1=|use type {$arg1} for function/method return| s2=|default-initialize an object of type {$arg1}| s3=|declare an automatic variable of type {$arg1}| s4=|copy-initialize an object of type {$arg1}| s5=|assign to a variable of type {$arg1}| s6=|construct an automatic compound literal of type {$arg1}| s7=|capture a variable of type {$arg1}| s8=|cannot use volatile type {$arg1} where it causes an lvalue-to-rvalue conversion|} since it {$arg2 :select s0=|contains| s1=|is|} a union that is non-trivial to {$arg0 :select s0=|default-initialize| s1=|destruct| s2=|copy|}

# err_non_type_template_arg_subobject
source: non-type template argument refers to subobject '%0'
root: non-type template argument refers to subobject '{$arg0}'

# err_non_type_template_in_nested_name_specifier
source: qualified name refers into a specialization of %select{function|variable}0 template %1
root: qualified name refers into a specialization of {$arg0 :select s0=|function| s1=|variable|} template {$arg1}

# err_non_type_template_parm_type_deduction_failure
source: non-type template parameter %0 with type %1 has incompatible initializer of type %2
root: non-type template parameter {$arg0} with type {$arg1} has incompatible initializer of type {$arg2}

# err_non_virtual_pure
source: %0 is not virtual and cannot be declared pure
root: {$arg0} is not virtual and cannot be declared pure

# err_nontemporal_builtin_must_be_pointer
source: address argument to nontemporal builtin must be a pointer (%0 invalid)
root: address argument to nontemporal builtin must be a pointer ({$arg0} invalid)

# err_nontemporal_builtin_must_be_pointer_intfltptr_or_vector
source: address argument to nontemporal builtin must be a pointer to integer, float, pointer, or a vector of such types (%0 invalid)
root: address argument to nontemporal builtin must be a pointer to integer, float, pointer, or a vector of such types ({$arg0} invalid)

# err_noreturn_has_return_expr
source: %select{function|block|lambda|coroutine}0 declared 'noreturn' should not return
root: {$arg0 :select s0=|function| s1=|block| s2=|lambda| s3=|coroutine|} declared 'noreturn' should not return

# err_nosetter_property_assignment
source: %select{assignment to readonly property|no setter method %1 for assignment to property}0
root: {$arg0 :select s0=|assignment to readonly property| s1=|no setter method {$arg1} for assignment to property|}

# err_nosetter_property_incdec
source: %select{%select{increment|decrement}1 of readonly property|no setter method %2 for %select{increment|decrement}1 of property}0
root: %select{{$arg1 :select s0=|increment| s1=|decrement|} of readonly property|no setter method {$arg2} for {$arg0 :select s0=|increment| s1=|decrement}1 of property|}

# err_not_class_template_specialization
source: cannot specialize a %select{dependent template|template template parameter}0
root: cannot specialize a {$arg0 :select s0=|dependent template| s1=|template template parameter|}

# err_not_direct_base_or_virtual
source: type %0 is not a direct or virtual base of %1
root: type {$arg0} is not a direct or virtual base of {$arg1}

# err_not_found_by_two_phase_lookup
source: call to function %0 that is neither visible in the template definition nor found by argument-dependent lookup
root: call to function {$arg0} that is neither visible in the template definition nor found by argument-dependent lookup

# err_not_integral_type_anon_bitfield
source: anonymous bit-field has non-integral type %0
root: anonymous bit-field has non-integral type {$arg0}

# err_not_integral_type_bitfield
source: bit-field %0 has non-integral type %1
root: bit-field {$arg0} has non-integral type {$arg1}

# err_not_tag_in_scope
source: no %select{struct|interface|union|class|enum}0 named %1 in %2
root: no {$arg0 :select s0=|struct| s1=|interface| s2=|union| s3=|class| s4=|enum|} named {$arg1} in {$arg2}

# err_ns_attribute_wrong_parameter_type
source: %0 attribute only applies to %select{Objective-C object|pointer|pointer-to-CF-pointer}1 parameters
root: {$arg0} attribute only applies to {$arg1 :select s0=|Objective-C object| s1=|pointer| s2=|pointer-to-CF-pointer|} parameters

# err_nserrordomain_invalid_decl
source: domain argument %select{|%1 }0does not refer to global constant
root: domain argument {$arg0 :select s0=|| s1=|{$arg1} |}does not refer to global constant

# err_nserrordomain_wrong_type
source: domain argument %0 does not point to an NSString or CFString constant
root: domain argument {$arg0} does not point to an NSString or CFString constant

# err_nsreturns_retained_attribute_mismatch
source: overriding method has mismatched ns_returns_%select{not_retained|retained}0 attributes
root: overriding method has mismatched ns_returns_{$arg0 :select s0=|not_retained| s1=|retained|} attributes

# err_nullability_cs_multilevel
source: nullability keyword %0 cannot be applied to multi-level pointer type %1
root: nullability keyword {$arg0} cannot be applied to multi-level pointer type {$arg1}

# err_nullability_nonpointer
source: nullability specifier %0 cannot be applied to non-pointer type %1
root: nullability specifier {$arg0} cannot be applied to non-pointer type {$arg1}

# err_nullptr_cast
source: cannot cast an object of type %select{'nullptr_t' to %1|%1 to 'nullptr_t'}0
root: cannot cast an object of type {$arg0 :select s0=|'nullptr_t' to {$arg1}| s1=|{$arg1} to 'nullptr_t'|}

# err_objc_array_of_interfaces
source: array of interface %0 is invalid (probably should be an array of pointers)
root: array of interface {$arg0} is invalid (probably should be an array of pointers)

# err_objc_attr_not_id
source: parameter of %0 attribute must be a single name of an Objective-C %select{class|protocol}1
root: parameter of {$arg0} attribute must be a single name of an Objective-C {$arg1 :select s0=|class| s1=|protocol|}

# err_objc_attr_protocol_requires_definition
source: attribute %0 can only be applied to @protocol definitions, not forward declarations
root: attribute {$arg0} can only be applied to @protocol definitions, not forward declarations

# err_objc_attr_typedef_not_id
source: parameter of %0 attribute must be 'id' when used on a typedef
root: parameter of {$arg0} attribute must be 'id' when used on a typedef

# err_objc_bridged_related_invalid_class
source: could not find Objective-C class %0 to convert %1 to %2
root: could not find Objective-C class {$arg0} to convert {$arg1} to {$arg2}

# err_objc_bridged_related_invalid_class_name
source: %0 must be name of an Objective-C class to be able to convert %1 to %2
root: {$arg0} must be name of an Objective-C class to be able to convert {$arg1} to {$arg2}

# err_objc_bridged_related_known_method
source: %0 must be explicitly converted to %1; use %select{%objcclass2|%objcinstance2}3 method for this conversion
root: {$arg0} must be explicitly converted to {$arg1}; use {$arg3 :select s0=|%objcclass2| s1=|%objcinstance2|} method for this conversion

# err_objc_cf_bridged_not_interface
source: CF object of type %0 is bridged to %1, which is not an Objective-C class
root: CF object of type {$arg0} is bridged to {$arg1}, which is not an Objective-C class

# err_objc_direct_duplicate_decl
source: %select{|direct }0%select{method|property}1 declaration conflicts with previous %select{|direct }2declaration of %select{method|property}1 %3
root: {$arg0 :select s0=|| s1=|direct |}{$arg1 :select s0=|method| s1=|property|} declaration conflicts with previous {$arg2 :select s0=|| s1=|direct |}declaration of {$arg1 :select s0=|method| s1=|property|} {$arg3}

# err_objc_direct_impl_decl_mismatch
source: direct method was declared in %select{the primary interface|an extension|a category}0 but is implemented in %select{the primary interface|a category|a different category}1
root: direct method was declared in {$arg0 :select s0=|the primary interface| s1=|an extension| s2=|a category|} but is implemented in {$arg1 :select s0=|the primary interface| s1=|a category| s2=|a different category|}

# err_objc_direct_on_override
source: methods that %select{override superclass methods|implement protocol requirements}0 cannot be direct
root: methods that {$arg0 :select s0=|override superclass methods| s1=|implement protocol requirements|} cannot be direct

# err_objc_direct_on_protocol
source: 'objc_direct' attribute cannot be applied to %select{methods|properties}0 declared in an Objective-C protocol
root: 'objc_direct' attribute cannot be applied to {$arg0 :select s0=|methods| s1=|properties|} declared in an Objective-C protocol

# err_objc_direct_protocol_conformance
source: %select{category %1|class extension}0 cannot conform to protocol %2 because of direct members declared in interface %3
root: {$arg0 :select s0=|category {$arg1}| s1=|class extension|} cannot conform to protocol {$arg2} because of direct members declared in interface {$arg3}

# err_objc_exceptions_disabled
source: cannot use '%0' with Objective-C exceptions disabled
root: cannot use '{$arg0}' with Objective-C exceptions disabled

# err_objc_illegal_boxed_expression_type
source: illegal type %0 used in a boxed expression
root: illegal type {$arg0} used in a boxed expression

# err_objc_incomplete_boxed_expression_type
source: incomplete type %0 used in a boxed expression
root: incomplete type {$arg0} used in a boxed expression

# err_objc_index_incomplete_class_type
source: Objective-C index expression has incomplete class type %0
root: Objective-C index expression has incomplete class type {$arg0}

# err_objc_indexing_method_result_type
source: method for accessing %select{dictionary|array}1 element must have Objective-C object return type instead of %0
root: method for accessing {$arg1 :select s0=|dictionary| s1=|array|} element must have Objective-C object return type instead of {$arg0}

# err_objc_kindof_nonobject
source: '__kindof' specifier cannot be applied to non-object type %0
root: '__kindof' specifier cannot be applied to non-object type {$arg0}

# err_objc_literal_method_sig
source: literal construction method %0 has incompatible signature
root: literal construction method {$arg0} has incompatible signature

# err_objc_method_unsupported_param_ret_type
source: %0 %select{parameter|return}1 type is unsupported; support for vector types for this target is introduced in %2
root: {$arg0} {$arg1 :select s0=|parameter| s1=|return|} type is unsupported; support for vector types for this target is introduced in {$arg2}

# err_objc_multiple_subscript_type_conversion
source: indexing expression is invalid because subscript type %0 has multiple type conversion functions
root: indexing expression is invalid because subscript type {$arg0} has multiple type conversion functions

# err_objc_non_trivially_copyable_boxed_expression_type
source: non-trivially copyable type %0 cannot be used in a boxed expression
root: non-trivially copyable type {$arg0} cannot be used in a boxed expression

# err_objc_ns_bridged_invalid_cfobject
source: Objective-C object of type %0 is bridged to %1, which is not valid CF object
root: Objective-C object of type {$arg0} is bridged to {$arg1}, which is not valid CF object

# err_objc_object_assignment
source: cannot assign to class object (%0 invalid)
root: cannot assign to class object ({$arg0} invalid)

# err_objc_parameterized_category_nonclass
source: %select{extension|category}0 of non-parameterized class %1 cannot have type parameters
root: {$arg0 :select s0=|extension| s1=|category|} of non-parameterized class {$arg1} cannot have type parameters

# err_objc_parameterized_forward_class
source: forward declaration of non-parameterized class %0 cannot have type parameters
root: forward declaration of non-parameterized class {$arg0} cannot have type parameters

# err_objc_parameterized_forward_class_first
source: class %0 previously declared with type parameters
root: class {$arg0} previously declared with type parameters

# err_objc_precise_lifetime_bad_type
source: objc_precise_lifetime only applies to retainable types; type here is %0
root: objc_precise_lifetime only applies to retainable types; type here is {$arg0}

# err_objc_property_attr_mutually_exclusive
source: property attributes '%0' and '%1' are mutually exclusive
root: property attributes '{$arg0}' and '{$arg1}' are mutually exclusive

# err_objc_property_requires_object
source: property with '%0' attribute must be of object type
root: property with '{$arg0}' attribute must be of object type

# err_objc_runtime_visible_category
source: cannot implement a category for class %0 that is only visible via the Objective-C runtime
root: cannot implement a category for class {$arg0} that is only visible via the Objective-C runtime

# err_objc_runtime_visible_subclass
source: cannot implement subclass %0 of a superclass %1 that is only visible via the Objective-C runtime
root: cannot implement subclass {$arg0} of a superclass {$arg1} that is only visible via the Objective-C runtime

# err_objc_subscript_base_type
source: %select{dictionary|array}1 subscript base type %0 is not an Objective-C object
root: {$arg1 :select s0=|dictionary| s1=|array|} subscript base type {$arg0} is not an Objective-C object
