Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# err_overflow_builtin_must_be_int
source: operand argument to %select{overflow builtin|checked integer operation}0 must be an integer type %select{|other than plain 'char', 'bool', bit-precise, or an enumeration }0(%1 invalid)
root: operand argument to {$arg0 :select s0=|overflow builtin| s1=|checked integer operation|} must be an integer type {$arg0 :select s0=|| s1=|other than plain 'char', 'bool', bit-precise, or an enumeration |}({$arg1} invalid)

# err_overflow_builtin_must_be_ptr_int
source: result argument to %select{overflow builtin|checked integer operation}0 must be a pointer to a non-const integer type %select{|other than plain 'char', 'bool', bit-precise, or an enumeration }0(%1 invalid)
root: result argument to {$arg0 :select s0=|overflow builtin| s1=|checked integer operation|} must be a pointer to a non-const integer type {$arg0 :select s0=|| s1=|other than plain 'char', 'bool', bit-precise, or an enumeration |}({$arg1} invalid)

# err_ovl_ambiguous_call
source: call to %0 is ambiguous
root: call to {$arg0} is ambiguous

# err_ovl_ambiguous_conversion_in_cast
source: ambiguous conversion for %select{|static_cast|reinterpret_cast|dynamic_cast|C-style cast|functional-style cast|}0 from %1 to %2
root: ambiguous conversion for {$arg0 :select s0=|| s1=|static_cast| s2=|reinterpret_cast| s3=|dynamic_cast| s4=|C-style cast| s5=|functional-style cast| s6=||} from {$arg1} to {$arg2}

# err_ovl_ambiguous_init
source: call to constructor of %0 is ambiguous
root: call to constructor of {$arg0} is ambiguous

# err_ovl_ambiguous_member_call
source: call to member function %0 is ambiguous
root: call to member function {$arg0} is ambiguous

# err_ovl_ambiguous_object_call
source: call to object of type %0 is ambiguous
root: call to object of type {$arg0} is ambiguous

# err_ovl_ambiguous_oper_binary
source: use of overloaded operator '%0' is ambiguous (with operand types %1 and %2)
root: use of overloaded operator '{$arg0}' is ambiguous (with operand types {$arg1} and {$arg2})

# err_ovl_ambiguous_oper_unary
source: use of overloaded operator '%0' is ambiguous (operand type %1)
root: use of overloaded operator '{$arg0}' is ambiguous (operand type {$arg1})

# err_ovl_ambiguous_subscript_call
source: call to subscript operator of type %0 is ambiguous
root: call to subscript operator of type {$arg0} is ambiguous

# err_ovl_deleted_call
source: call to deleted%select{| member}0 function %1%select{|: %3}2
root: call to deleted{$arg0 :select s0=|| s1=| member|} function {$arg1}{$arg2 :select s0=|| s1=|: {$arg3}|}

# err_ovl_deleted_comparison
source: object of type %0 cannot be compared because its %1 is implicitly deleted
root: object of type {$arg0} cannot be compared because its {$arg1} is implicitly deleted

# err_ovl_deleted_conversion_in_cast
source: %select{|static_cast|reinterpret_cast|dynamic_cast|C-style cast|functional-style cast|}0 from %1 to %2 uses deleted function%select{|: %4}3
root: {$arg0 :select s0=|| s1=|static_cast| s2=|reinterpret_cast| s3=|dynamic_cast| s4=|C-style cast| s5=|functional-style cast| s6=||} from {$arg1} to {$arg2} uses deleted function{$arg3 :select s0=|| s1=|: {$arg4}|}

# err_ovl_deleted_init
source: call to deleted constructor of %0%select{|: %2}1
root: call to deleted constructor of {$arg0}{$arg1 :select s0=|| s1=|: {$arg2}|}

# err_ovl_deleted_object_call
source: call to deleted function call operator in type %0%select{|: %2}1
root: call to deleted function call operator in type {$arg0}{$arg1 :select s0=|| s1=|: {$arg2}|}

# err_ovl_deleted_oper
source: overload resolution selected deleted operator '%0'%select{|: %2}1
root: overload resolution selected deleted operator '{$arg0}'{$arg1 :select s0=|| s1=|: {$arg2}|}

# err_ovl_deleted_special_init
source: call to implicitly-deleted %select{default constructor|copy constructor|move constructor|copy assignment operator|move assignment operator|destructor|function}0 of %1
root: call to implicitly-deleted {$arg0 :select s0=|default constructor| s1=|copy constructor| s2=|move constructor| s3=|copy assignment operator| s4=|move assignment operator| s5=|destructor| s6=|function|} of {$arg1}

# err_ovl_deleted_special_oper
source: object of type %0 cannot be %select{constructed|copied|moved|assigned|assigned|destroyed}1 because its %select{default constructor|copy constructor|move constructor|copy assignment operator|move assignment operator|destructor}1 is implicitly deleted
root: object of type {$arg0} cannot be {$arg1 :select s0=|constructed| s1=|copied| s2=|moved| s3=|assigned| s4=|assigned| s5=|destroyed|} because its {$arg1 :select s0=|default constructor| s1=|copy constructor| s2=|move constructor| s3=|copy assignment operator| s4=|move assignment operator| s5=|destructor|} is implicitly deleted

# err_ovl_no_conversion_in_cast
source: cannot convert %1 to %2 without a conversion operator
root: cannot convert {$arg1} to {$arg2} without a conversion operator

# err_ovl_no_oper
source: type %0 does not provide a %select{subscript|call}1 operator
root: type {$arg0} does not provide a {$arg1 :select s0=|subscript| s1=|call|} operator

# err_ovl_no_viable_conversion_in_cast
source: no matching conversion for %select{|static_cast|reinterpret_cast|dynamic_cast|C-style cast|functional-style cast|}0 from %1 to %2
root: no matching conversion for {$arg0 :select s0=|| s1=|static_cast| s2=|reinterpret_cast| s3=|dynamic_cast| s4=|C-style cast| s5=|functional-style cast| s6=||} from {$arg1} to {$arg2}

# err_ovl_no_viable_function_in_call
source: no matching function for call to %0
root: no matching function for call to {$arg0}

# err_ovl_no_viable_function_in_init
source: no matching constructor for initialization of %0
root: no matching constructor for initialization of {$arg0}

# err_ovl_no_viable_literal_operator
source: no matching literal operator for call to %0%select{| with argument of type %2| with arguments of types %2 and %3}1%select{| or 'const char *'}4%select{|, and no matching literal operator template}5
root: no matching literal operator for call to {$arg0}{$arg1 :select s0=|| s1=| with argument of type {$arg2}| s2=| with arguments of types {$arg2} and {$arg3}|}{$arg4 :select s0=|| s1=| or 'const char *'|}{$arg5 :select s0=|| s1=|, and no matching literal operator template|}

# err_ovl_no_viable_member_function_in_call
source: no matching member function for call to %0
root: no matching member function for call to {$arg0}

# err_ovl_no_viable_object_call
source: no matching function for call to object of type %0
root: no matching function for call to object of type {$arg0}

# err_ovl_no_viable_oper
source: no viable overloaded '%0'
root: no viable overloaded '{$arg0}'

# err_ovl_no_viable_subscript
source: no viable overloaded operator[] for type %0
root: no viable overloaded operator[] for type {$arg0}

# err_ovl_rewrite_equalequal_not_bool
source: return type %0 of selected 'operator==' function for rewritten '%1' comparison is not 'bool'
root: return type {$arg0} of selected 'operator==' function for rewritten '{$arg1}' comparison is not 'bool'

# err_ovl_unresolvable
source: reference to %select{overloaded|multiversioned}1 function could not be resolved; did you mean to call it%select{| with no arguments}0?
root: reference to {$arg1 :select s0=|overloaded| s1=|multiversioned|} function could not be resolved; did you mean to call it{$arg0 :select s0=|| s1=| with no arguments|}?

# err_ownership_returns_index_mismatch
source: 'ownership_returns' attribute index does not match; here it is %0
root: 'ownership_returns' attribute index does not match; here it is {$arg0}

# err_ownership_takes_class_mismatch
source: 'ownership_takes' attribute class does not match; here it is '%0'
root: 'ownership_takes' attribute class does not match; here it is '{$arg0}'

# err_ownership_type
source: %0 attribute only applies to %select{pointer|integer}1 arguments
root: {$arg0} attribute only applies to {$arg1 :select s0=|pointer| s1=|integer|} arguments

# err_pack_expansion_length_conflict_partial
source: pack expansion contains parameter pack %0 that has a different length (at least %1 vs. %2) from outer parameter packs
root: pack expansion contains parameter pack {$arg0} that has a different length (at least {$arg1} vs. {$arg2}) from outer parameter packs

# err_pack_expansion_member_init
source: pack expansion for initialization of member %0
root: pack expansion for initialization of member {$arg0}

# err_pack_index_out_of_bound
source: invalid index %0 for pack %1 of size %2
root: invalid index {$arg0} for pack {$arg1} of size {$arg2}

# err_param_default_argument_member_template_redecl
source: default arguments cannot be added to an out-of-line definition of a member of a %select{class template|class template partial specialization|nested class in a template}0
root: default arguments cannot be added to an out-of-line definition of a member of a {$arg0 :select s0=|class template| s1=|class template partial specialization| s2=|nested class in a template|}

# err_param_default_argument_missing_name
source: missing default argument on parameter %0
root: missing default argument on parameter {$arg0}

# err_param_default_argument_references_local
source: default argument references local variable %0 of enclosing function
root: default argument references local variable {$arg0} of enclosing function

# err_param_default_argument_references_param
source: default argument references parameter %0
root: default argument references parameter {$arg0}

# err_parameters_retval_cannot_have_fp16_type
source: %select{parameters|function return value}0 cannot have __fp16 type; did you forget * ?
root: {$arg0 :select s0=|parameters| s1=|function return value|} cannot have __fp16 type; did you forget * ?

# err_partial_spec_args_match_primary_template
source: %select{class|variable}0 template partial specialization does not specialize any template argument; to %select{declare|define}1 the primary template, remove the template argument list
root: {$arg0 :select s0=|class| s1=|variable|} template partial specialization does not specialize any template argument; to {$arg1 :select s0=|declare| s1=|define|} the primary template, remove the template argument list

# err_partial_spec_fully_specialized
source: partial specialization of %0 does not use any of its template parameters
root: partial specialization of {$arg0} does not use any of its template parameters

# err_partial_spec_ordering_ambiguous
source: ambiguous partial specializations of %0
root: ambiguous partial specializations of {$arg0}

# err_partial_spec_redeclared
source: class template partial specialization %0 cannot be redeclared
root: class template partial specialization {$arg0} cannot be redeclared

# err_placeholder_constraints_not_satisfied
source: deduced type %0 does not satisfy %1
root: deduced type {$arg0} does not satisfy {$arg1}

# err_pointer_to_member_call_drops_quals
source: call to pointer to member function of type %0 drops '%1' qualifier%s2
root: call to pointer to member function of type {$arg0} drops '{$arg1}' qualifier%s2

# err_pointer_to_member_oper_value_classify
source: pointer-to-member function type %0 can only be called on an %select{rvalue|lvalue}1
root: pointer-to-member function type {$arg0} can only be called on an {$arg1 :select s0=|rvalue| s1=|lvalue|}

# err_pointer_to_member_type
source: invalid use of pointer to member type after %select{.*|->*}0
root: invalid use of pointer to member type after {$arg0 :select s0=|.*| s1=|->*|}

# err_ppc_builtin_requires_abi
source: this builtin requires ABI -mabi=%0
root: this builtin requires ABI -mabi={$arg0}

# err_pragma_attribute_matcher_negated_subrule_contradicts_subrule
source: negated attribute subject matcher sub-rule '%0' contradicts sub-rule '%1'
root: negated attribute subject matcher sub-rule '{$arg0}' contradicts sub-rule '{$arg1}'

# err_pragma_attribute_matcher_subrule_contradicts_rule
source: redundant attribute subject matcher sub-rule '%0'; '%1' already matches those declarations
root: redundant attribute subject matcher sub-rule '{$arg0}'; '{$arg1}' already matches those declarations

# err_pragma_attribute_stack_mismatch
source: '#pragma clang attribute %select{%1.|}0pop' with no matching '#pragma clang attribute %select{%1.|}0push'
root: '#pragma clang attribute {$arg0 :select s0=|{$arg1}.| s1=||}pop' with no matching '#pragma clang attribute {$arg0 :select s0=|{$arg1}.| s1=||}push'

# err_pragma_expected_file_scope
source: '#pragma %0' can only appear at file scope
root: '#pragma {$arg0}' can only appear at file scope

# err_pragma_loop_compatibility
source: %select{incompatible|duplicate}0 directives '%1' and '%2'
root: {$arg0 :select s0=|incompatible| s1=|duplicate|} directives '{$arg1}' and '{$arg2}'

# err_pragma_loop_invalid_argument_type
source: invalid argument of type %0; expected an integer type
root: invalid argument of type {$arg0}; expected an integer type

# err_pragma_loop_precedes_nonloop
source: expected a for, while, or do-while loop to follow '%0'
root: expected a for, while, or do-while loop to follow '{$arg0}'

# err_pragma_section_invalid_for_target
source: argument to #pragma section is not valid for this target: %0
root: argument to #pragma section is not valid for this target: {$arg0}

# err_preserve_enum_value_invalid
source: __builtin_preserve_enum_value argument %0 invalid
root: __builtin_preserve_enum_value argument {$arg0} invalid

# err_preserve_enum_value_not_const
source: __builtin_preserve_enum_value argument %0 not a constant
root: __builtin_preserve_enum_value argument {$arg0} not a constant

# err_preserve_field_info_not_const
source: __builtin_preserve_field_info argument %0 not a constant
root: __builtin_preserve_field_info argument {$arg0} not a constant

# err_preserve_field_info_not_field
source: __builtin_preserve_field_info argument %0 not a field access
root: __builtin_preserve_field_info argument {$arg0} not a field access

# err_preserve_type_info_invalid
source: __builtin_preserve_type_info argument %0 invalid
root: __builtin_preserve_type_info argument {$arg0} invalid

# err_preserve_type_info_not_const
source: __builtin_preserve_type_info argument %0 not a constant
root: __builtin_preserve_type_info argument {$arg0} not a constant

# err_private_ivar_access
source: instance variable %0 is private
root: instance variable {$arg0} is private

# err_property_accessor_type
source: type of property %0 (%1) does not match type of accessor %2 (%3)
root: type of property {$arg0} ({$arg1}) does not match type of accessor {$arg2} ({$arg3})

# err_property_found_suggest
source: property %0 found on object of type %1; did you mean to access it with the "." operator?
root: property {$arg0} found on object of type {$arg1}; did you mean to access it with the "." operator?

# err_property_implemented
source: property %0 is already implemented
root: property {$arg0} is already implemented

# err_property_is_variably_modified
source: property %0 has a variably modified type
root: property {$arg0} has a variably modified type

# err_property_ivar_type
source: type of property %0 (%1) does not match type of instance variable %2 (%3)
root: type of property {$arg0} ({$arg1}) does not match type of instance variable {$arg2} ({$arg3})

# err_property_method_unavailable
source: property access is using %0 method which is unavailable
root: property access is using {$arg0} method which is unavailable

# err_property_not_as_forward_class
source: property %0 refers to an incomplete Objective-C class %1 (with no @interface available)
root: property {$arg0} refers to an incomplete Objective-C class {$arg1} (with no @interface available)

# err_property_not_found
source: property %0 not found on object of type %1
root: property {$arg0} not found on object of type {$arg1}

# err_property_not_found_forward_class
source: property %0 cannot be found in forward class object %1
root: property {$arg0} cannot be found in forward class object {$arg1}

# err_property_not_found_suggest
source: property %0 not found on object of type %1; did you mean %2?
root: property {$arg0} not found on object of type {$arg1}; did you mean {$arg2}?

# err_property_setter_ambiguous_use
source: synthesized properties %0 and %1 both claim setter %2 - use of this setter will cause unexpected behavior
root: synthesized properties {$arg0} and {$arg1} both claim setter {$arg2} - use of this setter will cause unexpected behavior

# err_property_type
source: property cannot have array or function type %0
root: property cannot have array or function type {$arg0}

# err_protected_ivar_access
source: instance variable %0 is protected
root: instance variable {$arg0} is protected

# err_protocol_property_mismatch
source: property %select{of type %1|with attribute '%1'|without attribute '%1'|with getter %1|with setter %1}0 was selected for synthesis
root: property {$arg0 :select s0=|of type {$arg1}| s1=|with attribute '{$arg1}'| s2=|without attribute '{$arg1}'| s3=|with getter {$arg1}| s4=|with setter {$arg1}|} was selected for synthesis

# err_pseudo_dtor_base_not_scalar
source: object expression of non-scalar type %0 cannot be used in a pseudo-destructor expression
root: object expression of non-scalar type {$arg0} cannot be used in a pseudo-destructor expression

# err_pseudo_dtor_destructor_non_type
source: %0 does not refer to a type name in pseudo-destructor expression; expected the name of type %1
root: {$arg0} does not refer to a type name in pseudo-destructor expression; expected the name of type {$arg1}

# err_ptrauth_address_discrimination_invalid
source: invalid address discrimination flag '%0'; '__ptrauth' requires '0' or '1'
root: invalid address discrimination flag '{$arg0}'; '__ptrauth' requires '0' or '1'

# err_ptrauth_extra_discriminator_invalid
source: invalid extra discriminator flag '%0'; '__ptrauth' requires a value between '0' and '%1'
root: invalid extra discriminator flag '{$arg0}'; '__ptrauth' requires a value between '0' and '{$arg1}'

# err_ptrauth_indirect_goto_addrlabel_arithmetic
source: %select{subtraction|addition}0 of address-of-label expressions is not supported with ptrauth indirect gotos
root: {$arg0 :select s0=|subtraction| s1=|addition|} of address-of-label expressions is not supported with ptrauth indirect gotos

# err_ptrauth_invalid_key
source: %0 does not identify a valid pointer authentication key for the current target
root: {$arg0} does not identify a valid pointer authentication key for the current target

# err_ptrauth_qualifier_cast
source: cannot cast to '__ptrauth'-qualified type %0
root: cannot cast to '__ptrauth'-qualified type {$arg0}

# err_ptrauth_qualifier_invalid
source: %select{return type|parameter type|property}1 may not be qualified with '__ptrauth'; type is %0
root: {$arg1 :select s0=|return type| s1=|parameter type| s2=|property|} may not be qualified with '__ptrauth'; type is {$arg0}

# err_ptrauth_qualifier_invalid_target
source: '__ptrauth' qualifier only applies to pointer or pointer sized integer types; %0 is invalid
root: '__ptrauth' qualifier only applies to pointer or pointer sized integer types; {$arg0} is invalid

# err_ptrauth_qualifier_redundant
source: type %0 is already '__ptrauth'-qualified
root: type {$arg0} is already '__ptrauth'-qualified

# err_ptrauth_string_not_literal
source: argument must be a string literal%select{| of char type}0
root: argument must be a string literal{$arg0 :select s0=|| s1=| of char type|}

# err_ptrauth_type_disc_undiscriminated
source: cannot pass undiscriminated type %0 to '__builtin_ptrauth_type_discriminator'
root: cannot pass undiscriminated type {$arg0} to '__builtin_ptrauth_type_discriminator'

# err_ptrauth_value_bad_type
source: %select{signed value|extra discriminator|blended pointer|blended integer}0 must have %select{pointer|integer|pointer or integer}1 type; type here is %2
root: {$arg0 :select s0=|signed value| s1=|extra discriminator| s2=|blended pointer| s3=|blended integer|} must have {$arg1 :select s0=|pointer| s1=|integer| s2=|pointer or integer|} type; type here is {$arg2}

# err_qualified_friend_no_match
source: friend declaration of %0 does not match any declaration in %1
root: friend declaration of {$arg0} does not match any declaration in {$arg1}

# err_qualified_function_typeid
source: type operand %0 of 'typeid' cannot have '%1' qualifier
root: type operand {$arg0} of 'typeid' cannot have '{$arg1}' qualifier

# err_qualified_member_nonclass
source: qualified member access refers to a member in %0
root: qualified member access refers to a member in {$arg0}

# err_qualified_member_of_unrelated
source: %q0 is not a member of class %1
root: {$arg0 :q} is not a member of class {$arg1}

# err_range_on_array_parameter
source: cannot build range expression with array function parameter %0 since parameter with array type %1 is treated as pointer type %2
root: cannot build range expression with array function parameter {$arg0} since parameter with array type {$arg1} is treated as pointer type {$arg2}

# err_realimag_invalid_type
source: invalid type %0 to %1 operator
root: invalid type {$arg0} to {$arg1} operator

# err_record_with_pointers_kernel_param
source: %select{struct|union}0 kernel parameters may not contain pointers
root: {$arg0 :select s0=|struct| s1=|union|} kernel parameters may not contain pointers

# err_recursive_superclass
source: trying to recursively use %0 as superclass of %1
root: trying to recursively use {$arg0} as superclass of {$arg1}

# err_redeclaration_different_type
source: redeclaration of %0 with a different type%diff{: $ vs $|}1,2
root: redeclaration of {$arg0} with a different type%diff{: $ vs $|}1,2

# err_redeclaration_non_exported
source: cannot export redeclaration %0 here since the previous declaration %select{is not exported|has internal linkage|has module linkage}1
root: cannot export redeclaration {$arg0} here since the previous declaration {$arg1 :select s0=|is not exported| s1=|has internal linkage| s2=|has module linkage|}

# err_redefinition
source: redefinition of %0
root: redefinition of {$arg0}

# err_redefinition_different_concept
source: redefinition of concept %0 with different template parameters or requirements
root: redefinition of concept {$arg0} with different template parameters or requirements

# err_redefinition_different_kind
source: redefinition of %0 as different kind of symbol
root: redefinition of {$arg0} as different kind of symbol

# err_redefinition_different_namespace_alias
source: redefinition of %0 as an alias for a different namespace
root: redefinition of {$arg0} as an alias for a different namespace

# err_redefinition_different_type
source: redefinition of %0 with a different type%diff{: $ vs $|}1,2
root: redefinition of {$arg0} with a different type%diff{: $ vs $|}1,2

# err_redefinition_different_typedef
source: %select{typedef|type alias|type alias template}0 redefinition with different types%diff{ ($ vs $)|}1,2
root: {$arg0 :select s0=|typedef| s1=|type alias| s2=|type alias template|} redefinition with different types%diff{ ($ vs $)|}1,2

# err_redefinition_extern_inline
source: redefinition of a 'extern inline' function %0 is not supported in %select{C99 mode|C++}1
root: redefinition of a 'extern inline' function {$arg0} is not supported in {$arg1 :select s0=|C99 mode| s1=|C++|}

# err_redefinition_of_enumerator
source: redefinition of enumerator %0
root: redefinition of enumerator {$arg0}

# err_redefinition_of_label
source: redefinition of label %0
root: redefinition of label {$arg0}

# err_redefinition_variably_modified_typedef
source: redefinition of %select{typedef|type alias}0 for variably-modified type %1
root: redefinition of {$arg0 :select s0=|typedef| s1=|type alias|} for variably-modified type {$arg1}
