Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# err_omp_ordered_directive_with_param
source: 'ordered' directive %select{without any clauses|with 'threads' clause}0 cannot be closely nested inside ordered region with specified parameter
root: 'ordered' directive {$arg0 :select s0=|without any clauses| s1=|with 'threads' clause|} cannot be closely nested inside ordered region with specified parameter

# err_omp_ordered_directive_without_param
source: 'ordered' directive with '%0' clause cannot be closely nested inside ordered region without specified parameter
root: 'ordered' directive with '{$arg0}' clause cannot be closely nested inside ordered region without specified parameter

# err_omp_orphaned_device_directive
source: orphaned 'omp %0' directives are prohibited; perhaps you forget to enclose the directive into a %select{|||target |teams|for, simd, for simd, parallel for, or parallel for simd }1region?
root: orphaned 'omp {$arg0}' directives are prohibited; perhaps you forget to enclose the directive into a {$arg1 :select s0=|| s1=|| s2=|| s3=|target | s4=|teams| s5=|for, simd, for simd, parallel for, or parallel for simd |}region?

# err_omp_orphaned_section_directive
source: %select{orphaned 'omp section' directives are prohibited, it|'omp section' directive}0 must be closely nested to a sections region%select{|, not a %1 region}0
root: {$arg0 :select s0=|orphaned 'omp section' directives are prohibited, it| s1=|'omp section' directive|} must be closely nested to a sections region{$arg0 :select s0=|| s1=|, not a {$arg1} region|}

# err_omp_parallel_reduction_in_task_firstprivate
source: argument of a reduction clause of a %0 construct must not appear in a firstprivate clause on a task construct
root: argument of a reduction clause of a {$arg0} construct must not appear in a firstprivate clause on a task construct

# err_omp_param_or_this_in_clause
source: expected reference to one of the parameters of function %0%select{| or 'this'}1
root: expected reference to one of the parameters of function {$arg0}{$arg1 :select s0=|| s1=| or 'this'|}

# err_omp_parent_cancel_region_nowait
source: parent region for 'omp %select{cancellation point|cancel}0' construct cannot be nowait
root: parent region for 'omp {$arg0 :select s0=|cancellation point| s1=|cancel|}' construct cannot be nowait

# err_omp_parent_cancel_region_ordered
source: parent region for 'omp %select{cancellation point|cancel}0' construct cannot be ordered
root: parent region for 'omp {$arg0 :select s0=|cancellation point| s1=|cancel|}' construct cannot be ordered

# err_omp_private_incomplete_type
source: a private variable with incomplete type %0
root: a private variable with incomplete type {$arg0}

# err_omp_prohibited_region
source: region cannot be%select{| closely}0 nested inside '%1' region%select{|; perhaps you forget to enclose 'omp %3' directive into a parallel region?|; perhaps you forget to enclose 'omp %3' directive into a for or a parallel for region with 'ordered' clause?|; perhaps you forget to enclose 'omp %3' directive into a target region?|; perhaps you forget to enclose 'omp %3' directive into a teams region?|; perhaps you forget to enclose 'omp %3' directive into a for, simd, for simd, parallel for, or parallel for simd region?}2
root: region cannot be{$arg0 :select s0=|| s1=| closely|} nested inside '{$arg1}' region{$arg2 :select s0=|| s1=|; perhaps you forget to enclose 'omp {$arg3}' directive into a parallel region?| s2=|; perhaps you forget to enclose 'omp {$arg3}' directive into a for or a parallel for region with 'ordered' clause?| s3=|; perhaps you forget to enclose 'omp {$arg3}' directive into a target region?| s4=|; perhaps you forget to enclose 'omp {$arg3}' directive into a teams region?| s5=|; perhaps you forget to enclose 'omp {$arg3}' directive into a for, simd, for simd, parallel for, or parallel for simd region?|}

# err_omp_prohibited_region_critical_same_name
source: cannot nest 'critical' regions having the same name %0
root: cannot nest 'critical' regions having the same name {$arg0}

# err_omp_prohibited_region_order
source: construct '%0' not allowed in a region associated with a directive with 'order' clause
root: construct '{$arg0}' not allowed in a region associated with a directive with 'order' clause

# err_omp_prohibited_region_simd
source: OpenMP constructs may not be nested inside a simd region%select{| except for ordered simd, simd, scan, or atomic directive}0
root: OpenMP constructs may not be nested inside a simd region{$arg0 :select s0=|| s1=| except for ordered simd, simd, scan, or atomic directive|}

# err_omp_reduction_id_not_compatible
source: list item of type %0 is not valid for specified reduction operation: unable to provide default initialization value
root: list item of type {$arg0} is not valid for specified reduction operation: unable to provide default initialization value

# err_omp_reduction_incomplete_type
source: a reduction list item with incomplete type %0
root: a reduction list item with incomplete type {$arg0}

# err_omp_reduction_ref_type_arg
source: argument of OpenMP clause '%0' must reference the same object in all threads
root: argument of OpenMP clause '{$arg0}' must reference the same object in all threads

# err_omp_reduction_vla_unsupported
source: cannot generate code for reduction on %select{|array section, which requires a }0variable length array
root: cannot generate code for reduction on {$arg0 :select s0=|| s1=|array section, which requires a |}variable length array

# err_omp_reduction_wrong_type
source: reduction type cannot be %select{qualified with 'const', 'volatile' or 'restrict'|a function|a reference|an array}0 type
root: reduction type cannot be {$arg0 :select s0=|qualified with 'const', 'volatile' or 'restrict'| s1=|a function| s2=|a reference| s3=|an array|} type

# err_omp_ref_type_arg
source: arguments of '#pragma omp %0' cannot be of reference type %1
root: arguments of '#pragma omp {$arg0}' cannot be of reference type {$arg1}

# err_omp_required_access
source: %0 variable must be %1
root: {$arg0} variable must be {$arg1}

# err_omp_requires_clause_redeclaration
source: only one %0 clause can appear on a requires directive in a single translation unit
root: only one {$arg0} clause can appear on a requires directive in a single translation unit

# err_omp_section_function_type
source: section of pointer to function type %0
root: section of pointer to function type {$arg0}

# err_omp_section_incomplete_type
source: section of pointer to incomplete type %0
root: section of pointer to incomplete type {$arg0}

# err_omp_section_length_negative
source: section length is evaluated to a negative value %0
root: section length is evaluated to a negative value {$arg0}

# err_omp_section_length_undefined
source: section length is unspecified and cannot be inferred because subscripted value is %select{not an array|an array of unknown bound}0
root: section length is unspecified and cannot be inferred because subscripted value is {$arg0 :select s0=|not an array| s1=|an array of unknown bound|}

# err_omp_section_stride_non_positive
source: section stride is evaluated to a non-positive value %0
root: section stride is evaluated to a non-positive value {$arg0}

# err_omp_sections_not_compound_stmt
source: the statement for '#pragma omp %0' must be a compound statement
root: the statement for '#pragma omp {$arg0}' must be a compound statement

# err_omp_sections_substmt_not_section
source: statement in 'omp %0' directive must be enclosed into a section region
root: statement in 'omp {$arg0}' directive must be enclosed into a section region

# err_omp_several_directives_in_region
source: exactly one '%0' directive must appear in the loop body of an enclosing directive
root: exactly one '{$arg0}' directive must appear in the loop body of an enclosing directive

# err_omp_shaping_dimension_not_positive
source: array shaping dimension is evaluated to a non-positive value %0
root: array shaping dimension is evaluated to a non-positive value {$arg0}

# err_omp_simd_region_cannot_use_stmt
source: '%0' statement cannot be used in OpenMP simd region
root: '{$arg0}' statement cannot be used in OpenMP simd region

# err_omp_simple_clause_incompatible_with_ordered
source: '%0' clause with '%1' modifier cannot be specified if an 'ordered' clause is specified
root: '{$arg0}' clause with '{$arg1}' modifier cannot be specified if an 'ordered' clause is specified

# err_omp_single_decl_in_declare_simd_variant
source: single declaration is expected after 'declare %select{simd|variant}0' directive
root: single declaration is expected after 'declare {$arg0 :select s0=|simd| s1=|variant|}' directive

# err_omp_sink_and_source_not_allowed
source: '%0(%select{source|sink:vec}1)' clause%select{|s}1 cannot be mixed with '%0(%select{sink:vec|source}1)' clause%select{s|}1
root: '{$arg0}({$arg1 :select s0=|source| s1=|sink:vec|})' clause{$arg1 :select s0=|| s1=|s|} cannot be mixed with '{$arg0}({$arg1 :select s0=|sink:vec| s1=|source|})' clause{$arg1 :select s0=|s| s1=||}

# err_omp_stmt_depends_on_loop_counter
source: the loop %select{initializer|condition}0 expression depends on the current loop control variable
root: the loop {$arg0 :select s0=|initializer| s1=|condition|} expression depends on the current loop control variable

# err_omp_threadprivate_in_clause
source: threadprivate variables are not allowed in '%0' clause
root: threadprivate variables are not allowed in '{$arg0}' clause

# err_omp_threadprivate_incomplete_type
source: threadprivate variable with incomplete type %0
root: threadprivate variable with incomplete type {$arg0}

# err_omp_typecheck_section_not_integer
source: array section %select{lower bound|length}0 is not an integer
root: array section {$arg0 :select s0=|lower bound| s1=|length|} is not an integer

# err_omp_unexpected_clause_value
source: expected %0 in OpenMP clause '%1'
root: expected {$arg0} in OpenMP clause '{$arg1}'

# err_omp_unexpected_schedule_modifier
source: modifier '%0' cannot be used along with modifier '%1'
root: modifier '{$arg0}' cannot be used along with modifier '{$arg1}'

# err_omp_unknown_reduction_identifier_prior_omp_6_0
source: incorrect reduction identifier, expected one of '+', '-', '*', '&', '|', '^', '&&', '||', 'min' or 'max' or declare reduction for type %0
root: incorrect reduction identifier, expected one of '+', '-', '*', '&', '|', '^', '&&', '||', 'min' or 'max' or declare reduction for type {$arg0}

# err_omp_unknown_reduction_identifier_since_omp_6_0
source: incorrect reduction identifier, expected one of '+', '*', '&', '|', '^', '&&', '||', 'min' or 'max' or declare reduction for type %0
root: incorrect reduction identifier, expected one of '+', '*', '&', '|', '^', '&&', '||', 'min' or 'max' or declare reduction for type {$arg0}

# err_omp_unnamed_if_clause
source: expected%select{| one of}0 %1 directive name modifier%select{|s}0
root: expected{$arg0 :select s0=|| s1=| one of|} {$arg1} directive name modifier{$arg0 :select s0=|| s1=|s|}

# err_omp_used_in_clause_twice
source: %select{a variable|a parameter|'this'}0 cannot appear in more than one %1 clause
root: {$arg0 :select s0=|a variable| s1=|a parameter| s2=|'this'|} cannot appear in more than one {$arg1} clause

# err_omp_var_expected
source: expected variable of the '%0' type%select{|, not %2}1
root: expected variable of the '{$arg0}' type{$arg1 :select s0=|| s1=|, not {$arg2}|}

# err_omp_var_scope
source: '#pragma omp %0' must appear in the scope of the %q1 variable declaration
root: '#pragma omp {$arg0}' must appear in the scope of the {$arg1 :q} variable declaration

# err_omp_var_thread_local
source: variable %0 cannot be threadprivate because it is %select{thread-local|a global named register variable}1
root: variable {$arg0} cannot be threadprivate because it is {$arg1 :select s0=|thread-local| s1=|a global named register variable|}

# err_omp_var_used
source: '#pragma omp %0' must precede all references to variable %q1
root: '#pragma omp {$arg0}' must precede all references to variable {$arg1 :q}

# err_omp_variable_in_given_clause_and_dsa
source: %0 variable cannot be in a %1 clause in '#pragma omp %2' directive
root: {$arg0} variable cannot be in a {$arg1} clause in '#pragma omp {$arg2}' directive

# err_omp_variably_modified_type_not_supported
source: arguments of OpenMP clause '%0' in '#pragma omp %2' directive cannot be of variably-modified type %1
root: arguments of OpenMP clause '{$arg0}' in '#pragma omp {$arg2}' directive cannot be of variably-modified type {$arg1}

# err_omp_wrong_dependency_iterator_type
source: expected an integer or a pointer type of the outer loop counter '%0' for non-rectangular nests
root: expected an integer or a pointer type of the outer loop counter '{$arg0}' for non-rectangular nests

# err_omp_wrong_device_function_call
source: function with 'device_type(%0)' is not available on %select{device|host}1
root: function with 'device_type({$arg0})' is not available on {$arg1 :select s0=|device| s1=|host|}

# err_omp_wrong_dsa
source: %0 variable cannot be %1
root: {$arg0} variable cannot be {$arg1}

# err_omp_wrong_if_directive_name_modifier
source: directive name modifier '%0' is not allowed for '#pragma omp %1'
root: directive name modifier '{$arg0}' is not allowed for '#pragma omp {$arg1}'

# err_omp_wrong_linear_modifier
source: expected %select{'val' modifier|one of 'ref', val' or 'uval' modifiers}0
root: expected {$arg0 :select s0=|'val' modifier| s1=|one of 'ref', val' or 'uval' modifiers|}

# err_omp_wrong_linear_modifier_non_reference
source: variable of non-reference type %0 can be used only with 'val' modifier, but used with '%1'
root: variable of non-reference type {$arg0} can be used only with 'val' modifier, but used with '{$arg1}'

# err_omp_wrong_var_in_declare_reduction
source: only %select{'omp_priv' or 'omp_orig'|'omp_in' or 'omp_out'}0 variables are allowed in %select{initializer|combiner}0 expression
root: only {$arg0 :select s0=|'omp_priv' or 'omp_orig'| s1=|'omp_in' or 'omp_out'|} variables are allowed in {$arg0 :select s0=|initializer| s1=|combiner|} expression

# err_ompx_more_than_three_expr_not_allowed
source: at most three expressions are allowed in '%0' clause in 'target teams ompx_bare' construct
root: at most three expressions are allowed in '{$arg0}' clause in 'target teams ompx_bare' construct

# err_opencl_addrspace_scope
source: variables in the %0 address space can only be declared in the outermost scope of a kernel function
root: variables in the {$arg0} address space can only be declared in the outermost scope of a kernel function

# err_opencl_atomic_init
source: atomic variable can be %select{assigned|initialized}0 to a variable only in global address space
root: atomic variable can be {$arg0 :select s0=|assigned| s1=|initialized|} to a variable only in global address space

# err_opencl_builtin_expected_type
source: illegal call to %0, expected %1 argument type
root: illegal call to {$arg0}, expected {$arg1} argument type

# err_opencl_builtin_pipe_arg_num
source: invalid number of arguments to function: %0
root: invalid number of arguments to function: {$arg0}

# err_opencl_builtin_pipe_first_arg
source: first argument to %0 must be a pipe type
root: first argument to {$arg0} must be a pipe type

# err_opencl_builtin_pipe_invalid_access_modifier
source: invalid pipe access modifier (expecting %0)
root: invalid pipe access modifier (expecting {$arg0})

# err_opencl_builtin_pipe_invalid_arg
source: invalid argument type to function %0 (expecting %1 having %2)
root: invalid argument type to function {$arg0} (expecting {$arg1} having {$arg2})

# err_opencl_builtin_to_addr_invalid_arg
source: invalid argument %0 to function: %1, expecting a generic pointer argument
root: invalid argument {$arg0} to function: {$arg1}, expecting a generic pointer argument

# err_opencl_cast_non_zero_to_event_t
source: cannot cast non-zero value '%0' to 'event_t'
root: cannot cast non-zero value '{$arg0}' to 'event_t'

# err_opencl_cast_to_half
source: casting to type %0 is not allowed
root: casting to type {$arg0} is not allowed

# err_opencl_ext_vector_component_invalid_length
source: vector component access has invalid length %0; supported lengths are: 1,2,3,4,8,16
root: vector component access has invalid length {$arg0}; supported lengths are: 1,2,3,4,8,16

# err_opencl_function_pointer
source: %select{pointers|references}0 to functions are not allowed
root: {$arg0 :select s0=|pointers| s1=|references|} to functions are not allowed

# err_opencl_function_variable
source: %select{non-kernel function|function scope}0 variable cannot be declared in %1 address space
root: {$arg0 :select s0=|non-kernel function| s1=|function scope|} variable cannot be declared in {$arg1} address space

# err_opencl_global_invalid_addr_space
source: %select{program scope|static local|extern}0 variable must reside in %1 address space
root: {$arg0 :select s0=|program scope| s1=|static local| s2=|extern|} variable must reside in {$arg1} address space

# err_opencl_half_declaration
source: declaring variable of type %0 is not allowed
root: declaring variable of type {$arg0} is not allowed

# err_opencl_half_load_store
source: %select{loading directly from|assigning directly to}0 pointer to type %1 requires cl_khr_fp16. Use vector data %select{load|store}0 builtin functions instead
root: {$arg0 :select s0=|loading directly from| s1=|assigning directly to|} pointer to type {$arg1} requires cl_khr_fp16. Use vector data {$arg0 :select s0=|load| s1=|store|} builtin functions instead

# err_opencl_implicit_vector_conversion
source: implicit conversions between vector types (%0 and %1) are not permitted
root: implicit conversions between vector types ({$arg0} and {$arg1}) are not permitted

# err_opencl_invalid_block_declaration
source: invalid block variable declaration - must be %select{const qualified|initialized}0
root: invalid block variable declaration - must be {$arg0 :select s0=|const qualified| s1=|initialized|}

# err_opencl_invalid_param
source: declaring function parameter of type %0 is not allowed%select{; did you forget * ?|}1
root: declaring function parameter of type {$arg0} is not allowed{$arg1 :select s0=|; did you forget * ?| s1=||}

# err_opencl_invalid_return
source: declaring function return value of type %0 is not allowed %select{; did you forget * ?|}1
root: declaring function return value of type {$arg0} is not allowed {$arg1 :select s0=|; did you forget * ?| s1=||}

# err_opencl_invalid_type_array
source: array of %0 type is invalid in OpenCL
root: array of {$arg0} type is invalid in OpenCL

# err_opencl_kernel_attr
source: attribute %0 can only be applied to an OpenCL kernel function
root: attribute {$arg0} can only be applied to an OpenCL kernel function

# err_opencl_no_main
source: %select{function|kernel}0 cannot be called 'main'
root: {$arg0 :select s0=|function| s1=|kernel|} cannot be called 'main'

# err_opencl_pointer_to_type
source: pointer to type %0 is invalid in OpenCL
root: pointer to type {$arg0} is invalid in OpenCL

# err_opencl_requires_extension
source: use of %select{type|declaration}0 %1 requires %2 support
root: use of {$arg0 :select s0=|type| s1=|declaration|} {$arg1} requires {$arg2} support

# err_opencl_scalar_type_rank_greater_than_vector_type
source: scalar operand type has greater rank than the type of the vector element. (%0 and %1)
root: scalar operand type has greater rank than the type of the vector element. ({$arg0} and {$arg1})

# err_opencl_sizeof_alignof_type
source: invalid application of '%0' to a void type
root: invalid application of '{$arg0}' to a void type

# err_opencl_type_can_only_be_used_as_function_parameter
source: type %0 can only be used as a function parameter in OpenCL
root: type {$arg0} can only be used as a function parameter in OpenCL

# err_opencl_type_not_found
source: %0 type %1 not found; include the base header with -finclude-default-header
root: {$arg0} type {$arg1} not found; include the base header with -finclude-default-header

# err_opencl_type_struct_or_union_field
source: the %0 type cannot be used to declare a structure or union field
root: the {$arg0} type cannot be used to declare a structure or union field

# err_operator_arrow_depth_exceeded
source: use of 'operator->' on type %0 would invoke a sequence of more than %1 'operator->' calls
root: use of 'operator->' on type {$arg0} would invoke a sequence of more than {$arg1} 'operator->' calls

# err_operator_new_default_arg
source: parameter of %0 cannot have a default argument
root: parameter of {$arg0} cannot have a default argument

# err_operator_new_delete_declared_in_namespace
source: %0 cannot be declared inside a namespace
root: {$arg0} cannot be declared inside a namespace

# err_operator_new_delete_declared_static
source: %0 cannot be declared static in global scope
root: {$arg0} cannot be declared static in global scope

# err_operator_new_delete_dependent_result_type
source: %0 cannot have a dependent return type; use %1 instead
root: {$arg0} cannot have a dependent return type; use {$arg1} instead

# err_operator_new_delete_invalid_result_type
source: %0 must return type %1
root: {$arg0} must return type {$arg1}

# err_operator_new_delete_template_too_few_parameters
source: %0 template must have at least two parameters
root: {$arg0} template must have at least two parameters

# err_operator_overload_default_arg
source: parameter of overloaded %0 cannot have a default argument
root: parameter of overloaded {$arg0} cannot have a default argument

# err_operator_overload_must_be
source: overloaded %0 must be a %select{unary|binary|unary or binary}2 operator (has %1 parameter%s1)
root: overloaded {$arg0} must be a {$arg2 :select s0=|unary| s1=|binary| s2=|unary or binary|} operator (has {$arg1} parameter%s1)

# err_operator_overload_must_be_member
source: overloaded %0 must be a non-static member function
root: overloaded {$arg0} must be a non-static member function

# err_operator_overload_needs_class_or_enum
source: overloaded %0 must have at least one parameter of class or enumeration type
root: overloaded {$arg0} must have at least one parameter of class or enumeration type

# err_operator_overload_post_incdec_must_be_int
source: parameter of overloaded post-%select{increment|decrement}1 operator must have type 'int' (not %0)
root: parameter of overloaded post-{$arg1 :select s0=|increment| s1=|decrement|} operator must have type 'int' (not {$arg0})

# err_operator_overload_static
source: overloaded %0 cannot be a static member function
root: overloaded {$arg0} cannot be a static member function

# err_operator_overload_variadic
source: overloaded %0 cannot be variadic
root: overloaded {$arg0} cannot be variadic

# err_os_log_argument_too_big
source: os_log() argument %0 is too big (%1 bytes, max %2)
root: os_log() argument {$arg0} is too big ({$arg1} bytes, max {$arg2})

# err_out_of_line_default_deletes
source: defaulting this %select{default constructor|copy constructor|move constructor|copy assignment operator|move assignment operator|destructor}0 would delete it after its first declaration
root: defaulting this {$arg0 :select s0=|default constructor| s1=|copy constructor| s2=|move constructor| s3=|copy assignment operator| s4=|move assignment operator| s5=|destructor|} would delete it after its first declaration

# err_out_of_line_qualified_id_type_names_constructor
source: qualified reference to %0 is a constructor name rather than a %select{template name|type}1 in this context
root: qualified reference to {$arg0} is a constructor name rather than a {$arg1 :select s0=|template name| s1=|type|} in this context

# err_overflow_builtin_bit_int_max_size
source: __builtin_mul_overflow does not support 'signed _BitInt' operands of more than %0 bits
root: __builtin_mul_overflow does not support 'signed _BitInt' operands of more than {$arg0} bits
