Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# note_is_deducible_constraint_evaluated_to_false
source: cannot deduce template arguments for %0 from %1
root: cannot deduce template arguments for {$arg0} from {$arg1}

# note_lambda_capture_initializer
source: %select{implicitly |}2captured%select{| by reference}3%select{%select{ due to use|}2 here| via initialization of lambda capture %0}1
root: {$arg2 :select s0=|implicitly | s1=||}captured{$arg3 :select s0=|| s1=| by reference|}%select{{$arg1 :select s0=| due to use| s1=|}2 here| s2=| via initialization of lambda capture {$arg0}|}

# note_lambda_default_capture_fixit
source: default capture by %select{value|reference}0
root: default capture by {$arg0 :select s0=|value| s1=|reference|}

# note_lambda_variable_capture_fixit
source: capture %0 by %select{value|reference}1
root: capture {$arg0} by {$arg1 :select s0=|value| s1=|reference|}

# note_lifetime_extending_member_declared_here
source: %select{%select{reference|'std::initializer_list'}0 member|member with %select{reference|'std::initializer_list'}0 subobject}1 declared here
root: %select{{$arg0 :select s0=|reference| s1=|'std::initializer_list'|} member|member with {$arg1 :select s0=|reference| s1=|'std::initializer_list'}0 subobject|} declared here

# note_local_var_initializer
source: %select{via initialization of|binding reference}0 variable %select{%2 |}1here
root: {$arg0 :select s0=|via initialization of| s1=|binding reference|} variable {$arg1 :select s0=|{$arg2} | s1=||}here

# note_lock_exclusive_and_shared
source: the other acquisition of %0 '%1' is here
root: the other acquisition of {$arg0} '{$arg1}' is here

# note_locked_here
source: %0 acquired here
root: {$arg0} acquired here

# note_logical_instead_of_bitwise_change_operator
source: use '%0' for a bitwise operation
root: use '{$arg0}' for a bitwise operation

# note_logical_not_fix
source: add parentheses after the '!' to evaluate the %select{comparison|bitwise operator}0 first
root: add parentheses after the '!' to evaluate the {$arg0 :select s0=|comparison| s1=|bitwise operator|} first

# note_loop_iteration_here
source: %select{decremented|incremented}0 here
root: {$arg0 :select s0=|decremented| s1=|incremented|} here

# note_marked_here
source: marked %0 here
root: marked {$arg0} here

# note_member_declared_here
source: member %0 declared here
root: member {$arg0} declared here

# note_member_def_close_const_match
source: member declaration does not match because it %select{is|is not}0 const qualified
root: member declaration does not match because it {$arg0 :select s0=|is| s1=|is not|} const qualified

# note_member_first_declared_here
source: member %0 first declared here
root: member {$arg0} first declared here

# note_member_synthesized_at
source: in %select{implicit|defaulted}0 %select{default constructor|copy constructor|move constructor|copy assignment operator|move assignment operator|destructor}1 for %2 first required here
root: in {$arg0 :select s0=|implicit| s1=|defaulted|} {$arg1 :select s0=|default constructor| s1=|copy constructor| s2=|move constructor| s3=|copy assignment operator| s4=|move assignment operator| s5=|destructor|} for {$arg2} first required here

# note_memsize_comparison_paren
source: did you mean to compare the result of %0 instead?
root: did you mean to compare the result of {$arg0} instead?

# note_method_declared_at
source: method %0 declared here
root: method {$arg0} declared here

# note_method_return_type_change
source: compiler has implicitly changed method %0 return type
root: compiler has implicitly changed method {$arg0} return type

# note_method_sent_forward_class
source: method %0 is used for the forward class
root: method {$arg0} is used for the forward class

# note_misaligned_member_used_here
source: passing byval argument %0 with potentially incompatible alignment here
root: passing byval argument {$arg0} with potentially incompatible alignment here

# note_module_import_not_at_top_level
source: %0 begins here
root: {$arg0} begins here

# note_ms_bitfield_mismatched_storage_size_previous
source: preceding bit-field %0 declared here with type %1
root: preceding bit-field {$arg0} declared here with type {$arg1}

# note_musttail_callconv_mismatch
source: target function has calling convention %1 (expected %0)
root: target function has calling convention {$arg1} (expected {$arg0})

# note_musttail_callee_defined_here
source: %0 declared here
root: {$arg0} declared here

# note_musttail_mismatch
source: target function %select{is a member of different class%diff{ (expected $ but has $)|}1,2|has different number of parameters (expected %1 but has %2)|has type mismatch at %ordinal3 parameter%diff{ (expected $ but has $)|}1,2|has different return type%diff{ ($ expected but has $)|}1,2}0
root: target function %select{is a member of different class%diff{ (expected $ but has $)|}1,2|has different number of parameters (expected {$arg1} but has {$arg2})|has type mismatch at %ordinal3 parameter%diff{ (expected $ but has $)|}1,2|has different return type%diff{ ($ expected but has $)|}1,2}0

# note_musttail_structors_forbidden
source: target %select{constructor|destructor}0 is declared here
root: target {$arg0 :select s0=|constructor| s1=|destructor|} is declared here

# note_namespace_defined_here
source: namespace %0 defined here
root: namespace {$arg0} defined here

# note_neon_vector_initializer_non_portable
source: consider using vld1_%0%1() to initialize a vector from memory, or vcreate_%0%1() to initialize from an integer constant
root: consider using vld1_{$arg0}{$arg1}() to initialize a vector from memory, or vcreate_{$arg0}{$arg1}() to initialize from an integer constant

# note_neon_vector_initializer_non_portable_q
source: consider using vld1q_%0%1() to initialize a vector from memory, or vcombine_%0%1(vcreate_%0%1(), vcreate_%0%1()) to initialize from integer constants
root: consider using vld1q_{$arg0}{$arg1}() to initialize a vector from memory, or vcombine_{$arg0}{$arg1}(vcreate_{$arg0}{$arg1}(), vcreate_{$arg0}{$arg1}()) to initialize from integer constants

# note_nested_requirement_substitution_error
source: %select{and|because}0 '%1' would be invalid%2
root: {$arg0 :select s0=|and| s1=|because|} '{$arg1}' would be invalid{$arg2}

# note_nested_requirement_unknown_substitution_error
source: %select{and|because}0 '%1' would be invalid
root: {$arg0 :select s0=|and| s1=|because|} '{$arg1}' would be invalid

# note_next_ivar_declaration
source: next %select{instance variable declaration|synthesized instance variable}0 is here
root: next {$arg0 :select s0=|instance variable declaration| s1=|synthesized instance variable|} is here

# note_non_c_like_anon_struct
source: type is not C-compatible due to this %select{base class|default member initializer|lambda expression|friend declaration|member declaration}0
root: type is not C-compatible due to this {$arg0 :select s0=|base class| s1=|default member initializer| s2=|lambda expression| s3=|friend declaration| s4=|member declaration|}

# note_non_deducible_parameter
source: non-deducible template parameter %0
root: non-deducible template parameter {$arg0}

# note_non_literal_base_class
source: %0 is not literal because it has base class %1 of non-literal type
root: {$arg0} is not literal because it has base class {$arg1} of non-literal type

# note_non_literal_field
source: %0 is not literal because it has data member %1 of %select{non-literal|volatile}3 type %2
root: {$arg0} is not literal because it has data member {$arg1} of {$arg3 :select s0=|non-literal| s1=|volatile|} type {$arg2}

# note_non_literal_incomplete
source: incomplete type %0 is not a literal type
root: incomplete type {$arg0} is not a literal type

# note_non_literal_no_constexpr_ctors
source: %0 is not literal because it is not an aggregate and has no constexpr constructors other than copy or move constructors
root: {$arg0} is not literal because it is not an aggregate and has no constexpr constructors other than copy or move constructors

# note_non_literal_non_constexpr_dtor
source: %0 is not literal because its destructor is not constexpr
root: {$arg0} is not literal because its destructor is not constexpr

# note_non_literal_nontrivial_dtor
source: %0 is not literal because it has a non-trivial destructor
root: {$arg0} is not literal because it has a non-trivial destructor

# note_non_literal_user_provided_dtor
source: %0 is not literal because it has a user-provided destructor
root: {$arg0} is not literal because it has a user-provided destructor

# note_non_literal_virtual_base
source: %select{struct|interface|class}0 with virtual base %plural{1:class|:classes}1 is not a literal type
root: {$arg0 :select s0=|struct| s1=|interface| s2=|class|} with virtual base %plural{1:class|:classes}1 is not a literal type

# note_non_trivial_c_union
source: %select{%2 has subobjects that are|%3 has type %2 that is}0 non-trivial to %select{default-initialize|destruct|copy}1
root: {$arg0 :select s0=|{$arg2} has subobjects that are| s1=|{$arg3} has type {$arg2} that is|} non-trivial to {$arg1 :select s0=|default-initialize| s1=|destruct| s2=|copy|}

# note_non_usual_function_declared_here
source: non-usual %0 declared here
root: non-usual {$arg0} declared here

# note_nontrivial_default_member_init
source: because field %0 has an initializer
root: because field {$arg0} has an initializer

# note_nontrivial_field
source: field is non-trivial to %select{copy|default-initialize}0
root: field is non-trivial to {$arg0 :select s0=|copy| s1=|default-initialize|}

# note_nontrivial_has_virtual
source: because type %0 has a virtual %select{member function|base class}1
root: because type {$arg0} has a virtual {$arg1 :select s0=|member function| s1=|base class|}

# note_nontrivial_no_copy
source: because no %select{<<ERROR>>|constructor|constructor|assignment operator|assignment operator|<<ERROR>>}2 can be used to %select{<<ERROR>>|copy|move|copy|move|<<ERROR>>}2 %select{base class|field|an object}0 of type %3
root: because no {$arg2 :select s0=|<<ERROR>>| s1=|constructor| s2=|constructor| s3=|assignment operator| s4=|assignment operator| s5=|<<ERROR>>|} can be used to {$arg2 :select s0=|<<ERROR>>| s1=|copy| s2=|move| s3=|copy| s4=|move| s5=|<<ERROR>>|} {$arg0 :select s0=|base class| s1=|field| s2=|an object|} of type {$arg3}

# note_nontrivial_no_def_ctor
source: because %select{base class of |field of |}0type %1 has no default constructor
root: because {$arg0 :select s0=|base class of | s1=|field of | s2=||}type {$arg1} has no default constructor

# note_nontrivial_objc_ownership
source: because type %0 has a member with %select{no|no|__strong|__weak|__autoreleasing}1 ownership
root: because type {$arg0} has a member with {$arg1 :select s0=|no| s1=|no| s2=|__strong| s3=|__weak| s4=|__autoreleasing|} ownership

# note_nontrivial_subobject
source: because the function selected to %select{construct|copy|move|copy|move|destroy}2 %select{base class|field}0 of type %1 is not trivial
root: because the function selected to {$arg2 :select s0=|construct| s1=|copy| s2=|move| s3=|copy| s4=|move| s5=|destroy|} {$arg0 :select s0=|base class| s1=|field|} of type {$arg1} is not trivial

# note_nontrivial_user_provided
source: because %select{base class of |field of |}0type %1 has a user-provided %select{default constructor|copy constructor|move constructor|copy assignment operator|move assignment operator|destructor}2
root: because {$arg0 :select s0=|base class of | s1=|field of | s2=||}type {$arg1} has a user-provided {$arg2 :select s0=|default constructor| s1=|copy constructor| s2=|move constructor| s3=|copy assignment operator| s4=|move assignment operator| s5=|destructor|}

# note_nontrivial_virtual_dtor
source: destructor for %0 is not trivial because it is virtual
root: destructor for {$arg0} is not trivial because it is virtual

# note_not_found_by_two_phase_lookup
source: %0 should be declared prior to the call site%select{| or in %2| or in an associated namespace of one of its arguments}1
root: {$arg0} should be declared prior to the call site{$arg1 :select s0=|| s1=| or in {$arg2}| s2=| or in an associated namespace of one of its arguments|}

# note_not_structural_mutable_field
source: %0 is not a structural type because it has a mutable non-static data member
root: {$arg0} is not a structural type because it has a mutable non-static data member

# note_not_structural_non_public
source: %0 is not a structural type because it has a %select{non-static data member|base class}1 that is not public
root: {$arg0} is not a structural type because it has a {$arg1 :select s0=|non-static data member| s1=|base class|} that is not public

# note_not_structural_rvalue_ref_field
source: %0 is not a structural type because it has a non-static data member of rvalue reference type
root: {$arg0} is not a structural type because it has a non-static data member of rvalue reference type

# note_not_structural_subobject
source: %0 is not a structural type because it has a %select{non-static data member|base class}1 of non-structural type %2
root: {$arg0} is not a structural type because it has a {$arg1 :select s0=|non-static data member| s1=|base class|} of non-structural type {$arg2}

# note_nullability_fix_it
source: insert '%select{_Nonnull|_Nullable|_Null_unspecified}0' if the %select{pointer|block pointer|member pointer|array parameter}1 %select{should never be null|may be null|should not declare nullability}0
root: insert '{$arg0 :select s0=|_Nonnull| s1=|_Nullable| s2=|_Null_unspecified|}' if the {$arg1 :select s0=|pointer| s1=|block pointer| s2=|member pointer| s3=|array parameter|} {$arg0 :select s0=|should never be null| s1=|may be null| s2=|should not declare nullability|}

# note_nullability_here
source: %0 specified here
root: {$arg0} specified here

# note_nullability_type_specifier
source: use nullability type specifier %0 to affect the innermost pointer type of %1
root: use nullability type specifier {$arg0} to affect the innermost pointer type of {$arg1}

# note_objc_circular_container_declared_here
source: %0 declared here
root: {$arg0} declared here

# note_objc_literal_method_param
source: %select{first|second|third}0 parameter has unexpected type %1 (should be %2)
root: {$arg0 :select s0=|first| s1=|second| s2=|third|} parameter has unexpected type {$arg1} (should be {$arg2})

# note_objc_literal_method_return
source: method returns unexpected type %0 (should be an object type)
root: method returns unexpected type {$arg0} (should be an object type)

# note_objc_type_param_here
source: type parameter %0 declared here
root: type parameter {$arg0} declared here

# note_objc_unsafe_perform_selector_method_declared_here
source: method %0 that returns %1 declared here
root: method {$arg0} that returns {$arg1} declared here

# note_omp_atomic_capture
source: %select{expected assignment expression|expected compound statement|expected exactly two expression statements|expected in right hand side of the first expression}0
root: {$arg0 :select s0=|expected assignment expression| s1=|expected compound statement| s2=|expected exactly two expression statements| s3=|expected in right hand side of the first expression|}

# note_omp_atomic_compare
source: %select{expected compound statement|expected exactly one expression statement|expected assignment statement|expected conditional operator|expect result value to be at false expression|expect binary operator in conditional expression|expect '<', '>' or '==' as order operator|expect comparison in a form of 'x == e', 'e == x', 'x ordop expr', or 'expr ordop x'|expect lvalue for result value|expect scalar value|expect integer value|unexpected 'else' statement|expect '==' operator|expect an assignment statement 'v = x'|expect a 'if' statement|expect no more than two statements|expect a compound statement|expect 'else' statement|expect a form 'r = x == e; if (r) ...'}0
root: {$arg0 :select s0=|expected compound statement| s1=|expected exactly one expression statement| s2=|expected assignment statement| s3=|expected conditional operator| s4=|expect result value to be at false expression| s5=|expect binary operator in conditional expression| s6=|expect '<', '>' or '==' as order operator| s7=|expect comparison in a form of 'x == e', 'e == x', 'x ordop expr', or 'expr ordop x'| s8=|expect lvalue for result value| s9=|expect scalar value| s10=|expect integer value| s11=|unexpected 'else' statement| s12=|expect '==' operator| s13=|expect an assignment statement 'v = x'| s14=|expect a 'if' statement| s15=|expect no more than two statements| s16=|expect a compound statement| s17=|expect 'else' statement| s18=|expect a form 'r = x == e; if (r) ...'|}

# note_omp_atomic_read_write
source: %select{expected an expression statement|expected built-in assignment operator|expected expression of scalar type|expected lvalue expression}0
root: {$arg0 :select s0=|expected an expression statement| s1=|expected built-in assignment operator| s2=|expected expression of scalar type| s3=|expected lvalue expression|}

# note_omp_atomic_update
source: %select{expected an expression statement|expected built-in binary or unary operator|expected unary decrement/increment operation|expected expression of scalar type|expected assignment expression|expected built-in binary operator|expected one of '+', '*', '-', '/', '&', '^', '%|', '<<', or '>>' built-in operations|expected in right hand side of expression}0
root: {$arg0 :select s0=|expected an expression statement| s1=|expected built-in binary or unary operator| s2=|expected unary decrement/increment operation| s3=|expected expression of scalar type| s4=|expected assignment expression| s5=|expected built-in binary operator| s6=|expected one of '+', '*', '-', '/', '&', '^', '%| s7=|', '<<', or '>>' built-in operations| s8=|expected in right hand side of expression|}

# note_omp_collapse_ordered_expr
source: as specified in %select{'collapse'|'ordered'|'collapse' and 'ordered'}0 clause%select{||s}0
root: as specified in {$arg0 :select s0=|'collapse'| s1=|'ordered'| s2=|'collapse' and 'ordered'|} clause{$arg0 :select s0=|| s1=|| s2=|s|}

# note_omp_conversion_here
source: conversion to %select{integral|enumeration}0 type %1 declared here
root: conversion to {$arg0 :select s0=|integral| s1=|enumeration|} type {$arg1} declared here

# note_omp_critical_hint_here
source: %select{|previous }0'hint' clause with value '%1'
root: {$arg0 :select s0=|| s1=|previous |}'hint' clause with value '{$arg1}'

# note_omp_critical_no_hint
source: %select{|previous }0directive with no 'hint' clause specified
root: {$arg0 :select s0=|| s1=|previous |}directive with no 'hint' clause specified

# note_omp_directive_here
source: '%0' directive found here
root: '{$arg0}' directive found here

# note_omp_explicit_dsa
source: defined as %0
root: defined as {$arg0}

# note_omp_flush_order_clause_here
source: memory order clause '%0' is specified here
root: memory order clause '{$arg0}' is specified here

# note_omp_implicit_dsa
source: implicitly determined as %0
root: implicitly determined as {$arg0}

# note_omp_loop_cond_requires_compatible_incr
source: loop step is expected to be %select{negative|positive}0 due to this condition
root: loop step is expected to be {$arg0 :select s0=|negative| s1=|positive|} due to this condition

# note_omp_marked_device_type_here
source: marked as 'device_type(%0)' here
root: marked as 'device_type({$arg0})' here

# note_omp_nested_statement_here
source: %select{statement|directive}0 outside teams construct here
root: {$arg0 :select s0=|statement| s1=|directive|} outside teams construct here

# note_omp_ordered_param
source: 'ordered' clause%select{| with specified parameter}0
root: 'ordered' clause{$arg0 :select s0=|| s1=| with specified parameter|}

# note_omp_predefined_allocator
source: predefined trait '%0' used here
root: predefined trait '{$arg0}' used here

# note_omp_predetermined_dsa
source: %select{static data member is predetermined as shared|variable with static storage duration is predetermined as shared|loop iteration variable is predetermined as private|loop iteration variable is predetermined as linear|loop iteration variable is predetermined as lastprivate|constant variable is predetermined as shared|global variable is predetermined as shared|non-shared variable in a task construct is predetermined as firstprivate|variable with automatic storage duration is predetermined as private}0%select{|; perhaps you forget to enclose 'omp %2' directive into a parallel or another task region?}1
root: {$arg0 :select s0=|static data member is predetermined as shared| s1=|variable with static storage duration is predetermined as shared| s2=|loop iteration variable is predetermined as private| s3=|loop iteration variable is predetermined as linear| s4=|loop iteration variable is predetermined as lastprivate| s5=|constant variable is predetermined as shared| s6=|global variable is predetermined as shared| s7=|non-shared variable in a task construct is predetermined as firstprivate| s8=|variable with automatic storage duration is predetermined as private|}{$arg1 :select s0=|| s1=|; perhaps you forget to enclose 'omp {$arg2}' directive into a parallel or another task region?|}

# note_omp_previous_clause
source: '%0' clause is specified here
root: '{$arg0}' clause is specified here

# note_omp_previous_directive
source: previous '%0' directive used here
root: previous '{$arg0}' directive used here

# note_omp_previous_mem_order_clause
source: '%0' clause used here
root: '{$arg0}' clause used here

# note_omp_requires_encountered_directive
source: '%0' previously encountered here
root: '{$arg0}' previously encountered here

# note_omp_requires_previous_clause
source: %0 clause previously used here
root: {$arg0} clause previously used here

# note_opencl_typedef_access_qualifier
source: previously declared '%0' here
root: previously declared '{$arg0}' here

# note_operator_arrow_here
source: 'operator->' declared here produces an object of type %0
root: 'operator->' declared here produces an object of type {$arg0}

# note_operator_arrows_suppressed
source: (skipping %0 'operator->'%s0 in backtrace)
root: (skipping {$arg0} 'operator->'%s0 in backtrace)

# note_ovl_builtin_candidate
source: built-in candidate %0
root: built-in candidate {$arg0}
