Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# err_invalid_member_use_in_method
source: invalid use of member %0 in %select{static|explicit object}1 member function
root: invalid use of member {$arg0} in {$arg1 :select s0=|static| s1=|explicit object|} member function

# err_invalid_module_name
source: %0 is an invalid name for a module
root: {$arg0} is an invalid name for a module

# err_invalid_non_static_member_use
source: invalid use of non-static data member %0
root: invalid use of non-static data member {$arg0}

# err_invalid_nsnumber_type
source: %0 is not a valid literal type for NSNumber
root: {$arg0} is not a valid literal type for NSNumber

# err_invalid_pixel_decl_spec_combination
source: '__pixel' must be preceded by '__vector'. '%0' declaration specifier not allowed here
root: '__pixel' must be preceded by '__vector'. '{$arg0}' declaration specifier not allowed here

# err_invalid_property_name
source: %0 is not a valid property name (accessing an object of type %1)
root: {$arg0} is not a valid property name (accessing an object of type {$arg1})

# err_invalid_qualified_constructor
source: '%0' qualifier is not allowed on a constructor
root: '{$arg0}' qualifier is not allowed on a constructor

# err_invalid_qualified_destructor
source: '%0' qualifier is not allowed on a destructor
root: '{$arg0}' qualifier is not allowed on a destructor

# err_invalid_qualified_function_type
source: %select{non-member function|static member function|explicit object member function|deduction guide}0 %select{of type %2 |}1cannot have '%3' qualifier
root: {$arg0 :select s0=|non-member function| s1=|static member function| s2=|explicit object member function| s3=|deduction guide|} {$arg1 :select s0=|of type {$arg2} | s1=||}cannot have '{$arg3}' qualifier

# err_invalid_receiver_class_message
source: receiver type %0 is not an Objective-C class
root: receiver type {$arg0} is not an Objective-C class

# err_invalid_saturation_spec
source: '_Sat' specifier is only valid on '_Fract' or '_Accum', not '%0'
root: '_Sat' specifier is only valid on '_Fract' or '_Accum', not '{$arg0}'

# err_invalid_sign_spec
source: '%0' cannot be signed or unsigned
root: '{$arg0}' cannot be signed or unsigned

# err_invalid_this_use
source: invalid use of 'this' %select{outside of a non-static member function|in a function with an explicit object parameter}0
root: invalid use of 'this' {$arg0 :select s0=|outside of a non-static member function| s1=|in a function with an explicit object parameter|}

# err_invalid_thread
source: '%0' is only allowed on variable declarations
root: '{$arg0}' is only allowed on variable declarations

# err_invalid_type_for_program_scope_var
source: the %0 type cannot be used to declare a program scope variable
root: the {$arg0} type cannot be used to declare a program scope variable

# err_invalid_var_template_spec_type
source: type %2 of %select{explicit instantiation|explicit specialization|partial specialization|redeclaration}0 of %1 does not match expected type %3
root: type {$arg2} of {$arg0 :select s0=|explicit instantiation| s1=|explicit specialization| s2=|partial specialization| s3=|redeclaration|} of {$arg1} does not match expected type {$arg3}

# err_invalid_vector_bool_decl_spec
source: cannot use '%0' with '__vector bool'
root: cannot use '{$arg0}' with '__vector bool'

# err_invalid_vector_decl_spec_combination
source: cannot combine with previous '%0' declaration specifier. '__vector' must be first
root: cannot combine with previous '{$arg0}' declaration specifier. '__vector' must be first

# err_invalid_width_spec
source: '%select{|short|long|long long}0 %1' is invalid
root: '{$arg0 :select s0=|| s1=|short| s2=|long| s3=|long long|} {$arg1}' is invalid

# err_ivar_access_using_property_syntax_suggest
source: property %0 not found on object of type %1; did you mean to access instance variable %2?
root: property {$arg0} not found on object of type {$arg1}; did you mean to access instance variable {$arg2}?

# err_ivar_in_superclass_use
source: property %0 attempting to use instance variable %1 declared in super class %2
root: property {$arg0} attempting to use instance variable {$arg1} declared in super class {$arg2}

# err_ivar_use_in_class_method
source: instance variable %0 accessed in class method
root: instance variable {$arg0} accessed in class method

# err_kern_call_not_global_function
source: kernel call to non-global function %0
root: kernel call to non-global function {$arg0}

# err_kern_is_nonstatic_method
source: kernel function %0 must be a free function or static member function
root: kernel function {$arg0} must be a free function or static member function

# err_kern_type_not_void_return
source: kernel function type %0 must have void return type
root: kernel function type {$arg0} must have void return type

# err_lambda_capture_flexarray_type
source: variable %0 with flexible array member cannot be captured in a lambda expression
root: variable {$arg0} with flexible array member cannot be captured in a lambda expression

# err_lambda_impcap
source: variable %0 cannot be implicitly captured in a lambda with no capture-default specified
root: variable {$arg0} cannot be implicitly captured in a lambda with no capture-default specified

# err_lambda_incomplete_result
source: incomplete result type %0 in lambda expression
root: incomplete result type {$arg0} in lambda expression

# err_late_asm_label_name
source: cannot apply asm label to %select{variable|function}0 after its first use
root: cannot apply asm label to {$arg0 :select s0=|variable| s1=|function|} after its first use

# err_lifetimebound_ctor_dtor
source: 'lifetimebound' attribute cannot be applied to a %select{constructor|destructor}0
root: 'lifetimebound' attribute cannot be applied to a {$arg0 :select s0=|constructor| s1=|destructor|}

# err_list_init_in_parens
source: cannot initialize %select{non-class|reference}0 type %1 with a parenthesized initializer list
root: cannot initialize {$arg0 :select s0=|non-class| s1=|reference|} type {$arg1} with a parenthesized initializer list

# err_literal_operator_outside_namespace
source: literal operator %0 must be in a namespace or global scope
root: literal operator {$arg0} must be in a namespace or global scope

# err_literal_operator_param
source: invalid literal operator parameter type %0, did you mean %1?
root: invalid literal operator parameter type {$arg0}, did you mean {$arg1}?

# err_loader_uninitialized_extern_decl
source: variable %0 cannot be declared both 'extern' and with the 'loader_uninitialized' attribute
root: variable {$arg0} cannot be declared both 'extern' and with the 'loader_uninitialized' attribute

# err_loop_attr_conflict
source: conflicting loop attribute %0
root: conflicting loop attribute {$arg0}

# err_lvalue_reference_bind_to_initlist
source: %select{non-const|volatile}0 lvalue reference to type %1 cannot bind to an initializer list temporary
root: {$arg0 :select s0=|non-const| s1=|volatile|} lvalue reference to type {$arg1} cannot bind to an initializer list temporary

# err_lvalue_reference_bind_to_temporary
source: %select{non-const|volatile}0 lvalue reference %diff{to type $ cannot bind to a temporary of type $|cannot bind to incompatible temporary}1,2
root: {$arg0 :select s0=|non-const| s1=|volatile|} lvalue reference %diff{to type $ cannot bind to a temporary of type $|cannot bind to incompatible temporary}1,2

# err_lvalue_reference_bind_to_unrelated
source: %select{non-const|volatile}0 lvalue reference %diff{to type $ cannot bind to a value of unrelated type $|cannot bind to a value of unrelated type}1,2
root: {$arg0 :select s0=|non-const| s1=|volatile|} lvalue reference %diff{to type $ cannot bind to a value of unrelated type $|cannot bind to a value of unrelated type}1,2

# err_machine_mode
source: %select{unknown|unsupported}0 machine mode %1
root: {$arg0 :select s0=|unknown| s1=|unsupported|} machine mode {$arg1}

# err_main_arg_wrong
source: %select{first|second|third|fourth}0 parameter of 'main' (%select{argument count|argument array|environment|platform-specific data}0) must be of type %1
root: {$arg0 :select s0=|first| s1=|second| s2=|third| s3=|fourth|} parameter of 'main' ({$arg0 :select s0=|argument count| s1=|argument array| s2=|environment| s3=|platform-specific data|}) must be of type {$arg1}

# err_main_surplus_args
source: too many parameters (%0) for 'main': must be 0, 2, or 3
root: too many parameters ({$arg0}) for 'main': must be 0, 2, or 3

# err_mainlike_template_decl
source: %0 cannot be a template
root: {$arg0} cannot be a template

# err_make_signed_integral_only
source: '%select{make_unsigned|make_signed}0' is only compatible with non-%select{bool|_BitInt(1)}1 integers and enum types, but was given %2%select{| whose underlying type is %4}3
root: '{$arg0 :select s0=|make_unsigned| s1=|make_signed|}' is only compatible with non-{$arg1 :select s0=|bool| s1=|_BitInt(1)|} integers and enum types, but was given {$arg2}{$arg3 :select s0=|| s1=| whose underlying type is {$arg4}|}

# err_malformed_std_class_template
source: std::%0 must be a class template with a single type parameter
root: std::{$arg0} must be a class template with a single type parameter

# err_matrix_index_not_integer
source: matrix %select{row|column}0 index is not an integer
root: matrix {$arg0 :select s0=|row| s1=|column|} index is not an integer

# err_matrix_index_outside_range
source: matrix %select{row|column}0 index is outside the allowed range [0, %1)
root: matrix {$arg0 :select s0=|row| s1=|column|} index is outside the allowed range [0, {$arg1})

# err_mem_init_not_member_or_class
source: member initializer %0 does not name a non-static data member or base class
root: member initializer {$arg0} does not name a non-static data member or base class

# err_mem_init_not_member_or_class_suggest
source: initializer %0 does not name a non-static data member or base class; did you mean the %select{base class|member}1 %2?
root: initializer {$arg0} does not name a non-static data member or base class; did you mean the {$arg1 :select s0=|base class| s1=|member|} {$arg2}?

# err_member_call_without_object
source: call to %select{non-static|explicit}0 member function without an object argument
root: call to {$arg0 :select s0=|non-static| s1=|explicit|} member function without an object argument

# err_member_decl_does_not_match
source: out-of-line %select{declaration|definition}2 of %0 does not match any declaration in %1
root: out-of-line {$arg2 :select s0=|declaration| s1=|definition|} of {$arg0} does not match any declaration in {$arg1}

# err_member_decl_does_not_match_suggest
source: out-of-line %select{declaration|definition}2 of %0 does not match any declaration in %1; did you mean %3?
root: out-of-line {$arg2 :select s0=|declaration| s1=|definition|} of {$arg0} does not match any declaration in {$arg1}; did you mean {$arg3}?

# err_member_def_does_not_match_ret_type
source: return type of out-of-line definition of %q0 differs from that in the declaration
root: return type of out-of-line definition of {$arg0 :q} differs from that in the declaration

# err_member_def_undefined_record
source: out-of-line definition of %0 from class %1 without definition
root: out-of-line definition of {$arg0} from class {$arg1} without definition

# err_member_extra_qualification
source: extra qualification on member %0
root: extra qualification on member {$arg0}

# err_member_function_call_bad_cvr
source: 'this' argument to member function %0 has type %1, but function is not marked %select{const|restrict|const or restrict|volatile|const or volatile|volatile or restrict|const, volatile, or restrict}2
root: 'this' argument to member function {$arg0} has type {$arg1}, but function is not marked {$arg2 :select s0=|const| s1=|restrict| s2=|const or restrict| s3=|volatile| s4=|const or volatile| s5=|volatile or restrict| s6=|const, volatile, or restrict|}

# err_member_function_call_bad_ref
source: 'this' argument to member function %0 is an %select{lvalue|rvalue}1, but function has %select{non-const lvalue|rvalue}2 ref-qualifier
root: 'this' argument to member function {$arg0} is an {$arg1 :select s0=|lvalue| s1=|rvalue|}, but function has {$arg2 :select s0=|non-const lvalue| s1=|rvalue|} ref-qualifier

# err_member_function_call_bad_type
source: cannot initialize object parameter of type %0 with an expression of type %1
root: cannot initialize object parameter of type {$arg0} with an expression of type {$arg1}

# err_member_name_of_class
source: member %0 has the same name as its class
root: member {$arg0} has the same name as its class

# err_member_not_yet_instantiated
source: no member %0 in %1; it has not yet been instantiated
root: no member {$arg0} in {$arg1}; it has not yet been instantiated

# err_member_qualification
source: non-friend class member %0 cannot have a qualified name
root: non-friend class member {$arg0} cannot have a qualified name

# err_member_redeclared_in_instantiation
source: multiple overloads of %0 instantiate to the same signature %1
root: multiple overloads of {$arg0} instantiate to the same signature {$arg1}

# err_member_reference_needs_call
source: base of member reference is a function; perhaps you meant to call it%select{| with no arguments}0?
root: base of member reference is a function; perhaps you meant to call it{$arg0 :select s0=|| s1=| with no arguments|}?

# err_member_with_template_arguments
source: member %0 cannot have template arguments
root: member {$arg0} cannot have template arguments

# err_memptr_conv_via_virtual
source: conversion from pointer to member of class %0 to pointer to member of class %1 via virtual base %2 is not allowed
root: conversion from pointer to member of class {$arg0} to pointer to member of class {$arg1} via virtual base {$arg2} is not allowed

# err_memptr_incomplete
source: member pointer has incomplete base type %0
root: member pointer has incomplete base type {$arg0}

# err_memtag_any2arg_pointer
source: at least one argument of MTE builtin function must be a pointer (%0, %1 invalid)
root: at least one argument of MTE builtin function must be a pointer ({$arg0}, {$arg1} invalid)

# err_memtag_arg_must_be_integer
source: %0 argument of MTE builtin function must be an integer type (%1 invalid)
root: {$arg0} argument of MTE builtin function must be an integer type ({$arg1} invalid)

# err_memtag_arg_must_be_pointer
source: %0 argument of MTE builtin function must be a pointer (%1 invalid)
root: {$arg0} argument of MTE builtin function must be a pointer ({$arg1} invalid)

# err_memtag_arg_null_or_pointer
source: %0 argument of MTE builtin function must be a null or a pointer (%1 invalid)
root: {$arg0} argument of MTE builtin function must be a null or a pointer ({$arg1} invalid)

# err_method_not_found_with_typo
source: %select{instance|class}1 method %0 not found ; did you mean %2?
root: {$arg1 :select s0=|instance| s1=|class|} method {$arg0} not found ; did you mean {$arg2}?

# err_mismatched_ms_inheritance
source: inheritance model does not match %select{definition|previous declaration}0
root: inheritance model does not match {$arg0 :select s0=|definition| s1=|previous declaration|}

# err_mismatched_owning_module
source: declaration of %0 in %select{the global module|module %2}1 follows declaration in %select{the global module|module %4}3
root: declaration of {$arg0} in {$arg1 :select s0=|the global module| s1=|module {$arg2}|} follows declaration in {$arg3 :select s0=|the global module| s1=|module {$arg4}|}

# err_mismatching_type_aware_cleanup_deallocator
source: type aware %0 requires a matching type aware %select{|placement }1%2 to be declared in the same scope
root: type aware {$arg0} requires a matching type aware {$arg1 :select s0=|| s1=|placement |}{$arg2} to be declared in the same scope

# err_misplaced_ivar
source: instance variables may not be placed in %select{categories|class extension}0
root: instance variables may not be placed in {$arg0 :select s0=|categories| s1=|class extension|}

# err_missing_arm_state
source: missing state for %0
root: missing state for {$arg0}

# err_missing_atsign_prefix
source: %select{string|numeric}0 literal must be prefixed by '@'
root: {$arg0 :select s0=|string| s1=|numeric|} literal must be prefixed by '@'

# err_missing_default_ctor
source: %select{constructor for %1 must explicitly initialize the|implicit default constructor for %1 must explicitly initialize the|cannot use constructor inherited from base class %4;}0 %select{base class|member}2 %3 %select{which|which|of %1}0 does not have a default constructor
root: {$arg0 :select s0=|constructor for {$arg1} must explicitly initialize the| s1=|implicit default constructor for {$arg1} must explicitly initialize the| s2=|cannot use constructor inherited from base class {$arg4};|} {$arg2 :select s0=|base class| s1=|member|} {$arg3} {$arg0 :select s0=|which| s1=|which| s2=|of {$arg1}|} does not have a default constructor

# err_missing_exception_specification
source: %0 is missing exception specification '%1'
root: {$arg0} is missing exception specification '{$arg1}'

# err_missing_property_ivar_decl
source: synthesized property %0 must either be named the same as a compatible instance variable or must explicitly name an instance variable
root: synthesized property {$arg0} must either be named the same as a compatible instance variable or must explicitly name an instance variable

# err_mixing_cxx_try_seh_try
source: cannot use %select{C++ 'try'|Objective-C '@try'}0 in the same function as SEH '__try'
root: cannot use {$arg0 :select s0=|C++ 'try'| s1=|Objective-C '@try'|} in the same function as SEH '__try'

# err_module_import_in_implementation
source: @import of module '%0' in implementation of '%1'; use #import
root: @import of module '{$arg0}' in implementation of '{$arg1}'; use #import

# err_module_import_non_interface_nor_parition
source: import of module '%0' imported non C++20 importable modules
root: import of module '{$arg0}' imported non C++20 importable modules

# err_module_import_not_at_top_level_fatal
source: import of module '%0' appears within %1
root: import of module '{$arg0}' appears within {$arg1}

# err_module_not_defined
source: definition of module '%0' is not available; use -fmodule-file= to specify path to precompiled module interface
root: definition of module '{$arg0}' is not available; use -fmodule-file= to specify path to precompiled module interface

# err_module_private_local
source: %select{local variable|parameter|typedef}0 %1 cannot be declared __module_private__
root: {$arg0 :select s0=|local variable| s1=|parameter| s2=|typedef|} {$arg1} cannot be declared __module_private__

# err_module_private_local_class
source: local %select{struct|interface|union|class|enum}0 cannot be declared __module_private__
root: local {$arg0 :select s0=|struct| s1=|interface| s2=|union| s3=|class| s4=|enum|} cannot be declared __module_private__

# err_module_private_specialization
source: %select{template|partial|member}0 specialization cannot be declared __module_private__
root: {$arg0 :select s0=|template| s1=|partial| s2=|member|} specialization cannot be declared __module_private__

# err_module_redefinition
source: redefinition of module '%0'
root: redefinition of module '{$arg0}'

# err_module_self_import
source: import of module '%0' appears within same top-level module '%1'
root: import of module '{$arg0}' appears within same top-level module '{$arg1}'

# err_module_self_import_cxx20
source: import of module '%0' appears within its own %select{interface|implementation}1
root: import of module '{$arg0}' appears within its own {$arg1 :select s0=|interface| s1=|implementation|}

# err_module_unimported_use
source: %select{declaration|definition|default argument|explicit specialization|partial specialization}0 of %1 must be imported from module '%2' before it is required
root: {$arg0 :select s0=|declaration| s1=|definition| s2=|default argument| s3=|explicit specialization| s4=|partial specialization|} of {$arg1} must be imported from module '{$arg2}' before it is required

# err_module_unimported_use_header
source: %select{missing '#include'|missing '#include %3'}2; %select{||default argument of |explicit specialization of |partial specialization of }0%1 must be %select{declared|defined|defined|declared|declared}0 before it is used
root: {$arg2 :select s0=|missing '#include'| s1=|missing '#include {$arg3}'|}; {$arg0 :select s0=|| s1=|| s2=|default argument of | s3=|explicit specialization of | s4=|partial specialization of |}{$arg1} must be {$arg0 :select s0=|declared| s1=|defined| s2=|defined| s3=|declared| s4=|declared|} before it is used

# err_module_unimported_use_multiple
source: %select{declaration|definition|default argument|explicit specialization|partial specialization}0 of %1 must be imported from one of the following modules before it is required:%2
root: {$arg0 :select s0=|declaration| s1=|definition| s2=|default argument| s3=|explicit specialization| s4=|partial specialization|} of {$arg1} must be imported from one of the following modules before it is required:{$arg2}

# err_ms_constexpr_cannot_be_applied
source: attribute 'msvc::constexpr' cannot be applied to the %select{constexpr|consteval|virtual}0 function %1
root: attribute 'msvc::constexpr' cannot be applied to the {$arg0 :select s0=|constexpr| s1=|consteval| s2=|virtual|} function {$arg1}

# err_multiple_base_initialization
source: multiple initializations given for base %0
root: multiple initializations given for base {$arg0}

# err_multiple_final_overriders
source: virtual function %q0 has more than one final overrider in %1
root: virtual function {$arg0 :q} has more than one final overrider in {$arg1}

# err_multiple_mem_initialization
source: multiple initializations given for non-static member %0
root: multiple initializations given for non-static member {$arg0}

# err_multiversion_diff
source: multiversioned function declaration has a different %select{calling convention|return type|constexpr specification|inline specification|linkage|language linkage}0
root: multiversioned function declaration has a different {$arg0 :select s0=|calling convention| s1=|return type| s2=|constexpr specification| s3=|inline specification| s4=|linkage| s5=|language linkage|}

# err_multiversion_disallowed_other_attr
source: attribute '%select{|target|cpu_specific|cpu_dispatch|target_clones|target_version}0' multiversioning cannot be combined with attribute %1
root: attribute '{$arg0 :select s0=|| s1=|target| s2=|cpu_specific| s3=|cpu_dispatch| s4=|target_clones| s5=|target_version|}' multiversioning cannot be combined with attribute {$arg1}

# err_multiversion_doesnt_support
source: attribute '%select{|target|cpu_specific|cpu_dispatch|target_clones|target_version}0' multiversioned functions do not yet support %select{function templates|virtual functions|deduced return types|constructors|destructors|deleted functions|defaulted functions|constexpr functions|consteval function|lambdas}1
root: attribute '{$arg0 :select s0=|| s1=|target| s2=|cpu_specific| s3=|cpu_dispatch| s4=|target_clones| s5=|target_version|}' multiversioned functions do not yet support {$arg1 :select s0=|function templates| s1=|virtual functions| s2=|deduced return types| s3=|constructors| s4=|destructors| s5=|deleted functions| s6=|defaulted functions| s7=|constexpr functions| s8=|consteval function| s9=|lambdas|}

# err_multiversion_required_in_redecl
source: function declaration is missing %select{'target'|'cpu_specific' or 'cpu_dispatch'|'target_version'}0 attribute in a multiversioned function
root: function declaration is missing {$arg0 :select s0=|'target'| s1=|'cpu_specific' or 'cpu_dispatch'| s2=|'target_version'|} attribute in a multiversioned function
