Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# note_ovl_candidate
source: candidate %select{function|function|function (with reversed parameter order)|constructor|constructor (the implicit default constructor)|constructor (the implicit copy constructor)|constructor (the implicit move constructor)|function (the implicit copy assignment operator)|function (the implicit move assignment operator)|function (the implicit 'operator==' for this 'operator<=>)'|inherited constructor}0%select{| template| %3}1%select{| has different class%diff{ (expected $ but has $)|}5,6| has different number of parameters (expected %5 but has %6)| has type mismatch at %ordinal5 parameter%diff{ (expected $ but has $)|}6,7| has different return type%diff{ ($ expected but has $)|}5,6| has different qualifiers (expected %5 but found %6)| has different exception specification}4
root: candidate {$arg0 :select s0=|function| s1=|function| s2=|function (with reversed parameter order)| s3=|constructor| s4=|constructor (the implicit default constructor)| s5=|constructor (the implicit copy constructor)| s6=|constructor (the implicit move constructor)| s7=|function (the implicit copy assignment operator)| s8=|function (the implicit move assignment operator)| s9=|function (the implicit 'operator==' for this 'operator<=>)'| s10=|inherited constructor|}{$arg1 :select s0=|| s1=| template| s2=| {$arg3}|}%select{| has different class%diff{ (expected $ but has $)|}5,6| has different number of parameters (expected {$arg5} but has {$arg6})| has type mismatch at %ordinal5 parameter%diff{ (expected $ but has $)|}6,7| has different return type%diff{ ($ expected but has $)|}5,6| has different qualifiers (expected {$arg5} but found {$arg6})| has different exception specification}4

# note_ovl_candidate_arity
source: candidate %select{function|function|function (with reversed parameter order)|constructor|constructor (the implicit default constructor)|constructor (the implicit copy constructor)|constructor (the implicit move constructor)|function (the implicit copy assignment operator)|function (the implicit move assignment operator)|function (the implicit 'operator==' for this 'operator<=>)'|inherited constructor}0%select{| template| %2}1 not viable: requires%select{ at least| at most|}3 %4 %select{|non-object }6argument%s4, but %5 %plural{1:was|:were}5 provided
root: candidate {$arg0 :select s0=|function| s1=|function| s2=|function (with reversed parameter order)| s3=|constructor| s4=|constructor (the implicit default constructor)| s5=|constructor (the implicit copy constructor)| s6=|constructor (the implicit move constructor)| s7=|function (the implicit copy assignment operator)| s8=|function (the implicit move assignment operator)| s9=|function (the implicit 'operator==' for this 'operator<=>)'| s10=|inherited constructor|}{$arg1 :select s0=|| s1=| template| s2=| {$arg2}|} not viable: requires{$arg3 :select s0=| at least| s1=| at most| s2=||} {$arg4} {$arg6 :select s0=|| s1=|non-object |}argument%s4, but {$arg5} %plural{1:was|:were}5 provided

# note_ovl_candidate_arity_one
source: candidate %select{function|function|function (with reversed parameter order)|constructor|constructor (the implicit default constructor)|constructor (the implicit copy constructor)|constructor (the implicit move constructor)|function (the implicit copy assignment operator)|function (the implicit move assignment operator)|function (the implicit 'operator==' for this 'operator<=>)'|inherited constructor}0%select{| template| %2}1 not viable: %select{requires at least|allows at most single|requires single}3 %select{|non-object }6argument %4, but %plural{0:no|:%5}5 arguments were provided
root: candidate {$arg0 :select s0=|function| s1=|function| s2=|function (with reversed parameter order)| s3=|constructor| s4=|constructor (the implicit default constructor)| s5=|constructor (the implicit copy constructor)| s6=|constructor (the implicit move constructor)| s7=|function (the implicit copy assignment operator)| s8=|function (the implicit move assignment operator)| s9=|function (the implicit 'operator==' for this 'operator<=>)'| s10=|inherited constructor|}{$arg1 :select s0=|| s1=| template| s2=| {$arg2}|} not viable: {$arg3 :select s0=|requires at least| s1=|allows at most single| s2=|requires single|} {$arg6 :select s0=|| s1=|non-object |}argument {$arg4}, but %plural{0:no|:{$arg5}}5 arguments were provided

# note_ovl_candidate_bad_addrspace
source: candidate %select{function|function|function (with reversed parameter order)|constructor|constructor (the implicit default constructor)|constructor (the implicit copy constructor)|constructor (the implicit move constructor)|function (the implicit copy assignment operator)|function (the implicit move assignment operator)|function (the implicit 'operator==' for this 'operator<=>)'|inherited constructor}0%select{| template| %2}1 not viable: cannot %select{pass pointer to|bind reference in}5 %3 %select{as a pointer to|to object in}5 %4 in %ordinal6 argument
root: candidate {$arg0 :select s0=|function| s1=|function| s2=|function (with reversed parameter order)| s3=|constructor| s4=|constructor (the implicit default constructor)| s5=|constructor (the implicit copy constructor)| s6=|constructor (the implicit move constructor)| s7=|function (the implicit copy assignment operator)| s8=|function (the implicit move assignment operator)| s9=|function (the implicit 'operator==' for this 'operator<=>)'| s10=|inherited constructor|}{$arg1 :select s0=|| s1=| template| s2=| {$arg2}|} not viable: cannot {$arg5 :select s0=|pass pointer to| s1=|bind reference in|} {$arg3} {$arg5 :select s0=|as a pointer to| s1=|to object in|} {$arg4} in %ordinal6 argument

# note_ovl_candidate_bad_addrspace_this
source: candidate %select{function|function|function (with reversed parameter order)|constructor|constructor (the implicit default constructor)|constructor (the implicit copy constructor)|constructor (the implicit move constructor)|function (the implicit copy assignment operator)|function (the implicit move assignment operator)|function (the implicit 'operator==' for this 'operator<=>)'|inherited constructor}0%select{| template| %2}1 not viable: 'this' object is in %3, but method expects object in %4
root: candidate {$arg0 :select s0=|function| s1=|function| s2=|function (with reversed parameter order)| s3=|constructor| s4=|constructor (the implicit default constructor)| s5=|constructor (the implicit copy constructor)| s6=|constructor (the implicit move constructor)| s7=|function (the implicit copy assignment operator)| s8=|function (the implicit move assignment operator)| s9=|function (the implicit 'operator==' for this 'operator<=>)'| s10=|inherited constructor|}{$arg1 :select s0=|| s1=| template| s2=| {$arg2}|} not viable: 'this' object is in {$arg3}, but method expects object in {$arg4}

# note_ovl_candidate_bad_arc_conv
source: candidate %select{function|function|function (with reversed parameter order)|constructor|constructor (the implicit default constructor)|constructor (the implicit copy constructor)|constructor (the implicit move constructor)|function (the implicit copy assignment operator)|function (the implicit move assignment operator)|function (the implicit 'operator==' for this 'operator<=>)'|inherited constructor}0%select{| template| %2}1 not viable: cannot implicitly convert argument %diff{of type $ to $|type to parameter type}3,4 for %select{%ordinal6 argument|object argument}5 under ARC
root: candidate {$arg0 :select s0=|function| s1=|function| s2=|function (with reversed parameter order)| s3=|constructor| s4=|constructor (the implicit default constructor)| s5=|constructor (the implicit copy constructor)| s6=|constructor (the implicit move constructor)| s7=|function (the implicit copy assignment operator)| s8=|function (the implicit move assignment operator)| s9=|function (the implicit 'operator==' for this 'operator<=>)'| s10=|inherited constructor|}{$arg1 :select s0=|| s1=| template| s2=| {$arg2}|} not viable: cannot implicitly convert argument %diff{of type $ to $|type to parameter type}3,4 for {$arg5 :select s0=|%ordinal6 argument| s1=|object argument|} under ARC

# note_ovl_candidate_bad_base_to_derived_conv
source: candidate %select{function|function|function (with reversed parameter order)|constructor|constructor (the implicit default constructor)|constructor (the implicit copy constructor)|constructor (the implicit move constructor)|function (the implicit copy assignment operator)|function (the implicit move assignment operator)|function (the implicit 'operator==' for this 'operator<=>)'|inherited constructor}0%select{| template| %2}1 not viable: cannot %select{convert from|convert from|bind}3 %select{base class pointer|superclass|base class object of type}3 %4 to %select{derived class pointer|subclass|derived class reference}3 %5 for %ordinal6 argument
root: candidate {$arg0 :select s0=|function| s1=|function| s2=|function (with reversed parameter order)| s3=|constructor| s4=|constructor (the implicit default constructor)| s5=|constructor (the implicit copy constructor)| s6=|constructor (the implicit move constructor)| s7=|function (the implicit copy assignment operator)| s8=|function (the implicit move assignment operator)| s9=|function (the implicit 'operator==' for this 'operator<=>)'| s10=|inherited constructor|}{$arg1 :select s0=|| s1=| template| s2=| {$arg2}|} not viable: cannot {$arg3 :select s0=|convert from| s1=|convert from| s2=|bind|} {$arg3 :select s0=|base class pointer| s1=|superclass| s2=|base class object of type|} {$arg4} to {$arg3 :select s0=|derived class pointer| s1=|subclass| s2=|derived class reference|} {$arg5} for %ordinal6 argument

# note_ovl_candidate_bad_conv
source: candidate %select{function|function|function (with reversed parameter order)|constructor|constructor (the implicit default constructor)|constructor (the implicit copy constructor)|constructor (the implicit move constructor)|function (the implicit copy assignment operator)|function (the implicit move assignment operator)|function (the implicit 'operator==' for this 'operator<=>)'|inherited constructor}0%select{| template| %2}1 not viable: no known conversion %diff{from $ to $|from argument type to parameter type}3,4 for %select{%ordinal6 argument|object argument}5%select{|; dereference the argument with *|; take the address of the argument with &|; remove *|; remove &}7
root: candidate {$arg0 :select s0=|function| s1=|function| s2=|function (with reversed parameter order)| s3=|constructor| s4=|constructor (the implicit default constructor)| s5=|constructor (the implicit copy constructor)| s6=|constructor (the implicit move constructor)| s7=|function (the implicit copy assignment operator)| s8=|function (the implicit move assignment operator)| s9=|function (the implicit 'operator==' for this 'operator<=>)'| s10=|inherited constructor|}{$arg1 :select s0=|| s1=| template| s2=| {$arg2}|} not viable: no known conversion %diff{from $ to $|from argument type to parameter type}3,4 for {$arg5 :select s0=|%ordinal6 argument| s1=|object argument|}{$arg7 :select s0=|| s1=|; dereference the argument with *| s2=|; take the address of the argument with &| s3=|; remove *| s4=|; remove &|}

# note_ovl_candidate_bad_conv_incomplete
source: candidate %select{function|function|function (with reversed parameter order)|constructor|constructor (the implicit default constructor)|constructor (the implicit copy constructor)|constructor (the implicit move constructor)|function (the implicit copy assignment operator)|function (the implicit move assignment operator)|function (the implicit 'operator==' for this 'operator<=>)'|inherited constructor}0%select{| template| %2}1 not viable: cannot convert argument of incomplete type %diff{$ to $|to parameter type}3,4 for %select{%ordinal6 argument|object argument}5%select{|; dereference the argument with *|; take the address of the argument with &|; remove *|; remove &}7
root: candidate {$arg0 :select s0=|function| s1=|function| s2=|function (with reversed parameter order)| s3=|constructor| s4=|constructor (the implicit default constructor)| s5=|constructor (the implicit copy constructor)| s6=|constructor (the implicit move constructor)| s7=|function (the implicit copy assignment operator)| s8=|function (the implicit move assignment operator)| s9=|function (the implicit 'operator==' for this 'operator<=>)'| s10=|inherited constructor|}{$arg1 :select s0=|| s1=| template| s2=| {$arg2}|} not viable: cannot convert argument of incomplete type %diff{$ to $|to parameter type}3,4 for {$arg5 :select s0=|%ordinal6 argument| s1=|object argument|}{$arg7 :select s0=|| s1=|; dereference the argument with *| s2=|; take the address of the argument with &| s3=|; remove *| s4=|; remove &|}

# note_ovl_candidate_bad_cvr
source: candidate %select{function|function|function (with reversed parameter order)|constructor|constructor (the implicit default constructor)|constructor (the implicit copy constructor)|constructor (the implicit move constructor)|function (the implicit copy assignment operator)|function (the implicit move assignment operator)|function (the implicit 'operator==' for this 'operator<=>)'|inherited constructor}0%select{| template| %2}1 not viable: %ordinal5 argument (%3) would lose %select{const|restrict|const and restrict|volatile|const and volatile|volatile and restrict|const, volatile, and restrict}4 qualifier%select{||s||s|s|s}4
root: candidate {$arg0 :select s0=|function| s1=|function| s2=|function (with reversed parameter order)| s3=|constructor| s4=|constructor (the implicit default constructor)| s5=|constructor (the implicit copy constructor)| s6=|constructor (the implicit move constructor)| s7=|function (the implicit copy assignment operator)| s8=|function (the implicit move assignment operator)| s9=|function (the implicit 'operator==' for this 'operator<=>)'| s10=|inherited constructor|}{$arg1 :select s0=|| s1=| template| s2=| {$arg2}|} not viable: %ordinal5 argument ({$arg3}) would lose {$arg4 :select s0=|const| s1=|restrict| s2=|const and restrict| s3=|volatile| s4=|const and volatile| s5=|volatile and restrict| s6=|const, volatile, and restrict|} qualifier{$arg4 :select s0=|| s1=|| s2=|s| s3=|| s4=|s| s5=|s| s6=|s|}

# note_ovl_candidate_bad_cvr_this
source: candidate %select{function|function|function (with reversed parameter order)|constructor|constructor (the implicit default constructor)|constructor (the implicit copy constructor)|constructor (the implicit move constructor)|function (the implicit copy assignment operator)|function (the implicit move assignment operator)|function (the implicit 'operator==' for this 'operator<=>)'|inherited constructor}0%select{| template| %2}1 not viable: 'this' argument has type %3, but method is not marked %select{const|restrict|const or restrict|volatile|const or volatile|volatile or restrict|const, volatile, or restrict}4
root: candidate {$arg0 :select s0=|function| s1=|function| s2=|function (with reversed parameter order)| s3=|constructor| s4=|constructor (the implicit default constructor)| s5=|constructor (the implicit copy constructor)| s6=|constructor (the implicit move constructor)| s7=|function (the implicit copy assignment operator)| s8=|function (the implicit move assignment operator)| s9=|function (the implicit 'operator==' for this 'operator<=>)'| s10=|inherited constructor|}{$arg1 :select s0=|| s1=| template| s2=| {$arg2}|} not viable: 'this' argument has type {$arg3}, but method is not marked {$arg4 :select s0=|const| s1=|restrict| s2=|const or restrict| s3=|volatile| s4=|const or volatile| s5=|volatile or restrict| s6=|const, volatile, or restrict|}

# note_ovl_candidate_bad_gc
source: candidate %select{function|function|function (with reversed parameter order)|constructor|constructor (the implicit default constructor)|constructor (the implicit copy constructor)|constructor (the implicit move constructor)|function (the implicit copy assignment operator)|function (the implicit move assignment operator)|function (the implicit 'operator==' for this 'operator<=>)'|inherited constructor}0%select{| template| %2}1 not viable: %select{%ordinal7|'this'}6 argument (%3) has %select{no|__weak|__strong}4 ownership, but parameter has %select{no|__weak|__strong}5 ownership
root: candidate {$arg0 :select s0=|function| s1=|function| s2=|function (with reversed parameter order)| s3=|constructor| s4=|constructor (the implicit default constructor)| s5=|constructor (the implicit copy constructor)| s6=|constructor (the implicit move constructor)| s7=|function (the implicit copy assignment operator)| s8=|function (the implicit move assignment operator)| s9=|function (the implicit 'operator==' for this 'operator<=>)'| s10=|inherited constructor|}{$arg1 :select s0=|| s1=| template| s2=| {$arg2}|} not viable: {$arg6 :select s0=|%ordinal7| s1=|'this'|} argument ({$arg3}) has {$arg4 :select s0=|no| s1=|__weak| s2=|__strong|} ownership, but parameter has {$arg5 :select s0=|no| s1=|__weak| s2=|__strong|} ownership

# note_ovl_candidate_bad_list_argument
source: candidate %select{function|function|function (with reversed parameter order)|constructor|constructor (the implicit default constructor)|constructor (the implicit copy constructor)|constructor (the implicit move constructor)|function (the implicit copy assignment operator)|function (the implicit move assignment operator)|function (the implicit 'operator==' for this 'operator<=>)'|inherited constructor}0%select{| template| %2}1 not viable: %select{cannot convert initializer list|too few initializers in list|too many initializers in list}7 argument to %4
root: candidate {$arg0 :select s0=|function| s1=|function| s2=|function (with reversed parameter order)| s3=|constructor| s4=|constructor (the implicit default constructor)| s5=|constructor (the implicit copy constructor)| s6=|constructor (the implicit move constructor)| s7=|function (the implicit copy assignment operator)| s8=|function (the implicit move assignment operator)| s9=|function (the implicit 'operator==' for this 'operator<=>)'| s10=|inherited constructor|}{$arg1 :select s0=|| s1=| template| s2=| {$arg2}|} not viable: {$arg7 :select s0=|cannot convert initializer list| s1=|too few initializers in list| s2=|too many initializers in list|} argument to {$arg4}

# note_ovl_candidate_bad_overload
source: candidate %select{function|function|function (with reversed parameter order)|constructor|constructor (the implicit default constructor)|constructor (the implicit copy constructor)|constructor (the implicit move constructor)|function (the implicit copy assignment operator)|function (the implicit move assignment operator)|function (the implicit 'operator==' for this 'operator<=>)'|inherited constructor}0%select{| template| %2}1 not viable: no overload of %4 matching %3 for %ordinal5 argument
root: candidate {$arg0 :select s0=|function| s1=|function| s2=|function (with reversed parameter order)| s3=|constructor| s4=|constructor (the implicit default constructor)| s5=|constructor (the implicit copy constructor)| s6=|constructor (the implicit move constructor)| s7=|function (the implicit copy assignment operator)| s8=|function (the implicit move assignment operator)| s9=|function (the implicit 'operator==' for this 'operator<=>)'| s10=|inherited constructor|}{$arg1 :select s0=|| s1=| template| s2=| {$arg2}|} not viable: no overload of {$arg4} matching {$arg3} for %ordinal5 argument

# note_ovl_candidate_bad_ownership
source: candidate %select{function|function|function (with reversed parameter order)|constructor|constructor (the implicit default constructor)|constructor (the implicit copy constructor)|constructor (the implicit move constructor)|function (the implicit copy assignment operator)|function (the implicit move assignment operator)|function (the implicit 'operator==' for this 'operator<=>)'|inherited constructor}0%select{| template| %2}1 not viable: %select{%ordinal7|'this'}6 argument (%3) has %select{no|__unsafe_unretained|__strong|__weak|__autoreleasing}4 ownership, but parameter has %select{no|__unsafe_unretained|__strong|__weak|__autoreleasing}5 ownership
root: candidate {$arg0 :select s0=|function| s1=|function| s2=|function (with reversed parameter order)| s3=|constructor| s4=|constructor (the implicit default constructor)| s5=|constructor (the implicit copy constructor)| s6=|constructor (the implicit move constructor)| s7=|function (the implicit copy assignment operator)| s8=|function (the implicit move assignment operator)| s9=|function (the implicit 'operator==' for this 'operator<=>)'| s10=|inherited constructor|}{$arg1 :select s0=|| s1=| template| s2=| {$arg2}|} not viable: {$arg6 :select s0=|%ordinal7| s1=|'this'|} argument ({$arg3}) has {$arg4 :select s0=|no| s1=|__unsafe_unretained| s2=|__strong| s3=|__weak| s4=|__autoreleasing|} ownership, but parameter has {$arg5 :select s0=|no| s1=|__unsafe_unretained| s2=|__strong| s3=|__weak| s4=|__autoreleasing|} ownership

# note_ovl_candidate_bad_ptrauth
source: candidate %select{function|function|function (with reversed parameter order)|constructor|constructor (the implicit default constructor)|constructor (the implicit copy constructor)|constructor (the implicit move constructor)|function (the implicit copy assignment operator)|function (the implicit move assignment operator)|function (the implicit 'operator==' for this 'operator<=>)'|inherited constructor}0%select{| template| %2}1 not viable: %ordinal8 argument (%3) has %select{no '__ptrauth'|%5}4 qualifier, but parameter has %select{no '__ptrauth'|%7}6 qualifier
root: candidate {$arg0 :select s0=|function| s1=|function| s2=|function (with reversed parameter order)| s3=|constructor| s4=|constructor (the implicit default constructor)| s5=|constructor (the implicit copy constructor)| s6=|constructor (the implicit move constructor)| s7=|function (the implicit copy assignment operator)| s8=|function (the implicit move assignment operator)| s9=|function (the implicit 'operator==' for this 'operator<=>)'| s10=|inherited constructor|}{$arg1 :select s0=|| s1=| template| s2=| {$arg2}|} not viable: %ordinal8 argument ({$arg3}) has {$arg4 :select s0=|no '__ptrauth'| s1=|{$arg5}|} qualifier, but parameter has {$arg6 :select s0=|no '__ptrauth'| s1=|{$arg7}|} qualifier

# note_ovl_candidate_bad_target
source: candidate %select{function|function|function (with reversed parameter order)|constructor|constructor (the implicit default constructor)|constructor (the implicit copy constructor)|constructor (the implicit move constructor)|function (the implicit copy assignment operator)|function (the implicit move assignment operator)|function (the implicit 'operator==' for this 'operator<=>)'|inherited constructor}0%select{| template| %2}1 not viable: call to %select{__device__|__global__|__host__|__host__ __device__|invalid}3 function from %select{__device__|__global__|__host__|__host__ __device__|invalid}4 function
root: candidate {$arg0 :select s0=|function| s1=|function| s2=|function (with reversed parameter order)| s3=|constructor| s4=|constructor (the implicit default constructor)| s5=|constructor (the implicit copy constructor)| s6=|constructor (the implicit move constructor)| s7=|function (the implicit copy assignment operator)| s8=|function (the implicit move assignment operator)| s9=|function (the implicit 'operator==' for this 'operator<=>)'| s10=|inherited constructor|}{$arg1 :select s0=|| s1=| template| s2=| {$arg2}|} not viable: call to {$arg3 :select s0=|__device__| s1=|__global__| s2=|__host__| s3=|__host__ __device__| s4=|invalid|} function from {$arg4 :select s0=|__device__| s1=|__global__| s2=|__host__| s3=|__host__ __device__| s4=|invalid|} function
