Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# warn_type_safety_null_pointer_required
source: specified %0 type tag requires a null pointer
root: specified {$arg0} type tag requires a null pointer

# warn_type_safety_type_mismatch
source: argument type %0 doesn't match specified %1 type tag %select{that requires %3|}2
root: argument type {$arg0} doesn't match specified {$arg1} type tag {$arg2 :select s0=|that requires {$arg3}| s1=||}

# warn_typecheck_convert_incompatible_function_pointer_strict
source: incompatible function pointer types %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2%select{|; dereference with *|; take the address with &|; remove *|; remove &}3
root: incompatible function pointer types %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2{$arg3 :select s0=|| s1=|; dereference with *| s2=|; take the address with &| s3=|; remove *| s4=|; remove &|}

# warn_typecheck_function_qualifiers_ignored
source: '%0' qualifier on function type %1 has no effect
root: '{$arg0}' qualifier on function type {$arg1} has no effect

# warn_typecheck_ordered_comparison_of_function_pointers
source: ordered comparison of function pointers (%0 and %1)
root: ordered comparison of function pointers ({$arg0} and {$arg1})

# warn_typecheck_reference_qualifiers
source: '%0' qualifier on reference type %1 has no effect
root: '{$arg0}' qualifier on reference type {$arg1} has no effect

# warn_typecheck_vector_element_sizes_not_equal
source: vector operands do not have the same elements sizes (%0 and %1)
root: vector operands do not have the same elements sizes ({$arg0} and {$arg1})

# warn_unavailable_fwdclass_message
source: %0 may be unavailable because the receiver type is unknown
root: {$arg0} may be unavailable because the receiver type is unknown

# warn_undeclared_selector
source: undeclared selector %0
root: undeclared selector {$arg0}

# warn_undeclared_selector_with_typo
source: undeclared selector %0; did you mean %1?
root: undeclared selector {$arg0}; did you mean {$arg1}?

# warn_undef_interface
source: cannot find interface declaration for %0
root: cannot find interface declaration for {$arg0}

# warn_undef_interface_suggest
source: cannot find interface declaration for %0; did you mean %1?
root: cannot find interface declaration for {$arg0}; did you mean {$arg1}?

# warn_undef_method_impl
source: method definition for %0 not found
root: method definition for {$arg0} not found

# warn_undef_protocolref
source: cannot find protocol definition for %0
root: cannot find protocol definition for {$arg0}

# warn_undefined_inline
source: inline function %q0 is not defined
root: inline function {$arg0 :q} is not defined

# warn_undefined_internal
source: %select{function|variable}0 %q1 has internal linkage but is not defined
root: {$arg0 :select s0=|function| s1=|variable|} {$arg1 :q} has internal linkage but is not defined

# warn_undefined_reinterpret_cast
source: reinterpret_cast from %0 to %1 has undefined behavior
root: reinterpret_cast from {$arg0} to {$arg1} has undefined behavior

# warn_unguarded_availability
source: %0 is only available %select{|in %4 environment }3on %1 %2 or newer
root: {$arg0} is only available {$arg3 :select s0=|| s1=|in {$arg4} environment |}on {$arg1} {$arg2} or newer

# warn_unguarded_availability_new
source: %0 is only available %select{|in %4 environment }3on %1 %2 or newer
root: {$arg0} is only available {$arg3 :select s0=|| s1=|in {$arg4} environment |}on {$arg1} {$arg2} or newer

# warn_unguarded_availability_unavailable
source: %0 is unavailable
root: {$arg0} is unavailable

# warn_unguarded_availability_unavailable_new
source: %0 is unavailable
root: {$arg0} is unavailable

# warn_unhandled_ms_attribute_ignored
source: __declspec attribute %0 is not supported
root: __declspec attribute {$arg0} is not supported

# warn_unimplemented_protocol_method
source: method %0 in protocol %1 not implemented
root: method {$arg0} in protocol {$arg1} not implemented

# warn_unimplemented_selector
source: no method with selector %0 is implemented in this translation unit
root: no method with selector {$arg0} is implemented in this translation unit

# warn_uninit_byref_blockvar_captured_by_block
source: block pointer variable %0 is %select{uninitialized|null}1 when captured by block
root: block pointer variable {$arg0} is {$arg1 :select s0=|uninitialized| s1=|null|} when captured by block

# warn_uninit_const_reference
source: variable %0 is uninitialized when passed as a const reference argument here
root: variable {$arg0} is uninitialized when passed as a const reference argument here

# warn_uninit_self_reference_in_init
source: variable %0 is uninitialized when used within its own initialization
root: variable {$arg0} is uninitialized when used within its own initialization

# warn_uninit_self_reference_in_reference_init
source: reference %0 is not yet bound to a value when used within its own initialization
root: reference {$arg0} is not yet bound to a value when used within its own initialization

# warn_uninit_var
source: variable %0 is uninitialized when %select{used here|captured by block}1
root: variable {$arg0} is uninitialized when {$arg1 :select s0=|used here| s1=|captured by block|}

# warn_unknown_sanitizer_ignored
source: unknown sanitizer '%0' ignored
root: unknown sanitizer '{$arg0}' ignored

# warn_unlock_but_no_lock
source: releasing %0 '%1' that was not held
root: releasing {$arg0} '{$arg1}' that was not held

# warn_unlock_kind_mismatch
source: releasing %0 '%1' using %select{shared|exclusive}2 access, expected %select{shared|exclusive}3 access
root: releasing {$arg0} '{$arg1}' using {$arg2 :select s0=|shared| s1=|exclusive|} access, expected {$arg3 :select s0=|shared| s1=|exclusive|} access

# warn_unmatched_underlying_mutexes
source: %0 managed by '%1' is '%3' instead of '%2'
root: {$arg0} managed by '{$arg1}' is '{$arg3}' instead of '{$arg2}'

# warn_unnecessary_virtual_specifier
source: virtual method %0 is inside a 'final' class and can never be overridden
root: virtual method {$arg0} is inside a 'final' class and can never be overridden

# warn_unneeded_internal_decl
source: %select{function|variable}0 %1 is not needed and will not be emitted
root: {$arg0 :select s0=|function| s1=|variable|} {$arg1} is not needed and will not be emitted

# warn_unneeded_member_function
source: member function %0 is not needed and will not be emitted
root: member function {$arg0} is not needed and will not be emitted

# warn_unneeded_static_internal_decl
source: 'static' function %0 declared in header file should be declared 'static inline'
root: 'static' function {$arg0} declared in header file should be declared 'static inline'

# warn_unqualified_call_to_std_cast_function
source: unqualified call to '%0'
root: unqualified call to '{$arg0}'

# warn_unreachable_association
source: due to lvalue conversion of the controlling expression, association of type %0 will never be selected because it is %select{of array type|qualified}1
root: due to lvalue conversion of the controlling expression, association of type {$arg0} will never be selected because it is {$arg1 :select s0=|of array type| s1=|qualified|}

# warn_unsafe_buffer_libc_call
source: function %0 is unsafe
root: function {$arg0} is unsafe

# warn_unsafe_buffer_variable
source: %0 is an %select{unsafe pointer used for buffer access|unsafe buffer that does not perform bounds checks}1
root: {$arg0} is an {$arg1 :select s0=|unsafe pointer used for buffer access| s1=|unsafe buffer that does not perform bounds checks|}

# warn_unsequenced_mod_mod
source: multiple unsequenced modifications to %0
root: multiple unsequenced modifications to {$arg0}

# warn_unsequenced_mod_use
source: unsequenced modification and access to %0
root: unsequenced modification and access to {$arg0}

# warn_unsigned_abs
source: taking the absolute value of unsigned type %0 has no effect
root: taking the absolute value of unsigned type {$arg0} has no effect

# warn_unsigned_always_true_comparison
source: result of comparison of %select{%3|unsigned expression}0 %2 %select{unsigned expression|%3}0 is always %4
root: result of comparison of {$arg0 :select s0=|{$arg3}| s1=|unsigned expression|} {$arg2} {$arg0 :select s0=|unsigned expression| s1=|{$arg3}|} is always {$arg4}

# warn_unsigned_bitfield_assigned_signed_enum
source: assigning value of signed enum type %1 to unsigned bit-field %0; negative enumerators of enum %1 will be converted to positive values
root: assigning value of signed enum type {$arg1} to unsigned bit-field {$arg0}; negative enumerators of enum {$arg1} will be converted to positive values

# warn_unsigned_char_always_true_comparison
source: result of comparison of %select{%3|char expression}0 %2 %select{char expression|%3}0 is always %4, since char is interpreted as unsigned
root: result of comparison of {$arg0 :select s0=|{$arg3}| s1=|char expression|} {$arg2} {$arg0 :select s0=|char expression| s1=|{$arg3}|} is always {$arg4}, since char is interpreted as unsigned

# warn_unsigned_enum_always_true_comparison
source: result of comparison of %select{%3|unsigned enum expression}0 %2 %select{unsigned enum expression|%3}0 is always %4
root: result of comparison of {$arg0 :select s0=|{$arg3}| s1=|unsigned enum expression|} {$arg2} {$arg0 :select s0=|unsigned enum expression| s1=|{$arg3}|} is always {$arg4}

# warn_unsupported_branch_protection_spec
source: unsupported branch protection specification '%0'
root: unsupported branch protection specification '{$arg0}'

# warn_unsupported_target_attribute
source: %select{unsupported|duplicate|unknown}0%select{| CPU| tune CPU}1 '%2' in the '%select{target|target_clones|target_version}3' attribute string; '%select{target|target_clones|target_version}3' attribute ignored
root: {$arg0 :select s0=|unsupported| s1=|duplicate| s2=|unknown|}{$arg1 :select s0=|| s1=| CPU| s2=| tune CPU|} '{$arg2}' in the '{$arg3 :select s0=|target| s1=|target_clones| s2=|target_version|}' attribute string; '{$arg3 :select s0=|target| s1=|target_clones| s2=|target_version|}' attribute ignored

# warn_unused_but_set_parameter
source: parameter %0 set but not used
root: parameter {$arg0} set but not used

# warn_unused_but_set_variable
source: variable %0 set but not used
root: variable {$arg0} set but not used

# warn_unused_call
source: ignoring return value of function declared with %0 attribute
root: ignoring return value of function declared with {$arg0} attribute

# warn_unused_comparison
source: %select{equality|inequality|relational|three-way}0 comparison result unused
root: {$arg0 :select s0=|equality| s1=|inequality| s2=|relational| s3=|three-way|} comparison result unused

# warn_unused_const_variable
source: unused variable %0
root: unused variable {$arg0}

# warn_unused_exception_param
source: unused exception parameter %0
root: unused exception parameter {$arg0}

# warn_unused_function
source: unused function %0
root: unused function {$arg0}

# warn_unused_label
source: unused label %0
root: unused label {$arg0}

# warn_unused_lambda_capture
source: lambda capture %0 is not %select{used|required to be captured for this use}1
root: lambda capture {$arg0} is not {$arg1 :select s0=|used| s1=|required to be captured for this use|}

# warn_unused_local_typedef
source: unused %select{typedef|type alias}0 %1
root: unused {$arg0 :select s0=|typedef| s1=|type alias|} {$arg1}

# warn_unused_member_function
source: unused member function %0
root: unused member function {$arg0}

# warn_unused_parameter
source: unused parameter %0
root: unused parameter {$arg0}

# warn_unused_private_field
source: private field %0 is not used
root: private field {$arg0} is not used

# warn_unused_property_backing_ivar
source: ivar %0 which backs the property is not referenced in this property's accessor
root: ivar {$arg0} which backs the property is not referenced in this property's accessor

# warn_unused_result_typedef_unsupported_spelling
source: '[[%select{nodiscard|gnu::warn_unused_result}0]]' attribute ignored when applied to a typedef; consider using '__attribute__((warn_unused_result))' or '[[clang::warn_unused_result]]' instead
root: '[[{$arg0 :select s0=|nodiscard| s1=|gnu::warn_unused_result|}]]' attribute ignored when applied to a typedef; consider using '__attribute__((warn_unused_result))' or '[[clang::warn_unused_result]]' instead

# warn_unused_return_type
source: ignoring %select{return value|temporary}0 of type %2 declared with %1 attribute%select{|: %4}3
root: ignoring {$arg0 :select s0=|return value| s1=|temporary|} of type {$arg2} declared with {$arg1} attribute{$arg3 :select s0=|| s1=|: {$arg4}|}

# warn_unused_template
source: unused %select{function|variable}0 template %1
root: unused {$arg0 :select s0=|function| s1=|variable|} template {$arg1}

# warn_unused_variable
source: unused variable %0
root: unused variable {$arg0}

# warn_use_in_invalid_state
source: invalid invocation of method '%0' on object '%1' while it is in the '%2' state
root: invalid invocation of method '{$arg0}' on object '{$arg1}' while it is in the '{$arg2}' state

# warn_use_of_temp_in_invalid_state
source: invalid invocation of method '%0' on a temporary object while it is in the '%1' state
root: invalid invocation of method '{$arg0}' on a temporary object while it is in the '{$arg1}' state

# warn_used_but_marked_unused
source: %0 was marked unused but was used
root: {$arg0} was marked unused but was used

# warn_user_defined_msg_constexpr
source: %select{the message|the expression}0 in %select{this static assertion|this asm operand}0 is not a constant expression
root: {$arg0 :select s0=|the message| s1=|the expression|} in {$arg0 :select s0=|this static assertion| s1=|this asm operand|} is not a constant expression

# warn_user_literal_reserved
source: user-defined literal suffixes %select{<ERROR>|not starting with '_'|containing '__'}0 are reserved%select{; no literal will invoke this operator|}1
root: user-defined literal suffixes {$arg0 :select s0=|<ERROR>| s1=|not starting with '_'| s2=|containing '__'|} are reserved{$arg1 :select s0=|; no literal will invoke this operator| s1=||}

# warn_va_start_type_is_undefined
source: passing %select{an object that undergoes default argument promotion|an object of reference type|a parameter declared with the 'register' keyword}0 to 'va_start' has undefined behavior
root: passing {$arg0 :select s0=|an object that undergoes default argument promotion| s1=|an object of reference type| s2=|a parameter declared with the 'register' keyword|} to 'va_start' has undefined behavior

# warn_var_decl_not_read_only
source: object of type %0 cannot be placed in read-only memory
root: object of type {$arg0} cannot be placed in read-only memory

# warn_var_deref_requires_any_lock
source: %select{reading|writing}1 the value pointed to by %0 requires holding %select{any mutex|any mutex exclusively}1
root: {$arg1 :select s0=|reading| s1=|writing|} the value pointed to by {$arg0} requires holding {$arg1 :select s0=|any mutex| s1=|any mutex exclusively|}

# warn_var_deref_requires_lock
source: %select{reading|writing}3 the value pointed to by %1 requires holding %0 %select{'%2'|'%2' exclusively}3
root: {$arg3 :select s0=|reading| s1=|writing|} the value pointed to by {$arg1} requires holding {$arg0} {$arg3 :select s0=|'{$arg2}'| s1=|'{$arg2}' exclusively|}

# warn_var_deref_requires_lock_precise
source: %select{reading|writing}3 the value pointed to by %1 requires holding %0 %select{'%2'|'%2' exclusively}3
root: {$arg3 :select s0=|reading| s1=|writing|} the value pointed to by {$arg1} requires holding {$arg0} {$arg3 :select s0=|'{$arg2}'| s1=|'{$arg2}' exclusively|}

# warn_var_template_missing
source: instantiation of variable %q0 required here, but no definition is available
root: instantiation of variable {$arg0 :q} required here, but no definition is available

# warn_variable_requires_any_lock
source: %select{reading|writing}1 variable %0 requires holding %select{any mutex|any mutex exclusively}1
root: {$arg1 :select s0=|reading| s1=|writing|} variable {$arg0} requires holding {$arg1 :select s0=|any mutex| s1=|any mutex exclusively|}

# warn_variable_requires_lock
source: %select{reading|writing}3 variable %1 requires holding %0 %select{'%2'|'%2' exclusively}3
root: {$arg3 :select s0=|reading| s1=|writing|} variable {$arg1} requires holding {$arg0} {$arg3 :select s0=|'{$arg2}'| s1=|'{$arg2}' exclusively|}

# warn_variable_requires_lock_precise
source: %select{reading|writing}3 variable %1 requires holding %0 %select{'%2'|'%2' exclusively}3
root: {$arg3 :select s0=|reading| s1=|writing|} variable {$arg1} requires holding {$arg0} {$arg3 :select s0=|'{$arg2}'| s1=|'{$arg2}' exclusively|}

# warn_variable_sized_ivar_visibility
source: field %0 with variable sized type %1 is not visible to subclasses and can conflict with their instance variables
root: field {$arg0} with variable sized type {$arg1} is not visible to subclasses and can conflict with their instance variables

# warn_variables_not_in_loop_body
source: variable%select{s| %1|s %1 and %2|s %1, %2, and %3|s %1, %2, %3, and %4}0 used in loop condition not modified in loop body
root: variable{$arg0 :select s0=|s| s1=| {$arg1}| s2=|s {$arg1} and {$arg2}| s3=|s {$arg1}, {$arg2}, and {$arg3}| s4=|s {$arg1}, {$arg2}, {$arg3}, and {$arg4}|} used in loop condition not modified in loop body

# warn_vbase_moved_multiple_times
source: defaulted move assignment operator of %0 will move assign virtual base class %1 multiple times
root: defaulted move assignment operator of {$arg0} will move assign virtual base class {$arg1} multiple times

# warn_void_pointer_to_enum_cast
source: cast to smaller integer type %1 from %0
root: cast to smaller integer type {$arg1} from {$arg0}

# warn_void_pointer_to_int_cast
source: cast to smaller integer type %1 from %0
root: cast to smaller integer type {$arg1} from {$arg0}

# warn_weak_identifier_undeclared
source: weak identifier %0 never declared
root: weak identifier {$arg0} never declared

# warn_weak_import
source: %0 cannot be declared 'weak_import' because its definition has been provided
root: {$arg0} cannot be declared 'weak_import' because its definition has been provided

# warn_weak_vtable
source: %0 has no out-of-line virtual method definitions; its vtable will be emitted in every translation unit
root: {$arg0} has no out-of-line virtual method definitions; its vtable will be emitted in every translation unit

# warn_wrong_absolute_value_type
source: using %select{integer|floating point|complex}1 absolute value function %0 when argument is of %select{integer|floating point|complex}2 type
root: using {$arg1 :select s0=|integer| s1=|floating point| s2=|complex|} absolute value function {$arg0} when argument is of {$arg2 :select s0=|integer| s1=|floating point| s2=|complex|} type

# warn_xor_used_as_pow
source: result of '%0' is %1; did you mean exponentiation?
root: result of '{$arg0}' is {$arg1}; did you mean exponentiation?

# warn_xor_used_as_pow_base
source: result of '%0' is %1; did you mean '%2'?
root: result of '{$arg0}' is {$arg1}; did you mean '{$arg2}'?

# warn_xor_used_as_pow_base_extra
source: result of '%0' is %1; did you mean '%2' (%3)?
root: result of '{$arg0}' is {$arg1}; did you mean '{$arg2}' ({$arg3})?

# warn_zero_size_struct_union_compat
source: %select{|empty }0%select{struct|union}1 has size 0 in C, %select{size 1|non-zero size}2 in C++
root: {$arg0 :select s0=|| s1=|empty |}{$arg1 :select s0=|struct| s1=|union|} has size 0 in C, {$arg2 :select s0=|size 1| s1=|non-zero size|} in C++

# warn_zero_size_struct_union_in_extern_c
source: %select{|empty }0%select{struct|union}1 has size 0 in C, %select{size 1|non-zero size}2 in C++
root: {$arg0 :select s0=|| s1=|empty |}{$arg1 :select s0=|struct| s1=|union|} has size 0 in C, {$arg2 :select s0=|size 1| s1=|non-zero size|} in C++
