Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# warn_duplicate_enum_values
source: element %0 has been implicitly assigned %1 which another element has been assigned
root: element {$arg0} has been implicitly assigned {$arg1} which another element has been assigned

# warn_duplicate_method_decl
source: multiple declarations of method %0 found and ignored
root: multiple declarations of method {$arg0} found and ignored

# warn_duplicate_protocol_def
source: duplicate protocol definition of %0 is ignored
root: duplicate protocol definition of {$arg0} is ignored

# warn_dyn_class_memaccess
source: %select{destination for|source of|first operand of|second operand of}0 this %1 call is a pointer to %select{|class containing a }2dynamic class %3; vtable pointer will be %select{overwritten|copied|moved|compared}4
root: {$arg0 :select s0=|destination for| s1=|source of| s2=|first operand of| s3=|second operand of|} this {$arg1} call is a pointer to {$arg2 :select s0=|| s1=|class containing a |}dynamic class {$arg3}; vtable pointer will be {$arg4 :select s0=|overwritten| s1=|copied| s2=|moved| s3=|compared|}

# warn_exception_caught_by_earlier_handler
source: exception of type %0 will be caught by earlier handler
root: exception of type {$arg0} will be caught by earlier handler

# warn_excess_precision_not_supported
source: excess precision is requested but the target does not support excess precision which may result in observable differences in complex division behavior%select{|, additional uses where the requested higher precision cannot be honored were found but not diagnosed}0
root: excess precision is requested but the target does not support excess precision which may result in observable differences in complex division behavior{$arg0 :select s0=|| s1=|, additional uses where the requested higher precision cannot be honored were found but not diagnosed|}

# warn_expect_fewer_underlying_mutexes
source: did not expect %0 '%2' to be managed by '%1'
root: did not expect {$arg0} '{$arg2}' to be managed by '{$arg1}'

# warn_expect_more_underlying_mutexes
source: %0 '%2' not managed by '%1'
root: {$arg0} '{$arg2}' not managed by '{$arg1}'

# warn_expecting_lock_held_on_loop
source: expecting %0 '%1' to be held at start of each loop
root: expecting {$arg0} '{$arg1}' to be held at start of each loop

# warn_expecting_locked
source: expecting %0 '%1' to be held at the end of function
root: expecting {$arg0} '{$arg1}' to be held at the end of function

# warn_explicit_instantiation_after_specialization
source: explicit instantiation of %0 that occurs after an explicit specialization has no effect
root: explicit instantiation of {$arg0} that occurs after an explicit specialization has no effect

# warn_explicit_instantiation_must_be_global_0x
source: explicit instantiation of %0 must occur at global scope
root: explicit instantiation of {$arg0} must occur at global scope

# warn_explicit_instantiation_out_of_scope_0x
source: explicit instantiation of %0 not in a namespace enclosing %1
root: explicit instantiation of {$arg0} not in a namespace enclosing {$arg1}

# warn_explicit_instantiation_unqualified_wrong_namespace_0x
source: explicit instantiation of %q0 must occur in namespace %1
root: explicit instantiation of {$arg0 :q} must occur in namespace {$arg1}

# warn_falloff_nonvoid
source: non-void %select{function|block|lambda|coroutine}0 does not return a value%select{| in all control paths}1
root: non-void {$arg0 :select s0=|function| s1=|block| s2=|lambda| s3=|coroutine|} does not return a value{$arg1 :select s0=|| s1=| in all control paths|}

# warn_field_is_uninit
source: field %0 is uninitialized when used here
root: field {$arg0} is uninitialized when used here

# warn_field_requires_explicit_init
source: field %select{%1|in %1}0 requires explicit initialization but is not explicitly initialized
root: field {$arg0 :select s0=|{$arg1}| s1=|in {$arg1}|} requires explicit initialization but is not explicitly initialized

# warn_final_dtor_non_final_class
source: class with destructor marked '%select{final|sealed}0' cannot be inherited from
root: class with destructor marked '{$arg0 :select s0=|final| s1=|sealed|}' cannot be inherited from

# warn_flag_enum_constant_out_of_range
source: enumeration value %0 is out of range of flags in enumeration type %1
root: enumeration value {$arg0} is out of range of flags in enumeration type {$arg1}

# warn_float_compare_literal
source: floating-point comparison is always %select{true|false}0; constant cannot be represented exactly in type %1
root: floating-point comparison is always {$arg0 :select s0=|true| s1=|false|}; constant cannot be represented exactly in type {$arg1}

# warn_float_overflow
source: magnitude of floating-point constant too large for type %0; maximum is %1
root: magnitude of floating-point constant too large for type {$arg0}; maximum is {$arg1}

# warn_float_underflow
source: magnitude of floating-point constant too small for type %0; minimum is %1
root: magnitude of floating-point constant too small for type {$arg0}; minimum is {$arg1}

# warn_for_range_begin_end_types_differ
source: 'begin' and 'end' returning different types (%0 and %1) is incompatible with C++ standards before C++17
root: 'begin' and 'end' returning different types ({$arg0} and {$arg1}) is incompatible with C++ standards before C++17

# warn_for_range_const_ref_binds_temp_built_from_ref
source: loop variable %0 %diff{of type $ binds to a temporary constructed from type $|binds to a temporary constructed from a different type}1,2
root: loop variable {$arg0} %diff{of type $ binds to a temporary constructed from type $|binds to a temporary constructed from a different type}1,2

# warn_for_range_copy
source: loop variable %0 creates a copy from type %1
root: loop variable {$arg0} creates a copy from type {$arg1}

# warn_for_range_ref_binds_ret_temp
source: loop variable %0 binds to a temporary value produced by a range of type %1
root: loop variable {$arg0} binds to a temporary value produced by a range of type {$arg1}

# warn_format_argument_needs_cast
source: %select{values of type|enum values with underlying type}2 '%0' should not be used as format arguments; add an explicit cast to %1 instead
root: {$arg2 :select s0=|values of type| s1=|enum values with underlying type|} '{$arg0}' should not be used as format arguments; add an explicit cast to {$arg1} instead

# warn_format_argument_needs_cast_pedantic
source: %select{values of type|enum values with underlying type}2 '%0' should not be used as format arguments; add an explicit cast to %1 instead
root: {$arg2 :select s0=|values of type| s1=|enum values with underlying type|} '{$arg0}' should not be used as format arguments; add an explicit cast to {$arg1} instead

# warn_format_bool_as_character
source: using '%0' format specifier, but argument has boolean value
root: using '{$arg0}' format specifier, but argument has boolean value

# warn_format_cmp_modifierfor_mismatch
source: format argument modifies specifier at position %0, but it should modify specifier at position %1
root: format argument modifies specifier at position {$arg0}, but it should modify specifier at position {$arg1}

# warn_format_cmp_role_mismatch
source: format argument is %select{a value|an indirect field width|an indirect precision|an auxiliary value}0, but it should be %select{a value|an indirect field width|an indirect precision|an auxiliary value}1
root: format argument is {$arg0 :select s0=|a value| s1=|an indirect field width| s2=|an indirect precision| s3=|an auxiliary value|}, but it should be {$arg1 :select s0=|a value| s1=|an indirect field width| s2=|an indirect precision| s3=|an auxiliary value|}

# warn_format_cmp_sensitivity_mismatch
source: argument sensitivity is %select{unspecified|private|public|sensitive}0, but it should be %select{unspecified|private|public|sensitive}1
root: argument sensitivity is {$arg0 :select s0=|unspecified| s1=|private| s2=|public| s3=|sensitive|}, but it should be {$arg1 :select s0=|unspecified| s1=|private| s2=|public| s3=|sensitive|}

# warn_format_cmp_specifier_arity
source: %select{fewer|more}0 specifiers in format string than expected
root: {$arg0 :select s0=|fewer| s1=|more|} specifiers in format string than expected

# warn_format_cmp_specifier_mismatch
source: format specifier '%0' is incompatible with '%1'
root: format specifier '{$arg0}' is incompatible with '{$arg1}'

# warn_format_cmp_specifier_mismatch_pedantic
source: signedness of format specifier '%0' is incompatible with '%1'
root: signedness of format specifier '{$arg0}' is incompatible with '{$arg1}'

# warn_format_cmp_specifier_sign_mismatch
source: signedness of format specifier '%0' is incompatible with '%1'
root: signedness of format specifier '{$arg0}' is incompatible with '{$arg1}'

# warn_format_conversion_argument_type_mismatch
source: format specifies type %0 but the argument has %select{type|underlying type}2 %1
root: format specifies type {$arg0} but the argument has {$arg2 :select s0=|type| s1=|underlying type|} {$arg1}

# warn_format_conversion_argument_type_mismatch_confusion
source: format specifies type %0 but the argument has %select{type|underlying type}2 %1
root: format specifies type {$arg0} but the argument has {$arg2 :select s0=|type| s1=|underlying type|} {$arg1}

# warn_format_conversion_argument_type_mismatch_pedantic
source: format specifies type %0 but the argument has %select{type|underlying type}2 %1
root: format specifies type {$arg0} but the argument has {$arg2 :select s0=|type| s1=|underlying type|} {$arg1}

# warn_format_conversion_argument_type_mismatch_signedness
source: format specifies type %0 but the argument has %select{type|underlying type}2 %1
root: format specifies type {$arg0} but the argument has {$arg2 :select s0=|type| s1=|underlying type|} {$arg1}

# warn_format_invalid_annotation
source: using '%0' format specifier annotation outside of os_log()/os_trace()
root: using '{$arg0}' format specifier annotation outside of os_log()/os_trace()

# warn_format_invalid_conversion
source: invalid conversion specifier '%0'
root: invalid conversion specifier '{$arg0}'

# warn_format_invalid_positional_specifier
source: invalid position specified for %select{field width|field precision}0
root: invalid position specified for {$arg0 :select s0=|field width| s1=|field precision|}

# warn_format_non_standard
source: '%0' %select{length modifier|conversion specifier}1 is not supported by ISO C
root: '{$arg0}' {$arg1 :select s0=|length modifier| s1=|conversion specifier|} is not supported by ISO C

# warn_format_non_standard_conversion_spec
source: using length modifier '%0' with conversion specifier '%1' is not supported by ISO C
root: using length modifier '{$arg0}' with conversion specifier '{$arg1}' is not supported by ISO C

# warn_format_nonsensical_length
source: length modifier '%0' results in undefined behavior or no effect with '%1' conversion specifier
root: length modifier '{$arg0}' results in undefined behavior or no effect with '{$arg1}' conversion specifier

# warn_format_overflow
source: '%0' will always overflow; destination buffer has size %1, but format string expands to at least %2
root: '{$arg0}' will always overflow; destination buffer has size {$arg1}, but format string expands to at least {$arg2}

# warn_format_overflow_non_kprintf
source: '%0' will always overflow; destination buffer has size %1, but format string expands to at least %2
root: '{$arg0}' will always overflow; destination buffer has size {$arg1}, but format string expands to at least {$arg2}

# warn_format_string_type_incompatible
source: passing '%0' format string where '%1' format string is expected
root: passing '{$arg0}' format string where '{$arg1}' format string is expected

# warn_format_truncation
source: '%0' will always be truncated; specified size is %1, but format string expands to at least %2
root: '{$arg0}' will always be truncated; specified size is {$arg1}, but format string expands to at least {$arg2}

# warn_format_truncation_non_kprintf
source: '%0' will always be truncated; specified size is %1, but format string expands to at least %2
root: '{$arg0}' will always be truncated; specified size is {$arg1}, but format string expands to at least {$arg2}

# warn_fortify_scanf_overflow
source: '%0' may overflow; destination buffer in argument %1 has size %2, but the corresponding specifier may require size %3
root: '{$arg0}' may overflow; destination buffer in argument {$arg1} has size {$arg2}, but the corresponding specifier may require size {$arg3}

# warn_fortify_source_overflow
source: '%0' will always overflow; destination buffer has size %1, but size argument is %2
root: '{$arg0}' will always overflow; destination buffer has size {$arg1}, but size argument is {$arg2}

# warn_fortify_source_size_mismatch
source: '%0' size argument is too large; destination buffer has size %1, but size argument is %2
root: '{$arg0}' size argument is too large; destination buffer has size {$arg1}, but size argument is {$arg2}

# warn_fortify_strlen_overflow
source: '%0' will always overflow; destination buffer has size %1, but the source string has length %2 (including NUL byte)
root: '{$arg0}' will always overflow; destination buffer has size {$arg1}, but the source string has length {$arg2} (including NUL byte)

# warn_forward_class_redefinition
source: redefinition of forward class %0 of a typedef name of an object type is ignored
root: redefinition of forward class {$arg0} of a typedef name of an object type is ignored

# warn_frame_address
source: calling '%0' with a nonzero argument is unsafe
root: calling '{$arg0}' with a nonzero argument is unsafe

# warn_free_nonheap_object
source: attempt to call %0 on non-heap %select{object %2|object: block expression|object: lambda-to-function-pointer conversion}1
root: attempt to call {$arg0} on non-heap {$arg1 :select s0=|object {$arg2}| s1=|object: block expression| s2=|object: lambda-to-function-pointer conversion|}

# warn_fun_excludes_mutex
source: cannot call function '%1' while %0 '%2' is held
root: cannot call function '{$arg1}' while {$arg0} '{$arg2}' is held

# warn_fun_requires_lock
source: calling function %1 requires holding %0 %select{'%2'|'%2' exclusively}3
root: calling function {$arg1} requires holding {$arg0} {$arg3 :select s0=|'{$arg2}'| s1=|'{$arg2}' exclusively|}

# warn_fun_requires_lock_precise
source: calling function %1 requires holding %0 %select{'%2'|'%2' exclusively}3
root: calling function {$arg1} requires holding {$arg0} {$arg3 :select s0=|'{$arg2}'| s1=|'{$arg2}' exclusively|}

# warn_fun_requires_negative_cap
source: calling function %0 requires negative capability '%1'
root: calling function {$arg0} requires negative capability '{$arg1}'

# warn_func_effect_calls_expr_without_effect
source: %select{function|constructor|destructor|lambda|block|member initializer of constructor}0 with '%1' attribute must not call non-'%1' expression
root: {$arg0 :select s0=|function| s1=|constructor| s2=|destructor| s3=|lambda| s4=|block| s5=|member initializer of constructor|} with '{$arg1}' attribute must not call non-'{$arg1}' expression

# warn_func_effect_calls_func_without_effect
source: %select{function|constructor|destructor|lambda|block|member initializer of constructor}0 with '%1' attribute must not call non-'%1' %select{function|constructor|destructor|lambda|block}2 '%3'
root: {$arg0 :select s0=|function| s1=|constructor| s2=|destructor| s3=|lambda| s4=|block| s5=|member initializer of constructor|} with '{$arg1}' attribute must not call non-'{$arg1}' {$arg2 :select s0=|function| s1=|constructor| s2=|destructor| s3=|lambda| s4=|block|} '{$arg3}'

# warn_func_effect_violation
source: %select{function|constructor|destructor|lambda|block|member initializer of constructor}0 with '%1' attribute must not %select{allocate or deallocate memory|throw or catch exceptions|have static local variables|use thread-local variables|access ObjC methods or properties}2
root: {$arg0 :select s0=|function| s1=|constructor| s2=|destructor| s3=|lambda| s4=|block| s5=|member initializer of constructor|} with '{$arg1}' attribute must not {$arg2 :select s0=|allocate or deallocate memory| s1=|throw or catch exceptions| s2=|have static local variables| s3=|use thread-local variables| s4=|access ObjC methods or properties|}

# warn_func_template_missing
source: instantiation of function %q0 required here, but no definition is available
root: instantiation of function {$arg0 :q} required here, but no definition is available

# warn_function_attribute_ignored_in_stmt
source: attribute is ignored on this statement as it only applies to functions; use '%0' on statements
root: attribute is ignored on this statement as it only applies to functions; use '{$arg0}' on statements

# warn_function_stmt_attribute_precedence
source: statement attribute %0 has higher precedence than function attribute '%select{always_inline|flatten|noinline}1'
root: statement attribute {$arg0} has higher precedence than function attribute '{$arg1 :select s0=|always_inline| s1=|flatten| s2=|noinline|}'

# warn_gcc_ignores_type_attr
source: GCC does not allow the %0 attribute to be written on a type
root: GCC does not allow the {$arg0} attribute to be written on a type

# warn_gcc_requires_variadic_function
source: GCC requires a function with the %0 attribute to be variadic
root: GCC requires a function with the {$arg0} attribute to be variadic

# warn_guarded_pass_by_reference
source: passing variable %1 by reference requires holding %0 %select{'%2'|'%2' exclusively}3
root: passing variable {$arg1} by reference requires holding {$arg0} {$arg3 :select s0=|'{$arg2}'| s1=|'{$arg2}' exclusively|}

# warn_guarded_pass_pointer
source: passing pointer to variable %1 requires holding %0 %select{'%2'|'%2' exclusively}3
root: passing pointer to variable {$arg1} requires holding {$arg0} {$arg3 :select s0=|'{$arg2}'| s1=|'{$arg2}' exclusively|}

# warn_guarded_return_by_reference
source: returning variable %1 by reference requires holding %0 %select{'%2'|'%2' exclusively}3
root: returning variable {$arg1} by reference requires holding {$arg0} {$arg3 :select s0=|'{$arg2}'| s1=|'{$arg2}' exclusively|}

# warn_guarded_return_pointer
source: returning pointer to variable %1 requires holding %0 %select{'%2'|'%2' exclusively}3
root: returning pointer to variable {$arg1} requires holding {$arg0} {$arg3 :select s0=|'{$arg2}'| s1=|'{$arg2}' exclusively|}

# warn_hlsl_availability
source: %0 is only available %select{|in %4 environment }3on %1 %2 or newer
root: {$arg0} is only available {$arg3 :select s0=|| s1=|in {$arg4} environment |}on {$arg1} {$arg2} or newer

# warn_hlsl_availability_unavailable
source: %0 is unavailable
root: {$arg0} is unavailable

# warn_hlsl_impcast_vector_truncation
source: implicit conversion truncates vector: %0 to %1
root: implicit conversion truncates vector: {$arg0} to {$arg1}

# warn_hlsl_user_defined_type_missing_member
source: binding type '%select{t|u|b|s|c}0' only applies to types containing %select{SRV resources|UAV resources|constant buffer resources|sampler state|numeric types}0
root: binding type '{$arg0 :select s0=|t| s1=|u| s2=|b| s3=|s| s4=|c|}' only applies to types containing {$arg0 :select s0=|SRV resources| s1=|UAV resources| s2=|constant buffer resources| s3=|sampler state| s4=|numeric types|}

# warn_iboutlet_object_type
source: %select{instance variable|property}2 with %0 attribute must be an object type (invalid %1)
root: {$arg2 :select s0=|instance variable| s1=|property|} with {$arg0} attribute must be an object type (invalid {$arg1})

# warn_identity_field_assign
source: assigning %select{field|instance variable}0 to itself
root: assigning {$arg0 :select s0=|field| s1=|instance variable|} to itself

# warn_ignored_ms_inheritance
source: inheritance model ignored on %select{primary template|partial specialization}0
root: inheritance model ignored on {$arg0 :select s0=|primary template| s1=|partial specialization|}

# warn_ignored_objc_externally_retained
source: 'objc_externally_retained' can only be applied to local variables %select{of retainable type|with strong ownership}0
root: 'objc_externally_retained' can only be applied to local variables {$arg0 :select s0=|of retainable type| s1=|with strong ownership|}

# warn_imp_cast_drops_unaligned
source: implicit cast from type %0 to type %1 drops __unaligned qualifier
root: implicit cast from type {$arg0} to type {$arg1} drops __unaligned qualifier

# warn_impcast_bitfield_precision_constant
source: implicit truncation from %2 to bit-field changes value from %0 to %1
root: implicit truncation from {$arg2} to bit-field changes value from {$arg0} to {$arg1}

# warn_impcast_bool_to_null_pointer
source: initialization of pointer of type %0 to null from a constant boolean expression
root: initialization of pointer of type {$arg0} to null from a constant boolean expression

# warn_impcast_complex_scalar
source: implicit conversion discards imaginary component: %0 to %1
root: implicit conversion discards imaginary component: {$arg0} to {$arg1}

# warn_impcast_constant_value_to_objc_bool
source: implicit conversion from constant value %0 to 'BOOL'; the only well defined values for 'BOOL' are YES and NO
root: implicit conversion from constant value {$arg0} to 'BOOL'; the only well defined values for 'BOOL' are YES and NO

# warn_impcast_different_enum_types
source: implicit conversion from enumeration type %0 to different enumeration type %1
root: implicit conversion from enumeration type {$arg0} to different enumeration type {$arg1}

# warn_impcast_double_promotion
source: implicit conversion increases floating-point precision: %0 to %1
root: implicit conversion increases floating-point precision: {$arg0} to {$arg1}

# warn_impcast_fixed_point_range
source: implicit conversion from %0 cannot fit within the range of values for %1
root: implicit conversion from {$arg0} cannot fit within the range of values for {$arg1}

# warn_impcast_float_integer
source: implicit conversion turns floating-point number into integer: %0 to %1
root: implicit conversion turns floating-point number into integer: {$arg0} to {$arg1}

# warn_impcast_float_precision
source: implicit conversion loses floating-point precision: %0 to %1
root: implicit conversion loses floating-point precision: {$arg0} to {$arg1}

# warn_impcast_float_result_precision
source: implicit conversion when assigning computation result loses floating-point precision: %0 to %1
root: implicit conversion when assigning computation result loses floating-point precision: {$arg0} to {$arg1}

# warn_impcast_float_to_integer
source: implicit conversion from %0 to %1 changes value from %2 to %3
root: implicit conversion from {$arg0} to {$arg1} changes value from {$arg2} to {$arg3}

# warn_impcast_float_to_integer_out_of_range
source: implicit conversion of out of range value from %0 to %1 is undefined
root: implicit conversion of out of range value from {$arg0} to {$arg1} is undefined

# warn_impcast_float_to_integer_zero
source: implicit conversion from %0 to %1 changes non-zero value from %2 to %3
root: implicit conversion from {$arg0} to {$arg1} changes non-zero value from {$arg2} to {$arg3}

# warn_impcast_float_to_objc_signed_char_bool
source: implicit conversion from floating-point type %0 to 'BOOL'
root: implicit conversion from floating-point type {$arg0} to 'BOOL'

# warn_impcast_floating_point_to_bool
source: implicit conversion turns floating-point number into bool: %0 to %1
root: implicit conversion turns floating-point number into bool: {$arg0} to {$arg1}

# warn_impcast_int_to_enum
source: implicit conversion from %0 to enumeration type %1 is invalid in C++
root: implicit conversion from {$arg0} to enumeration type {$arg1} is invalid in C++
