Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# warn_attr_swift_name_subscript_setter_multiple_newValues
source: %0 attribute for 'subscript' setter cannot have multiple 'newValue:' parameters
root: {$arg0} attribute for 'subscript' setter cannot have multiple 'newValue:' parameters

# warn_attr_swift_name_subscript_setter_no_newValue
source: %0 attribute for 'subscript' setter must have a 'newValue:' parameter
root: {$arg0} attribute for 'subscript' setter must have a 'newValue:' parameter

# warn_attribute_after_definition_ignored
source: attribute %0 after definition is ignored
root: attribute {$arg0} after definition is ignored

# warn_attribute_argument_n_negative
source: %0 attribute parameter %1 is negative and will be ignored
root: {$arg0} attribute parameter {$arg1} is negative and will be ignored

# warn_attribute_dll_instantiated_base_class
source: propagating dll attribute to %select{already instantiated|explicitly specialized}0 base class template without dll attribute is not supported
root: propagating dll attribute to {$arg0 :select s0=|already instantiated| s1=|explicitly specialized|} base class template without dll attribute is not supported

# warn_attribute_dll_redeclaration
source: redeclaration of %q0 should not add %q1 attribute
root: redeclaration of {$arg0 :q} should not add {$arg1 :q} attribute

# warn_attribute_exclude_from_explicit_instantiation_local_class
source: %0 attribute ignored on local class%select{| member}1
root: {$arg0} attribute ignored on local class{$arg1 :select s0=|| s1=| member|}

# warn_attribute_form_ignored
source: %0 attribute ignored because Clang does not yet support this attribute signature
root: {$arg0} attribute ignored because Clang does not yet support this attribute signature

# warn_attribute_has_no_effect_on_compile_time_if
source: attribute %0 has no effect when annotating an 'if %select{constexpr|consteval}1' statement
root: attribute {$arg0} has no effect when annotating an 'if {$arg1 :select s0=|constexpr| s1=|consteval|}' statement

# warn_attribute_has_no_effect_on_infinite_loop
source: attribute %0 has no effect when annotating an infinite loop
root: attribute {$arg0} has no effect when annotating an infinite loop

# warn_attribute_iboutlet
source: %0 attribute can only be applied to instance variables or properties
root: {$arg0} attribute can only be applied to instance variables or properties

# warn_attribute_ignored_for_field_of_type
source: %0 attribute ignored for field of type %1
root: {$arg0} attribute ignored for field of type {$arg1}

# warn_attribute_ignored_no_calls_in_stmt
source: %0 attribute is ignored because there exists no call expression inside the statement
root: {$arg0} attribute is ignored because there exists no call expression inside the statement

# warn_attribute_ignored_non_function_pointer
source: %0 attribute is ignored because %1 is not a function pointer
root: {$arg0} attribute is ignored because {$arg1} is not a function pointer

# warn_attribute_ignored_on_inline
source: %0 attribute ignored on inline function
root: {$arg0} attribute ignored on inline function

# warn_attribute_ignored_on_non_definition
source: %0 attribute ignored on a non-definition declaration
root: {$arg0} attribute ignored on a non-definition declaration

# warn_attribute_invalid_on_definition
source: '%0' attribute cannot be specified on a definition
root: '{$arg0}' attribute cannot be specified on a definition

# warn_attribute_no_builtin_invalid_builtin_name
source: '%0' is not a valid builtin name for %1
root: '{$arg0}' is not a valid builtin name for {$arg1}

# warn_attribute_non_character_array
source: %0%select{ attribute|}1 only applies to fields or variables of character array type; type is %2
root: {$arg0}{$arg1 :select s0=| attribute| s1=||} only applies to fields or variables of character array type; type is {$arg2}

# warn_attribute_not_on_decl
source: %0 attribute ignored when parsing type
root: {$arg0} attribute ignored when parsing type

# warn_attribute_on_void_param
source: attribute %0 cannot be applied to a 'void' parameter
root: attribute {$arg0} cannot be applied to a 'void' parameter

# warn_attribute_pointer_or_reference_only
source: %0 attribute only applies to a pointer or reference (%1 is invalid)
root: {$arg0} attribute only applies to a pointer or reference ({$arg1} is invalid)

# warn_attribute_pointers_only
source: %0 attribute only applies to%select{| constant}1 pointer arguments
root: {$arg0} attribute only applies to{$arg1 :select s0=|| s1=| constant|} pointer arguments

# warn_attribute_return_pointers_only
source: %0 attribute only applies to return values that are pointers
root: {$arg0} attribute only applies to return values that are pointers

# warn_attribute_return_pointers_refs_only
source: %0 attribute only applies to return values that are pointers or references
root: {$arg0} attribute only applies to return values that are pointers or references

# warn_attribute_section_drectve
source: #pragma %0(".drectve") has undefined behavior, use #pragma comment(linker, ...) instead
root: #pragma {$arg0}(".drectve") has undefined behavior, use #pragma comment(linker, ...) instead

# warn_attribute_sentinel_not_variadic
source: 'sentinel' attribute only supported for variadic %select{functions|blocks}0
root: 'sentinel' attribute only supported for variadic {$arg0 :select s0=|functions| s1=|blocks|}

# warn_attribute_type_not_supported
source: %0 attribute argument not supported: %1
root: {$arg0} attribute argument not supported: {$arg1}

# warn_attribute_type_not_supported_global
source: %0 attribute argument '%1' not supported on a global variable
root: {$arg0} attribute argument '{$arg1}' not supported on a global variable

# warn_attribute_unknown_visibility
source: unknown visibility %0
root: unknown visibility {$arg0}

# warn_attribute_void_function_method
source: attribute %0 cannot be applied to %select{functions|Objective-C method}1 without return value
root: attribute {$arg0} cannot be applied to {$arg1 :select s0=|functions| s1=|Objective-C method|} without return value

# warn_attribute_wrong_decl_type_str
source: %0%select{ attribute|}1 only applies to %2
root: {$arg0}{$arg1 :select s0=| attribute| s1=||} only applies to {$arg2}

# warn_attributes_likelihood_ifstmt_conflict
source: conflicting attributes %0 are ignored
root: conflicting attributes {$arg0} are ignored

# warn_auto_readonly_iboutlet_property
source: readonly IBOutlet property %0 when auto-synthesized may not work correctly with 'nib' loader
root: readonly IBOutlet property {$arg0} when auto-synthesized may not work correctly with 'nib' loader

# warn_auto_synthesizing_protocol_property
source: auto property synthesis will not synthesize property %0 declared in protocol %1
root: auto property synthesis will not synthesize property {$arg0} declared in protocol {$arg1}

# warn_auto_var_is_id
source: 'auto' deduced as 'id' in declaration of %0
root: 'auto' deduced as 'id' in declaration of {$arg0}

# warn_autosynthesis_property_in_superclass
source: auto property synthesis will not synthesize property %0; it will be implemented by its superclass, use @dynamic to acknowledge intention
root: auto property synthesis will not synthesize property {$arg0}; it will be implemented by its superclass, use @dynamic to acknowledge intention

# warn_autosynthesis_property_ivar_match
source: autosynthesized property %0 will use %select{|synthesized}1 instance variable %2, not existing instance variable %3
root: autosynthesized property {$arg0} will use {$arg1 :select s0=|| s1=|synthesized|} instance variable {$arg2}, not existing instance variable {$arg3}

# warn_availability_on_static_initializer
source: ignoring availability attribute %select{on '+load' method|with constructor attribute|with destructor attribute}0
root: ignoring availability attribute {$arg0 :select s0=|on '+load' method| s1=|with constructor attribute| s2=|with destructor attribute|}

# warn_availability_unknown_environment
source: unknown environment %0 in availability macro
root: unknown environment {$arg0} in availability macro

# warn_availability_unknown_platform
source: unknown platform %0 in availability macro
root: unknown platform {$arg0} in availability macro

# warn_availability_version_ordering
source: feature cannot be %select{introduced|deprecated|obsoleted}0 in %1 version %2 before it was %select{introduced|deprecated|obsoleted}3 in version %4; attribute ignored
root: feature cannot be {$arg0 :select s0=|introduced| s1=|deprecated| s2=|obsoleted|} in {$arg1} version {$arg2} before it was {$arg3 :select s0=|introduced| s1=|deprecated| s2=|obsoleted|} in version {$arg4}; attribute ignored

# warn_bad_cxx_cast_nested_pointer_addr_space
source: %select{reinterpret_cast|C-style cast}0 from %1 to %2 changes address space of nested pointers
root: {$arg0 :select s0=|reinterpret_cast| s1=|C-style cast|} from {$arg1} to {$arg2} changes address space of nested pointers

# warn_bad_function_cast
source: cast from function call of type %0 to non-matching type %1
root: cast from function call of type {$arg0} to non-matching type {$arg1}

# warn_bad_receiver_type
source: receiver type %0 is not 'id' or interface pointer, consider casting it to 'id'
root: receiver type {$arg0} is not 'id' or interface pointer, consider casting it to 'id'

# warn_base_class_is_uninit
source: base class %0 is uninitialized when used here to access %q1
root: base class {$arg0} is uninitialized when used here to access {$arg1 :q}

# warn_bind_ref_member_to_parameter
source: binding reference member %0 to stack allocated %select{variable|parameter}2 %1
root: binding reference member {$arg0} to stack allocated {$arg2 :select s0=|variable| s1=|parameter|} {$arg1}

# warn_bitfield_too_small_for_enum
source: bit-field %0 is not wide enough to store all enumerators of %1
root: bit-field {$arg0} is not wide enough to store all enumerators of {$arg1}

# warn_bitfield_width_exceeds_type_width
source: width of bit-field %0 (%1 bits) exceeds the width of its type; value will be truncated to %2 bit%s2
root: width of bit-field {$arg0} ({$arg1} bits) exceeds the width of its type; value will be truncated to {$arg2} bit%s2

# warn_bitwise_instead_of_logical
source: use of bitwise '%0' with boolean operands
root: use of bitwise '{$arg0}' with boolean operands

# warn_bitwise_negation_bool
source: bitwise negation of a boolean expression%select{;| always evaluates to 'true';}0 did you mean logical negation?
root: bitwise negation of a boolean expression{$arg0 :select s0=|;| s1=| always evaluates to 'true';|} did you mean logical negation?

# warn_bitwise_op_in_bitwise_op
source: '%0' within '%1'
root: '{$arg0}' within '{$arg1}'

# warn_block_literal_attributes_on_omitted_return_type
source: attribute %0 ignored, because it cannot be applied to omitted return type
root: attribute {$arg0} ignored, because it cannot be applied to omitted return type

# warn_block_literal_qualifiers_on_omitted_return_type
source: '%0' qualifier on omitted return type %1 has no effect
root: '{$arg0}' qualifier on omitted return type {$arg1} has no effect

# warn_braces_around_init
source: braces around %select{scalar |}0initializer
root: braces around {$arg0 :select s0=|scalar | s1=||}initializer

# warn_builtin_chk_overflow
source: '%0' will always overflow; destination buffer has size %1, but size argument is %2
root: '{$arg0}' will always overflow; destination buffer has size {$arg1}, but size argument is {$arg2}

# warn_builtin_unknown
source: use of unknown builtin %0
root: use of unknown builtin {$arg0}

# warn_c2y_compat_assoc_type_incomplete
source: use of incomplete type %0 in a '_Generic' association is incompatible with C standards before C2y
root: use of incomplete type {$arg0} in a '_Generic' association is incompatible with C standards before C2y

# warn_c2y_compat_increment_complex
source: '%select{--|++}0' on an object of complex type is incompatible with C standards before C2y
root: '{$arg0 :select s0=|--| s1=|++|}' on an object of complex type is incompatible with C standards before C2y

# warn_c17_compat_enum_value_not_int
source: %select{|incremented }0enumerator value which exceeds the range of 'int' is incompatible with C standards before C23 (%1 is too %select{small|large}2)
root: {$arg0 :select s0=|| s1=|incremented |}enumerator value which exceeds the range of 'int' is incompatible with C standards before C23 ({$arg1} is too {$arg2 :select s0=|small| s1=|large|})

# warn_call_to_pure_virtual_member_function_from_ctor_dtor
source: call to pure virtual member function %0 has undefined behavior; overrides of %0 in subclasses are not available in the %select{constructor|destructor}1 of %2
root: call to pure virtual member function {$arg0} has undefined behavior; overrides of {$arg0} in subclasses are not available in the {$arg1 :select s0=|constructor| s1=|destructor|} of {$arg2}

# warn_call_wrong_number_of_arguments
source: too %select{few|many}0 arguments in call to %1
root: too {$arg0 :select s0=|few| s1=|many|} arguments in call to {$arg1}

# warn_called_once_gets_called_twice
source: %0 parameter marked 'called_once' is called twice
root: {$arg0} parameter marked 'called_once' is called twice

# warn_called_once_never_called
source: %select{|captured }1%0 parameter marked 'called_once' is never called
root: {$arg1 :select s0=|| s1=|captured |}{$arg0} parameter marked 'called_once' is never called

# warn_called_once_never_called_when
source: %0 parameter marked 'called_once' is never %select{used|called}1 when %select{taking true branch|taking false branch|handling this case|none of the cases applies|entering the loop|skipping the loop|taking one of the branches}2
root: {$arg0} parameter marked 'called_once' is never {$arg1 :select s0=|used| s1=|called|} when {$arg2 :select s0=|taking true branch| s1=|taking false branch| s2=|handling this case| s3=|none of the cases applies| s4=|entering the loop| s5=|skipping the loop| s6=|taking one of the branches|}

# warn_cannot_pass_non_pod_arg_to_vararg
source: cannot pass object of %select{non-POD|non-trivial}0 type %1 through variadic %select{function|block|method|constructor}2; call will abort at runtime
root: cannot pass object of {$arg0 :select s0=|non-POD| s1=|non-trivial|} type {$arg1} through variadic {$arg2 :select s0=|function| s1=|block| s2=|method| s3=|constructor|}; call will abort at runtime

# warn_case_value_overflow
source: overflow converting case value to switch condition type (%0 to %1)
root: overflow converting case value to switch condition type ({$arg0} to {$arg1})

# warn_cast_align
source: cast from %0 to %1 increases required alignment from %2 to %3
root: cast from {$arg0} to {$arg1} increases required alignment from {$arg2} to {$arg3}

# warn_cast_calling_conv
source: cast between incompatible calling conventions '%0' and '%1'; calls through this pointer may abort at runtime
root: cast between incompatible calling conventions '{$arg0}' and '{$arg1}'; calls through this pointer may abort at runtime

# warn_cast_nonnull_to_bool
source: nonnull %select{function call|parameter}0 '%1' will evaluate to 'true' on first encounter
root: nonnull {$arg0 :select s0=|function call| s1=|parameter|} '{$arg1}' will evaluate to 'true' on first encounter

# warn_cast_pointer_from_sel
source: cast of type %0 to %1 is deprecated; use sel_getName instead
root: cast of type {$arg0} to {$arg1} is deprecated; use sel_getName instead

# warn_cast_qual
source: cast from %0 to %1 drops %select{const and volatile qualifiers|const qualifier|volatile qualifier}2
root: cast from {$arg0} to {$arg1} drops {$arg2 :select s0=|const and volatile qualifiers| s1=|const qualifier| s2=|volatile qualifier|}

# warn_cast_qual2
source: cast from %0 to %1 must have all intermediate pointers const qualified to be safe
root: cast from {$arg0} to {$arg1} must have all intermediate pointers const qualified to be safe

# warn_cconv_knr
source: function with no prototype cannot use the %0 calling convention
root: function with no prototype cannot use the {$arg0} calling convention

# warn_cconv_unsupported
source: %0 calling convention is not supported %select{for this target|on variadic function|on constructor/destructor|on builtin function}1
root: {$arg0} calling convention is not supported {$arg1 :select s0=|for this target| s1=|on variadic function| s2=|on constructor/destructor| s3=|on builtin function|}

# warn_cdtor_function_try_handler_mem_expr
source: cannot refer to a non-static member from the handler of a %select{constructor|destructor}0 function try block
root: cannot refer to a non-static member from the handler of a {$arg0 :select s0=|constructor| s1=|destructor|} function try block

# warn_cmse_nonsecure_union
source: passing union across security boundary via %select{parameter %1|return value}0 may leak information
root: passing union across security boundary via {$arg0 :select s0=|parameter {$arg1}| s1=|return value|} may leak information

# warn_collection_expr_type
source: collection expression type %0 may not respond to %1
root: collection expression type {$arg0} may not respond to {$arg1}

# warn_comparison_bitwise_always
source: bitwise comparison always evaluates to %select{false|true}0
root: bitwise comparison always evaluates to {$arg0 :select s0=|false| s1=|true|}

# warn_comparison_in_fold_expression
source: comparison in fold expression would evaluate to '(X %0 Y) %0 Z' which does not behave the same as a mathematical expression
root: comparison in fold expression would evaluate to '(X {$arg0} Y) {$arg0} Z' which does not behave the same as a mathematical expression

# warn_comparison_mixed_enum_types
source: %select{arithmetic between|bitwise operation between|comparison of|conditional expression between|compound assignment of}0 different enumeration types%diff{ ($ and $)|}1,2
root: {$arg0 :select s0=|arithmetic between| s1=|bitwise operation between| s2=|comparison of| s3=|conditional expression between| s4=|compound assignment of|} different enumeration types%diff{ ($ and $)|}1,2

# warn_comparison_mixed_enum_types_cxx20
source: %select{arithmetic between|bitwise operation between|comparison of|conditional expression between|compound assignment of}0 different enumeration types%diff{ ($ and $)|}1,2 is deprecated
root: {$arg0 :select s0=|arithmetic between| s1=|bitwise operation between| s2=|comparison of| s3=|conditional expression between| s4=|compound assignment of|} different enumeration types%diff{ ($ and $)|}1,2 is deprecated

# warn_comparison_unicode_mixed_types
source: comparing values of different Unicode code unit types %0 and %1 may compare different code points
root: comparing values of different Unicode code unit types {$arg0} and {$arg1} may compare different code points

# warn_comparison_unicode_mixed_types_constant
source: comparing values of different Unicode code unit types %0 and %1 compares unrelated code units '%2' and '%3'
root: comparing values of different Unicode code unit types {$arg0} and {$arg1} compares unrelated code units '{$arg2}' and '{$arg3}'

# warn_completion_handler_never_called
source: %select{|captured }1completion handler is never called
root: {$arg1 :select s0=|| s1=|captured |}completion handler is never called

# warn_completion_handler_never_called_when
source: completion handler is never %select{used|called}1 when %select{taking true branch|taking false branch|handling this case|none of the cases applies|entering the loop|skipping the loop|taking one of the branches}2
root: completion handler is never {$arg1 :select s0=|used| s1=|called|} when {$arg2 :select s0=|taking true branch| s1=|taking false branch| s2=|handling this case| s3=|none of the cases applies| s4=|entering the loop| s5=|skipping the loop| s6=|taking one of the branches|}

# warn_conditional_mixed_enum_types
source: %select{arithmetic between|bitwise operation between|comparison of|conditional expression between|compound assignment of}0 different enumeration types%diff{ ($ and $)|}1,2
root: {$arg0 :select s0=|arithmetic between| s1=|bitwise operation between| s2=|comparison of| s3=|conditional expression between| s4=|compound assignment of|} different enumeration types%diff{ ($ and $)|}1,2

# warn_conditional_mixed_enum_types_cxx20
source: %select{arithmetic between|bitwise operation between|comparison of|conditional expression between|compound assignment of}0 different enumeration types%diff{ ($ and $)|}1,2 is deprecated
root: {$arg0 :select s0=|arithmetic between| s1=|bitwise operation between| s2=|comparison of| s3=|conditional expression between| s4=|compound assignment of|} different enumeration types%diff{ ($ and $)|}1,2 is deprecated

# warn_conflicting_func_effects
source: effects conflict when merging declarations; kept '%0', discarded '%1'
root: effects conflict when merging declarations; kept '{$arg0}', discarded '{$arg1}'

# warn_conflicting_overriding_param_modifiers
source: conflicting distributed object modifiers on parameter type in declaration of %0
root: conflicting distributed object modifiers on parameter type in declaration of {$arg0}

# warn_conflicting_overriding_param_types
source: conflicting parameter types in declaration of %0%diff{: $ vs $|}1,2
root: conflicting parameter types in declaration of {$arg0}%diff{: $ vs $|}1,2

# warn_conflicting_overriding_ret_type_modifiers
source: conflicting distributed object modifiers on return type in declaration of %0
root: conflicting distributed object modifiers on return type in declaration of {$arg0}

# warn_conflicting_overriding_ret_types
source: conflicting return type in declaration of %0%diff{: $ vs $|}1,2
root: conflicting return type in declaration of {$arg0}%diff{: $ vs $|}1,2

# warn_conflicting_param_modifiers
source: conflicting distributed object modifiers on parameter type in implementation of %0
root: conflicting distributed object modifiers on parameter type in implementation of {$arg0}

# warn_conflicting_param_types
source: conflicting parameter types in implementation of %0%diff{: $ vs $|}1,2
root: conflicting parameter types in implementation of {$arg0}%diff{: $ vs $|}1,2

# warn_conflicting_ret_type_modifiers
source: conflicting distributed object modifiers on return type in implementation of %0
root: conflicting distributed object modifiers on return type in implementation of {$arg0}

# warn_conflicting_ret_types
source: conflicting return type in implementation of %0%diff{: $ vs $|}1,2
root: conflicting return type in implementation of {$arg0}%diff{: $ vs $|}1,2

# warn_consteval_if_always_true
source: consteval if is always true in an %select{unevaluated|immediate}0 context
root: consteval if is always true in an {$arg0 :select s0=|unevaluated| s1=|immediate|} context

# warn_conv_mixed_enum_types_cxx26
source: invalid %select{arithmetic between|bitwise operation between|comparison of|conditional expression between|compound assignment of}0 different enumeration types%diff{ ($ and $)|}1,2
root: invalid {$arg0 :select s0=|arithmetic between| s1=|bitwise operation between| s2=|comparison of| s3=|conditional expression between| s4=|compound assignment of|} different enumeration types%diff{ ($ and $)|}1,2

# warn_conv_to_base_not_used
source: conversion function converting %0 to its base class %1 will never be used
root: conversion function converting {$arg0} to its base class {$arg1} will never be used

# warn_conv_to_self_not_used
source: conversion function converting %0 to itself will never be used
root: conversion function converting {$arg0} to itself will never be used

# warn_conv_to_void_not_used
source: conversion function converting %0 to %1 will never be used
root: conversion function converting {$arg0} to {$arg1} will never be used
