Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# ext_typecheck_convert_incompatible_pointer
source: incompatible pointer types %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2%select{|; dereference with *|; take the address with &|; remove *|; remove &}3
root: incompatible pointer types %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2{$arg3 :select s0=|| s1=|; dereference with *| s2=|; take the address with &| s3=|; remove *| s4=|; remove &|}

# ext_typecheck_convert_incompatible_pointer_sign
source: %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2 converts between pointers to integer types %select{with different sign|where one is of the unique plain 'char' type and the other is not}3
root: %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2 converts between pointers to integer types {$arg3 :select s0=|with different sign| s1=|where one is of the unique plain 'char' type and the other is not|}

# ext_typecheck_convert_int_pointer
source: incompatible integer to pointer conversion %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2%select{|; dereference with *|; take the address with &|; remove *|; remove &}3
root: incompatible integer to pointer conversion %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2{$arg3 :select s0=|| s1=|; dereference with *| s2=|; take the address with &| s3=|; remove *| s4=|; remove &|}

# ext_typecheck_convert_pointer_int
source: incompatible pointer to integer conversion %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2%select{|; dereference with *|; take the address with &|; remove *|; remove &}3
root: incompatible pointer to integer conversion %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2{$arg3 :select s0=|| s1=|; dereference with *| s2=|; take the address with &| s3=|; remove *| s4=|; remove &|}

# ext_typecheck_function_qualifiers_unspecified
source: '%0' qualifier on function type %1 has no effect and is a Clang extension
root: '{$arg0}' qualifier on function type {$arg1} has no effect and is a Clang extension

# ext_typecheck_indirection_through_void_pointer
source: ISO C does not allow indirection on operand of type %0
root: ISO C does not allow indirection on operand of type {$arg0}

# ext_typecheck_ordered_comparison_of_function_pointers
source: ordered comparison of function pointers (%0 and %1)
root: ordered comparison of function pointers ({$arg0} and {$arg1})

# ext_typecheck_ordered_comparison_of_pointer_and_zero
source: ordered comparison between pointer and zero (%0 and %1) is an extension
root: ordered comparison between pointer and zero ({$arg0} and {$arg1}) is an extension

# ext_typecheck_ordered_comparison_of_pointer_integer
source: ordered comparison between pointer and integer (%0 and %1)
root: ordered comparison between pointer and integer ({$arg0} and {$arg1})

# ext_undeclared_unqual_id_with_dependent_base
source: use of undeclared identifier %0; unqualified lookup into dependent bases of class template %1 is a Microsoft extension
root: use of undeclared identifier {$arg0}; unqualified lookup into dependent bases of class template {$arg1} is a Microsoft extension

# ext_undefined_internal_type
source: ISO C++ requires a definition in this translation unit for %select{function|variable}0 %q1 because its type does not have linkage
root: ISO C++ requires a definition in this translation unit for {$arg0 :select s0=|function| s1=|variable|} {$arg1 :q} because its type does not have linkage

# ext_unelaborated_friend_type
source: unelaborated friend declaration is a C++11 extension; specify '%select{struct|interface|union|class|enum}0' to befriend %1
root: unelaborated friend declaration is a C++11 extension; specify '{$arg0 :select s0=|struct| s1=|interface| s2=|union| s3=|class| s4=|enum|}' to befriend {$arg1}

# ext_union_member_of_reference_type
source: union member %0 has reference type %1, which is a Microsoft extension
root: union member {$arg0} has reference type {$arg1}, which is a Microsoft extension

# ext_use_out_of_scope_declaration
source: use of out-of-scope declaration of %0%select{| whose type is not compatible with that of an implicit declaration}1
root: use of out-of-scope declaration of {$arg0}{$arg1 :select s0=|| s1=| whose type is not compatible with that of an implicit declaration|}

# ext_variable_sized_type_in_struct
source: field %0 with variable sized type %1 not at the end of a struct or class is a GNU extension
root: field {$arg0} with variable sized type {$arg1} not at the end of a struct or class is a GNU extension

# ext_wchar_t_sign_spec
source: '%0' cannot be signed or unsigned
root: '{$arg0}' cannot be signed or unsigned

# friend_template_decl_malformed_pack_expansion
source: friend declaration expands pack %0 that is declared it its own template parameter list
root: friend declaration expands pack {$arg0} that is declared it its own template parameter list

# note_acc_active_applies_clause_here
source: %select{active|which applies to}0 '%1' clause here
root: {$arg0 :select s0=|active| s1=|which applies to|} '{$arg1}' clause here

# note_acc_active_clause_here
source: active '%0' clause defined here
root: active '{$arg0}' clause defined here

# note_acc_atomic_expr_must_be
source: expected %select{assignment|assignment, compound assignment, increment, or decrement}0 expression
root: expected {$arg0 :select s0=|assignment| s1=|assignment, compound assignment, increment, or decrement|} expression

# note_acc_atomic_mismatch_compound_operand
source: variable %select{|in unary expression|on right hand side of assignment|on left hand side of assignment|on left hand side of compound assignment|on left hand side of assignment}2(%3) must match variable used %select{|in unary expression|on right hand side of assignment|<not possible>|on left hand side of compound assignment|on left hand side of assignment}0(%1) from the first statement
root: variable {$arg2 :select s0=|| s1=|in unary expression| s2=|on right hand side of assignment| s3=|on left hand side of assignment| s4=|on left hand side of compound assignment| s5=|on left hand side of assignment|}({$arg3}) must match variable used {$arg0 :select s0=|| s1=|in unary expression| s2=|on right hand side of assignment| s3=|<not possible>| s4=|on left hand side of compound assignment| s5=|on left hand side of assignment|}({$arg1}) from the first statement

# note_acc_atomic_mismatch_operand
source: left hand side of assignment operation(%0) must match one side of the sub-operation on the right hand side(%1 and %2)
root: left hand side of assignment operation({$arg0}) must match one side of the sub-operation on the right hand side({$arg1} and {$arg2})

# note_acc_atomic_operand_lvalue_scalar
source: %select{left |right |}0operand to %select{assignment|compound assignment|increment|decrement}1 expression must be %select{an l-value|of scalar type (was %3)}2
root: {$arg0 :select s0=|left | s1=|right | s2=||}operand to {$arg1 :select s0=|assignment| s1=|compound assignment| s2=|increment| s3=|decrement|} expression must be {$arg2 :select s0=|an l-value| s1=|of scalar type (was {$arg3})|}

# note_acc_construct_here
source: '%0' construct is here
root: '{$arg0}' construct is here

# note_acc_int_expr_conversion
source: conversion to %select{integral|enumeration}0 type %1
root: conversion to {$arg0 :select s0=|integral| s1=|enumeration|} type {$arg1}

# note_access_constrained_by_path
source: constrained by %select{|implicitly }1%select{private|protected}0 inheritance here
root: constrained by {$arg1 :select s0=|| s1=|implicitly |}{$arg0 :select s0=|private| s1=|protected|} inheritance here

# note_access_natural
source: %select{|implicitly }1declared %select{private|protected}0 here
root: {$arg1 :select s0=|| s1=|implicitly |}declared {$arg0 :select s0=|private| s1=|protected|} here

# note_access_protected_restricted_ctordtor
source: protected %select{constructor|destructor}0 can only be used to %select{construct|destroy}0 a base class subobject
root: protected {$arg0 :select s0=|constructor| s1=|destructor|} can only be used to {$arg0 :select s0=|construct| s1=|destroy|} a base class subobject

# note_access_protected_restricted_noobject
source: must name member using the type of the current context %0
root: must name member using the type of the current context {$arg0}

# note_access_protected_restricted_object
source: can only access this member on an object of type %0
root: can only access this member on an object of type {$arg0}

# note_alignas_on_declaration
source: declared with %0 attribute here
root: declared with {$arg0} attribute here

# note_allocated_here
source: allocated with 'new%select{[]|}0' here
root: allocated with 'new{$arg0 :select s0=|[]| s1=||}' here

# note_ambig_member_ref_object_type
source: lookup in the object type %0 refers here
root: lookup in the object type {$arg0} refers here

# note_ambiguous_candidate
source: candidate found by name lookup is %q0
root: candidate found by name lookup is {$arg0 :q}

# note_ambiguous_inherited_constructor_using
source: inherited from base class %0 here
root: inherited from base class {$arg0} here

# note_ambiguous_member_type_found
source: member type %0 found by ambiguous name lookup
root: member type {$arg0} found by ambiguous name lookup

# note_amdgcn_load_lds_size_valid_value
source: size must be %select{1, 2, or 4|1, 2, 4, 12 or 16}0
root: size must be {$arg0 :select s0=|1, 2, or 4| s1=|1, 2, 4, 12 or 16|}

# note_arc_bridge_retained
source: use %select{__bridge_retained|CFBridgingRetain call}1 to make an ARC object available as a +1 %0
root: use {$arg1 :select s0=|__bridge_retained| s1=|CFBridgingRetain call|} to make an ARC object available as a +1 {$arg0}

# note_arc_bridge_transfer
source: use %select{__bridge_transfer|CFBridgingRelease call}1 to transfer ownership of a +1 %0 into ARC
root: use {$arg1 :select s0=|__bridge_transfer| s1=|CFBridgingRelease call|} to transfer ownership of a +1 {$arg0} into ARC

# note_arc_cstyle_bridge_retained
source: use __bridge_retained with C-style cast to make an ARC object available as a +1 %0
root: use __bridge_retained with C-style cast to make an ARC object available as a +1 {$arg0}

# note_arc_cstyle_bridge_transfer
source: use __bridge_transfer with C-style cast to transfer ownership of a +1 %0 into ARC
root: use __bridge_transfer with C-style cast to transfer ownership of a +1 {$arg0} into ARC

# note_arc_gained_method_convention
source: declaration in interface is not in the '%select{alloc|copy|init|new}0' family because %select{its result type is not an object pointer|its result type is unrelated to its receiver type}1
root: declaration in interface is not in the '{$arg0 :select s0=|alloc| s1=|copy| s2=|init| s3=|new|}' family because {$arg1 :select s0=|its result type is not an object pointer| s1=|its result type is unrelated to its receiver type|}

# note_arc_retain_cycle_owner
source: block will be retained by %select{the captured object|an object strongly retained by the captured object}0
root: block will be retained by {$arg0 :select s0=|the captured object| s1=|an object strongly retained by the captured object|}

# note_array_declared_here
source: array %0 declared here
root: array {$arg0} declared here

# note_array_size_conversion
source: conversion to %select{integral|enumeration}0 type %1 declared here
root: conversion to {$arg0 :select s0=|integral| s1=|enumeration|} type {$arg1} declared here

# note_asm_input_duplicate_first
source: constraint '%0' is already present here
root: constraint '{$arg0}' is already present here

# note_asm_missing_constraint_modifier
source: use constraint modifier "%0"
root: use constraint modifier "{$arg0}"

# note_assign_lhs_incomplete
source: type %0 is incomplete
root: type {$arg0} is incomplete

# note_attribute_has_no_effect_on_compile_time_if_here
source: annotating the 'if %select{constexpr|consteval}0' statement here
root: annotating the 'if {$arg0 :select s0=|constexpr| s1=|consteval|}' statement here

# note_attribute_overloadable_prev_overload
source: previous %select{unmarked |}0overload of function is here
root: previous {$arg0 :select s0=|unmarked | s1=||}overload of function is here

# note_availability_specified_here
source: %0 has been explicitly marked %select{unavailable|deleted|deprecated}1 here
root: {$arg0} has been explicitly marked {$arg1 :select s0=|unavailable| s1=|deleted| s2=|deprecated|} here

# note_base_class_specified_here
source: base class %0 specified here
root: base class {$arg0} specified here

# note_bitfield_preferred_type
source: preferred type for bit-field %0 specified here
root: preferred type for bit-field {$arg0} specified here

# note_block_var_fixit_add_initialization
source: did you mean to use __block %0?
root: did you mean to use __block {$arg0}?

# note_building_builtin_dump_struct_call
source: in call to printing function with arguments '(%0)' while dumping struct
root: in call to printing function with arguments '({$arg0})' while dumping struct

# note_called_by
source: called by %0
root: called by {$arg0}

# note_called_once_gets_called_twice
source: previous call is here%select{; set to nil to indicate it cannot be called afterwards|}0
root: previous call is here{$arg0 :select s0=|; set to nil to indicate it cannot be called afterwards| s1=||}

# note_callee_decl
source: %0 declared here
root: {$arg0} declared here

# note_cat_conform_to_noescape_prot
source: %select{category|class extension}0 conforms to protocol %1 which defines method %2
root: {$arg0 :select s0=|category| s1=|class extension|} conforms to protocol {$arg1} which defines method {$arg2}

# note_change_calling_conv_fixit
source: consider defining %0 with the '%1' calling convention
root: consider defining {$arg0} with the '{$arg1}' calling convention

# note_checking_constraints_for_class_spec_id_here
source: while checking constraint satisfaction for class template partial specialization '%0' required here
root: while checking constraint satisfaction for class template partial specialization '{$arg0}' required here

# note_checking_constraints_for_function_here
source: while checking constraint satisfaction for function '%0' required here
root: while checking constraint satisfaction for function '{$arg0}' required here

# note_checking_constraints_for_template_id_here
source: while checking constraint satisfaction for template '%0' required here
root: while checking constraint satisfaction for template '{$arg0}' required here

# note_checking_constraints_for_var_spec_id_here
source: while checking constraint satisfaction for variable template partial specialization '%0' required here
root: while checking constraint satisfaction for variable template partial specialization '{$arg0}' required here

# note_cocoa_naming_declare_family
source: explicitly declare getter %objcinstance0 with '%1' to return an 'unowned' object
root: explicitly declare getter %objcinstance0 with '{$arg1}' to return an 'unowned' object

# note_comparison_synthesized_at
source: in defaulted %select{<ERROR>|equality|three-way|equality|relational}0 comparison operator for %1 first required here
root: in defaulted {$arg0 :select s0=|<ERROR>| s1=|equality| s2=|three-way| s3=|equality| s4=|relational|} comparison operator for {$arg1} first required here

# note_compat_assoc
source: compatible type %0 specified here
root: compatible type {$arg0} specified here

# note_concept_specialization_here
source: while checking the satisfaction of concept '%0' requested here
root: while checking the satisfaction of concept '{$arg0}' requested here

# note_conflicting_try_here
source: conflicting %0 here
root: conflicting {$arg0} here

# note_constexpr_dtor_subobject
source: %select{data member %1|base class %2}0 declared here
root: {$arg0 :select s0=|data member {$arg1}| s1=|base class {$arg2}|} declared here

# note_constinit_missing_here
source: add the %select{'require_constant_initialization' attribute|'constinit' specifier}0 to the initializing declaration here
root: add the {$arg0 :select s0=|'require_constant_initialization' attribute| s1=|'constinit' specifier|} to the initializing declaration here

# note_convert_inline_to_static
source: use 'static' to give inline function %0 internal linkage
root: use 'static' to give inline function {$arg0} internal linkage

# note_coroutine_promise_call_implicitly_required
source: call to %0 implicitly required by coroutine function here
root: call to {$arg0} implicitly required by coroutine function here

# note_coroutine_promise_suspend_implicitly_required
source: call to '%select{initial_suspend|final_suspend}0' implicitly required by the %select{initial suspend point|final suspend point}0
root: call to '{$arg0 :select s0=|initial_suspend| s1=|final_suspend|}' implicitly required by the {$arg0 :select s0=|initial suspend point| s1=|final suspend point|}

# note_coroutine_unusable_type_aware_allocators
source: type aware %0 will not be used for coroutine allocation
root: type aware {$arg0} will not be used for coroutine allocation

# note_counted_by_consider_completing_pointee_ty
source: consider providing a complete definition for %0
root: consider providing a complete definition for {$arg0}

# note_counted_by_consider_using_sized_by
source: consider using '__sized_by%select{|_or_null}0' instead of '__counted_by%select{|_or_null}0'
root: consider using '__sized_by{$arg0 :select s0=|| s1=|_or_null|}' instead of '__counted_by{$arg0 :select s0=|| s1=|_or_null|}'

# note_cuda_device_builtin_surftex_cls_should_have_match_arg
source: the %select{1st|2nd|3rd}1 template parameter of %0 needs to be %select{a type|an integer or enum value}2
root: the {$arg1 :select s0=|1st| s1=|2nd| s2=|3rd|} template parameter of {$arg0} needs to be {$arg2 :select s0=|a type| s1=|an integer or enum value|}

# note_cuda_device_builtin_surftex_cls_should_have_n_args
source: %0 needs to have exactly %1 template parameters
root: {$arg0} needs to have exactly {$arg1} template parameters

# note_cuda_device_builtin_surftex_should_be_template_class
source: %0 needs to be instantiated from a class template with proper template arguments
root: {$arg0} needs to be instantiated from a class template with proper template arguments

# note_decl_unguarded_availability_silence
source: annotate %select{%1|anonymous %1}0 with an availability attribute to silence this warning
root: annotate {$arg0 :select s0=|{$arg1}| s1=|anonymous {$arg1}|} with an availability attribute to silence this warning

# note_declaration_not_a_prototype
source: this declaration is not a prototype; add %select{'void'|parameter declarations}0 to make it %select{a prototype for a zero-parameter function|one}0
root: this declaration is not a prototype; add {$arg0 :select s0=|'void'| s1=|parameter declarations|} to make it {$arg0 :select s0=|a prototype for a zero-parameter function| s1=|one|}

# note_declared_coroutine_here
source: function is a coroutine due to use of '%0' here
root: function is a coroutine due to use of '{$arg0}' here

# note_declared_nonnull
source: declared %select{'returns_nonnull'|'nonnull'}0 here
root: declared {$arg0 :select s0=|'returns_nonnull'| s1=|'nonnull'|} here

# note_declared_required_constant_init_here
source: required by %select{'require_constant_initialization' attribute|'constinit' specifier}0 here
root: required by {$arg0 :select s0=|'require_constant_initialization' attribute| s1=|'constinit' specifier|} here

# note_deduced_template_arg_substitution_here
source: during template argument deduction for %select{class|variable}0 template %select{partial specialization |}1%2 %3
root: during template argument deduction for {$arg0 :select s0=|class| s1=|variable|} template {$arg1 :select s0=|partial specialization | s1=||}{$arg2} {$arg3}

# note_deduction_guide_access
source: deduction guide declared %0 by intervening access specifier
root: deduction guide declared {$arg0} by intervening access specifier
