Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# warn_noreturn_function_has_return_expr
source: function %0 declared 'noreturn' should not return
root: function {$arg0} declared 'noreturn' should not return

# warn_noreturn_has_return_expr
source: %select{function|block|lambda|coroutine}0 declared 'noreturn' should not return
root: {$arg0 :select s0=|function| s1=|block| s2=|lambda| s3=|coroutine|} declared 'noreturn' should not return

# warn_not_compound_assign
source: use of unary operator that may be intended as compound assignment (%0=)
root: use of unary operator that may be intended as compound assignment ({$arg0}=)

# warn_not_enough_argument
source: not enough variable arguments in %0 declaration to fit a sentinel
root: not enough variable arguments in {$arg0} declaration to fit a sentinel

# warn_not_in_enum
source: case value not in enumerated type %0
root: case value not in enumerated type {$arg0}

# warn_not_in_enum_assignment
source: integer constant not in range of enumerated type %0
root: integer constant not in range of enumerated type {$arg0}

# warn_ns_attribute_wrong_parameter_type
source: %0 attribute only applies to %select{Objective-C object|pointer|pointer-to-CF-pointer|pointer/reference-to-OSObject-pointer}1 parameters
root: {$arg0} attribute only applies to {$arg1 :select s0=|Objective-C object| s1=|pointer| s2=|pointer-to-CF-pointer| s3=|pointer/reference-to-OSObject-pointer|} parameters

# warn_ns_attribute_wrong_return_type
source: %0 attribute only applies to %select{functions|methods|properties}1 that return %select{an Objective-C object|a pointer|a non-retainable pointer}2
root: {$arg0} attribute only applies to {$arg1 :select s0=|functions| s1=|methods| s2=|properties|} that return {$arg2 :select s0=|an Objective-C object| s1=|a pointer| s2=|a non-retainable pointer|}

# warn_nsreturns_retained_attribute_mismatch
source: overriding method has mismatched ns_returns_%select{not_retained|retained}0 attributes
root: overriding method has mismatched ns_returns_{$arg0 :select s0=|not_retained| s1=|retained|} attributes

# warn_null_in_comparison_operation
source: comparison between NULL and non-pointer %select{(%1 and NULL)|(NULL and %1)}0
root: comparison between NULL and non-pointer {$arg0 :select s0=|({$arg1} and NULL)| s1=|(NULL and {$arg1})|}

# warn_null_pointer_compare
source: comparison of %select{address of|function|array}0 '%1' %select{not |}2equal to a null pointer is always %select{true|false}2
root: comparison of {$arg0 :select s0=|address of| s1=|function| s2=|array|} '{$arg1}' {$arg2 :select s0=|not | s1=||}equal to a null pointer is always {$arg2 :select s0=|true| s1=|false|}

# warn_null_resettable_setter
source: synthesized setter %0 for null_resettable property %1 does not handle nil
root: synthesized setter {$arg0} for null_resettable property {$arg1} does not handle nil

# warn_null_ret
source: null returned from %select{function|method}0 that requires a non-null return value
root: null returned from {$arg0 :select s0=|function| s1=|method|} that requires a non-null return value

# warn_nullability_declspec
source: nullability specifier %0 cannot be applied to non-pointer type %1; did you mean to apply the specifier to the %select{pointer|block pointer|member pointer|function pointer|member function pointer}2?
root: nullability specifier {$arg0} cannot be applied to non-pointer type {$arg1}; did you mean to apply the specifier to the {$arg2 :select s0=|pointer| s1=|block pointer| s2=|member pointer| s3=|function pointer| s4=|member function pointer|}?

# warn_nullability_inferred_on_nested_type
source: inferring '_Nonnull' for pointer type within %select{array|reference}0 is deprecated
root: inferring '_Nonnull' for pointer type within {$arg0 :select s0=|array| s1=|reference|} is deprecated

# warn_nullability_lost
source: implicit conversion from nullable pointer %0 to non-nullable pointer type %1
root: implicit conversion from nullable pointer {$arg0} to non-nullable pointer type {$arg1}

# warn_nullability_missing
source: %select{pointer|block pointer|member pointer}0 is missing a nullability type specifier (_Nonnull, _Nullable, or _Null_unspecified)
root: {$arg0 :select s0=|pointer| s1=|block pointer| s2=|member pointer|} is missing a nullability type specifier (_Nonnull, _Nullable, or _Null_unspecified)

# warn_objc_boxing_invalid_utf8_string
source: string is ill-formed as UTF-8 and will become a null %0 when boxed
root: string is ill-formed as UTF-8 and will become a null {$arg0} when boxed

# warn_objc_cdirective_format_string
source: using %0 directive in %select{NSString|CFString}1 which is being passed as a formatting argument to the formatting %select{method|CFfunction}2
root: using {$arg0} directive in {$arg1 :select s0=|NSString| s1=|CFString|} which is being passed as a formatting argument to the formatting {$arg2 :select s0=|method| s1=|CFfunction|}

# warn_objc_circular_container
source: adding %0 to %1 might cause circular dependency in container
root: adding {$arg0} to {$arg1} might cause circular dependency in container

# warn_objc_collection_literal_element
source: object of type %0 is not compatible with %select{array element type|dictionary key type|dictionary value type}1 %2
root: object of type {$arg0} is not compatible with {$arg1 :select s0=|array element type| s1=|dictionary key type| s2=|dictionary value type|} {$arg2}

# warn_objc_direct_ignored
source: %0 attribute isn't implemented by this Objective-C runtime
root: {$arg0} attribute isn't implemented by this Objective-C runtime

# warn_objc_direct_property_ignored
source: direct attribute on property %0 ignored (not implemented by this Objective-C runtime)
root: direct attribute on property {$arg0} ignored (not implemented by this Objective-C runtime)

# warn_objc_invalid_bridge
source: %0 bridges to %1, not %2
root: {$arg0} bridges to {$arg1}, not {$arg2}

# warn_objc_invalid_bridge_to_cf
source: %0 cannot bridge to %1
root: {$arg0} cannot bridge to {$arg1}

# warn_objc_literal_comparison
source: direct comparison of %select{an array literal|a dictionary literal|a numeric literal|a boxed expression|}0 has undefined behavior
root: direct comparison of {$arg0 :select s0=|an array literal| s1=|a dictionary literal| s2=|a numeric literal| s3=|a boxed expression| s4=||} has undefined behavior

# warn_objc_missing_super_call
source: method possibly missing a [super %0] call
root: method possibly missing a [super {$arg0}] call

# warn_objc_precise_lifetime_meaningless
source: objc_precise_lifetime is not meaningful for %select{__unsafe_unretained|__autoreleasing}0 objects
root: objc_precise_lifetime is not meaningful for {$arg0 :select s0=|__unsafe_unretained| s1=|__autoreleasing|} objects

# warn_objc_redundant_literal_use
source: using %0 with a literal is redundant
root: using {$arg0} with a literal is redundant

# warn_objc_redundant_qualified_class_type
source: parameterized class %0 already conforms to the protocols listed; did you forget a '*'?
root: parameterized class {$arg0} already conforms to the protocols listed; did you forget a '*'?

# warn_objc_requires_super_protocol
source: %0 attribute cannot be applied to %select{methods in protocols|dealloc}1
root: {$arg0} attribute cannot be applied to {$arg1 :select s0=|methods in protocols| s1=|dealloc|}

# warn_objc_root_class_missing
source: class %0 defined without specifying a base class
root: class {$arg0} defined without specifying a base class

# warn_objc_unsafe_perform_selector
source: %0 is incompatible with selectors that return a %select{struct|union|vector}1 type
root: {$arg0} is incompatible with selectors that return a {$arg1 :select s0=|struct| s1=|union| s2=|vector|} type

# warn_offload_incompatible_redeclare
source: target-attribute based function overloads are not supported by NVCC and will be treated as a function redeclaration:new declaration is %select{__device__|__global__|__host__|__host__ __device__}0 function, old declaration is %select{__device__|__global__|__host__|__host__ __device__}1 function
root: target-attribute based function overloads are not supported by NVCC and will be treated as a function redeclaration:new declaration is {$arg0 :select s0=|__device__| s1=|__global__| s2=|__host__| s3=|__host__ __device__|} function, old declaration is {$arg1 :select s0=|__device__| s1=|__global__| s2=|__host__| s3=|__host__ __device__|} function

# warn_omp_allocate_thread_on_task_target_directive
source: allocator with the 'thread' trait access has unspecified behavior on '%0' directive
root: allocator with the 'thread' trait access has unspecified behavior on '{$arg0}' directive

# warn_omp_assume_attribute_string_unknown
source: unknown assumption string '%0'; attribute is potentially ignored
root: unknown assumption string '{$arg0}'; attribute is potentially ignored

# warn_omp_assume_attribute_string_unknown_suggested
source: unknown assumption string '%0' may be misspelled; attribute is potentially ignored, did you mean '%1'?
root: unknown assumption string '{$arg0}' may be misspelled; attribute is potentially ignored, did you mean '{$arg1}'?

# warn_omp_declare_variant_score_not_constant
source: score expressions in the OpenMP context selector need to be constant; %0 is not and will be ignored
root: score expressions in the OpenMP context selector need to be constant; {$arg0} is not and will be ignored

# warn_omp_linear_step_zero
source: zero linear step (%0 %select{|and other variables in clause }1should probably be const)
root: zero linear step ({$arg0} {$arg1 :select s0=|| s1=|and other variables in clause |}should probably be const)

# warn_omp_non_trivial_type_mapped
source: type %0 is not trivially copyable and not guaranteed to be mapped correctly
root: type {$arg0} is not trivially copyable and not guaranteed to be mapped correctly

# warn_omp_section_is_char
source: array section %select{lower bound|length}0 is of type 'char'
root: array section {$arg0 :select s0=|lower bound| s1=|length|} is of type 'char'

# warn_omp_unterminated_declare_target
source: expected '#pragma omp end declare target' at end of file to match '#pragma omp %0'
root: expected '#pragma omp end declare target' at end of file to match '#pragma omp {$arg0}'

# warn_omp_used_different_allocator
source: allocate directive specifies %select{default|'%1'}0 allocator while previously used %select{default|'%3'}2
root: allocate directive specifies {$arg0 :select s0=|default| s1=|'{$arg1}'|} allocator while previously used {$arg2 :select s0=|default| s1=|'{$arg3}'|}

# warn_opencl_attr_deprecated_ignored
source: %0 attribute is deprecated and ignored in %1
root: {$arg0} attribute is deprecated and ignored in {$arg1}

# warn_opencl_generic_address_space_arg
source: passing non-generic address space pointer to %0 may cause dynamic conversion affecting performance
root: passing non-generic address space pointer to {$arg0} may cause dynamic conversion affecting performance

# warn_operator_new_returns_null
source: %0 should not return a null pointer unless it is declared 'throw()'%select{| or 'noexcept'}1
root: {$arg0} should not return a null pointer unless it is declared 'throw()'{$arg1 :select s0=|| s1=| or 'noexcept'|}

# warn_out_of_range_compare
source: result of comparison of %select{constant %0|true|false}1 with %select{expression of type %2|boolean expression}3 is always %4
root: result of comparison of {$arg1 :select s0=|constant {$arg0}| s1=|true| s2=|false|} with {$arg3 :select s0=|expression of type {$arg2}| s1=|boolean expression|} is always {$arg4}

# warn_overaligned_type
source: type %0 requires %1 bytes of alignment and the default allocator only guarantees %2 bytes
root: type {$arg0} requires {$arg1} bytes of alignment and the default allocator only guarantees {$arg2} bytes

# warn_overloaded_shift_in_comparison
source: overloaded operator %select{>>|<<}0 has higher precedence than comparison operator
root: overloaded operator {$arg0 :select s0=|>>| s1=|<<|} has higher precedence than comparison operator

# warn_overloaded_virtual
source: %q0 hides overloaded virtual %select{function|functions}1
root: {$arg0 :q} hides overloaded virtual {$arg1 :select s0=|function| s1=|functions|}

# warn_param_mismatched_alignment
source: passing %0-byte aligned argument to %1-byte aligned parameter %2%select{| of %4}3 may result in an unaligned pointer access
root: passing {$arg0}-byte aligned argument to {$arg1}-byte aligned parameter {$arg2}{$arg3 :select s0=|| s1=| of {$arg4}|} may result in an unaligned pointer access

# warn_param_return_typestate_mismatch
source: parameter '%0' not in expected state when the function returns: expected '%1', observed '%2'
root: parameter '{$arg0}' not in expected state when the function returns: expected '{$arg1}', observed '{$arg2}'

# warn_param_typestate_mismatch
source: argument not in expected state; expected '%0', observed '%1'
root: argument not in expected state; expected '{$arg0}', observed '{$arg1}'

# warn_parameter_size
source: %0 is a large (%1 bytes) pass-by-value argument; pass it by reference instead ?
root: {$arg0} is a large ({$arg1} bytes) pass-by-value argument; pass it by reference instead ?

# warn_parens_disambiguated_as_variable_declaration
source: parentheses were disambiguated as redundant parentheses around declaration of variable named %0
root: parentheses were disambiguated as redundant parentheses around declaration of variable named {$arg0}

# warn_pass_class_arg_to_vararg
source: passing object of class type %0 through variadic %select{function|block|method|constructor}1%select{|; did you mean to call '%3'?}2
root: passing object of class type {$arg0} through variadic {$arg1 :select s0=|function| s1=|block| s2=|method| s3=|constructor|}{$arg2 :select s0=|| s1=|; did you mean to call '{$arg3}'?|}

# warn_perf_constraint_implies_noexcept
source: %select{function|constructor|destructor|lambda|block}0 with '%1' attribute should be declared noexcept
root: {$arg0 :select s0=|function| s1=|constructor| s2=|destructor| s3=|lambda| s4=|block|} with '{$arg1}' attribute should be declared noexcept

# warn_pointer_abs
source: taking the absolute value of %select{pointer|function|array}0 type %1 is suspicious
root: taking the absolute value of {$arg0 :select s0=|pointer| s1=|function| s2=|array|} type {$arg1} is suspicious

# warn_pointer_arith_null_ptr
source: performing pointer arithmetic on a null pointer has undefined behavior%select{| if the offset is nonzero}0
root: performing pointer arithmetic on a null pointer has undefined behavior{$arg0 :select s0=|| s1=| if the offset is nonzero|}

# warn_pointer_compare
source: comparing a pointer to a null character constant; did you mean to compare to %select{NULL|(void *)0}0?
root: comparing a pointer to a null character constant; did you mean to compare to {$arg0 :select s0=|NULL| s1=|(void *)0|}?

# warn_pointer_indirection_from_incompatible_type
source: dereference of type %1 that was reinterpret_cast from type %0 has undefined behavior
root: dereference of type {$arg1} that was reinterpret_cast from type {$arg0} has undefined behavior

# warn_pointer_sub_null_ptr
source: performing pointer subtraction with a null pointer %select{has|may have}0 undefined behavior
root: performing pointer subtraction with a null pointer {$arg0 :select s0=|has| s1=|may have|} undefined behavior

# warn_pointer_to_enum_cast
source: cast to smaller integer type %1 from %0
root: cast to smaller integer type {$arg1} from {$arg0}

# warn_pointer_to_int_cast
source: cast to smaller integer type %1 from %0
root: cast to smaller integer type {$arg1} from {$arg0}

# warn_possible_object_duplication_init
source: initialization of %0 may run twice when built into a shared library: it has hidden visibility and external linkage
root: initialization of {$arg0} may run twice when built into a shared library: it has hidden visibility and external linkage

# warn_possible_object_duplication_mutable
source: %0 may be duplicated when built into a shared library: it is mutable, has hidden visibility, and external linkage
root: {$arg0} may be duplicated when built into a shared library: it is mutable, has hidden visibility, and external linkage

# warn_potentially_direct_selector_expression
source: @selector expression formed with potentially direct selector %0
root: @selector expression formed with potentially direct selector {$arg0}

# warn_pragma_attribute_unused
source: unused attribute %0 in '#pragma clang attribute push' region
root: unused attribute {$arg0} in '#pragma clang attribute push' region

# warn_pragma_options_align_reset_failed
source: #pragma options align=reset failed: %0
root: #pragma options align=reset failed: {$arg0}

# warn_pragma_pack_show
source: value of #pragma pack(show) == %0
root: value of #pragma pack(show) == {$arg0}

# warn_pragma_pop_failed
source: #pragma %0(pop, ...) failed: %1
root: #pragma {$arg0}(pop, ...) failed: {$arg1}

# warn_pragma_unused_undeclared_var
source: undeclared variable %0 used as an argument for '#pragma unused'
root: undeclared variable {$arg0} used as an argument for '#pragma unused'

# warn_precedence_bitwise_conditional
source: operator '?:' has lower precedence than '%0'; '%0' will be evaluated first
root: operator '?:' has lower precedence than '{$arg0}'; '{$arg0}' will be evaluated first

# warn_precedence_bitwise_rel
source: %0 has lower precedence than %1; %1 will be evaluated first
root: {$arg0} has lower precedence than {$arg1}; {$arg1} will be evaluated first

# warn_precedence_conditional
source: operator '?:' has lower precedence than '%0'; '%0' will be evaluated first
root: operator '?:' has lower precedence than '{$arg0}'; '{$arg0}' will be evaluated first

# warn_preferred_type_bitfield_too_small_for_enum
source: bit-field %0 is not wide enough to store all enumerators of preferred type %1
root: bit-field {$arg0} is not wide enough to store all enumerators of preferred type {$arg1}

# warn_preferred_type_signed_bitfield_enum_conversion
source: signed bit-field %0 needs an extra bit to represent the largest positive enumerators of preferred type %1
root: signed bit-field {$arg0} needs an extra bit to represent the largest positive enumerators of preferred type {$arg1}

# warn_preferred_type_unsigned_bitfield_assigned_signed_enum
source: assigning value of preferred signed enum type %1 to unsigned bit-field %0; negative enumerators of enum %1 will be converted to positive values
root: assigning value of preferred signed enum type {$arg1} to unsigned bit-field {$arg0}; negative enumerators of enum {$arg1} will be converted to positive values

# warn_printf_ObjCflags_without_ObjCConversion
source: object format flags cannot be used with '%0' conversion specifier
root: object format flags cannot be used with '{$arg0}' conversion specifier

# warn_printf_asterisk_missing_arg
source: '%select{*|.*}0' specified field %select{width|precision}0 is missing a matching 'int' argument
root: '{$arg0 :select s0=|*| s1=|.*|}' specified field {$arg0 :select s0=|width| s1=|precision|} is missing a matching 'int' argument

# warn_printf_asterisk_wrong_type
source: field %select{width|precision}0 should have type %1, but argument has type %2
root: field {$arg0 :select s0=|width| s1=|precision|} should have type {$arg1}, but argument has type {$arg2}

# warn_printf_ignored_flag
source: flag '%0' is ignored when flag '%1' is present
root: flag '{$arg0}' is ignored when flag '{$arg1}' is present

# warn_printf_invalid_objc_flag
source: '%0' is not a valid object format flag
root: '{$arg0}' is not a valid object format flag

# warn_printf_nonsensical_flag
source: flag '%0' results in undefined behavior with '%1' conversion specifier
root: flag '{$arg0}' results in undefined behavior with '{$arg1}' conversion specifier

# warn_printf_nonsensical_optional_amount
source: %select{field width|precision}0 used with '%1' conversion specifier, resulting in undefined behavior
root: {$arg0 :select s0=|field width| s1=|precision|} used with '{$arg1}' conversion specifier, resulting in undefined behavior

# warn_printf_positional_arg_exceeds_data_args
source: data argument position '%0' exceeds the number of data arguments (%1)
root: data argument position '{$arg0}' exceeds the number of data arguments ({$arg1})

# warn_property_access_suggest
source: property %0 not found on object of type %1; did you mean to access property %2?
root: property {$arg0} not found on object of type {$arg1}; did you mean to access property {$arg2}?

# warn_property_attribute
source: '%1' attribute on property %0 does not match the property inherited from %2
root: '{$arg1}' attribute on property {$arg0} does not match the property inherited from {$arg2}

# warn_property_method_deprecated
source: property access is using %0 method which is deprecated
root: property access is using {$arg0} method which is deprecated

# warn_property_redecl_getter_mismatch
source: getter name mismatch between property redeclaration (%1) and its original declaration (%0)
root: getter name mismatch between property redeclaration ({$arg1}) and its original declaration ({$arg0})

# warn_property_types_are_incompatible
source: property type %0 is incompatible with type %1 inherited from %2
root: property type {$arg0} is incompatible with type {$arg1} inherited from {$arg2}

# warn_protocol_property_mismatch
source: property %select{of type %1|with attribute '%1'|without attribute '%1'|with getter %1|with setter %1}0 was selected for synthesis
root: property {$arg0 :select s0=|of type {$arg1}| s1=|with attribute '{$arg1}'| s2=|without attribute '{$arg1}'| s3=|with getter {$arg1}| s4=|with setter {$arg1}|} was selected for synthesis

# warn_pt_guarded_pass_by_reference
source: passing the value that %1 points to by reference requires holding %0 %select{'%2'|'%2' exclusively}3
root: passing the value that {$arg1} points to by reference requires holding {$arg0} {$arg3 :select s0=|'{$arg2}'| s1=|'{$arg2}' exclusively|}

# warn_pt_guarded_pass_pointer
source: passing pointer %1 requires holding %0 %select{'%2'|'%2' exclusively}3
root: passing pointer {$arg1} requires holding {$arg0} {$arg3 :select s0=|'{$arg2}'| s1=|'{$arg2}' exclusively|}

# warn_pt_guarded_return_by_reference
source: returning the value that %1 points to by reference requires holding %0 %select{'%2'|'%2' exclusively}3
root: returning the value that {$arg1} points to by reference requires holding {$arg0} {$arg3 :select s0=|'{$arg2}'| s1=|'{$arg2}' exclusively|}

# warn_pt_guarded_return_pointer
source: returning pointer %1 requires holding %0 %select{'%2'|'%2' exclusively}3
root: returning pointer {$arg1} requires holding {$arg0} {$arg3 :select s0=|'{$arg2}'| s1=|'{$arg2}' exclusively|}

# warn_ptr_arith_exceeds_bounds
source: the pointer incremented by %0 refers past the end of the array (that has type %1)
root: the pointer incremented by {$arg0} refers past the end of the array (that has type {$arg1})

# warn_ptr_arith_exceeds_max_addressable_bounds
source: the pointer incremented by %0 refers past the last possible element for an array in %1-bit address space containing %2-bit (%3-byte) elements (max possible %4 element%s5)
root: the pointer incremented by {$arg0} refers past the last possible element for an array in {$arg1}-bit address space containing {$arg2}-bit ({$arg3}-byte) elements (max possible {$arg4} element%s5)

# warn_ptr_arith_precedes_bounds
source: the pointer decremented by %0 refers before the beginning of the array
root: the pointer decremented by {$arg0} refers before the beginning of the array

# warn_pure_function_returns_void
source: '%select{pure|const}0' attribute on function returning 'void'; attribute ignored
root: '{$arg0 :select s0=|pure| s1=|const|}' attribute on function returning 'void'; attribute ignored
