Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# err_addr_ovl_not_func_ptrref
source: address of overloaded function %0 cannot be converted to type %1
root: address of overloaded function {$arg0} cannot be converted to type {$arg1}

# err_address_of_function_with_pass_object_size_params
source: cannot take address of function %0 because parameter %1 has pass_object_size attribute
root: cannot take address of function {$arg0} because parameter {$arg1} has pass_object_size attribute

# err_address_space_mismatch_templ_inst
source: conflicting address space qualifiers are provided between types %0 and %1
root: conflicting address space qualifiers are provided between types {$arg0} and {$arg1}

# err_address_space_qualified_delete
source: 'delete' cannot delete objects of type %0 in address space '%1'
root: 'delete' cannot delete objects of type {$arg0} in address space '{$arg1}'

# err_address_space_qualified_new
source: 'new' cannot allocate objects of type %0 in address space '%1'
root: 'new' cannot allocate objects of type {$arg0} in address space '{$arg1}'

# err_addrof_function_constraints_not_satisfied
source: cannot take address of function %0 because its constraints are not satisfied
root: cannot take address of function {$arg0} because its constraints are not satisfied

# err_addrof_function_disabled_by_enable_if_attr
source: cannot take address of function %0 because it has one or more non-tautological enable_if conditions
root: cannot take address of function {$arg0} because it has one or more non-tautological enable_if conditions

# err_aix_attr_unsupported
source: %0 attribute is not yet supported on AIX
root: {$arg0} attribute is not yet supported on AIX

# err_alias_after_tentative
source: alias definition of %0 after tentative definition
root: alias definition of {$arg0} after tentative definition

# err_alias_is_definition
source: definition %0 cannot also be an %select{alias|ifunc}1
root: definition {$arg0} cannot also be an {$arg1 :select s0=|alias| s1=|ifunc|}

# err_alignas_attribute_wrong_decl_type
source: %0 attribute cannot be applied to %select{a function parameter|a variable with 'register' storage class|a 'catch' variable|a bit-field|an enumeration}1
root: {$arg0} attribute cannot be applied to {$arg1 :select s0=|a function parameter| s1=|a variable with 'register' storage class| s2=|a 'catch' variable| s3=|a bit-field| s4=|an enumeration|}

# err_alignas_mismatch
source: redeclaration has different alignment requirement (%1 vs %0)
root: redeclaration has different alignment requirement ({$arg1} vs {$arg0})

# err_alignas_missing_on_definition
source: %0 must be specified on definition if it is specified on any declaration
root: {$arg0} must be specified on definition if it is specified on any declaration

# err_alignas_underaligned
source: requested alignment is less than minimum alignment of %1 for type %0
root: requested alignment is less than minimum alignment of {$arg1} for type {$arg0}

# err_aligned_allocation_unavailable
source: aligned %select{allocation|deallocation}0 function of type '%1' is %select{only|not}4 available on %2%select{ %3 or newer|}4
root: aligned {$arg0 :select s0=|allocation| s1=|deallocation|} function of type '{$arg1}' is {$arg4 :select s0=|only| s1=|not|} available on {$arg2}{$arg4 :select s0=| {$arg3} or newer| s1=||}

# err_alignment_too_big
source: requested alignment must be %0 or smaller
root: requested alignment must be {$arg0} or smaller

# err_alignment_too_small
source: requested alignment must be %0 or greater
root: requested alignment must be {$arg0} or greater

# err_allocation_of_abstract_type
source: allocating an object of abstract class type %0
root: allocating an object of abstract class type {$arg0}

# err_ambiguous_base_to_derived_cast
source: ambiguous cast from base %0 to derived %1:%2
root: ambiguous cast from base {$arg0} to derived {$arg1}:{$arg2}

# err_ambiguous_delete_operand
source: ambiguous conversion of delete expression of type %0 to a pointer
root: ambiguous conversion of delete expression of type {$arg0} to a pointer

# err_ambiguous_derived_to_base_conv
source: ambiguous conversion from derived class %0 to base class %1:%2
root: ambiguous conversion from derived class {$arg0} to base class {$arg1}:{$arg2}

# err_ambiguous_destructor
source: destructor of class %0 is ambiguous
root: destructor of class {$arg0} is ambiguous

# err_ambiguous_inherited_constructor
source: constructor of %0 inherited from multiple base class subobjects
root: constructor of {$arg0} inherited from multiple base class subobjects

# err_ambiguous_member_multiple_subobject_types
source: member %0 found in multiple base classes of different types
root: member {$arg0} found in multiple base classes of different types

# err_ambiguous_member_multiple_subobjects
source: non-static member %0 found in multiple base-class subobjects of type %1:%2
root: non-static member {$arg0} found in multiple base-class subobjects of type {$arg1}:{$arg2}

# err_ambiguous_memptr_conv
source: ambiguous conversion from pointer to member of %select{base|derived}0 class %1 to pointer to member of %select{derived|base}0 class %2:%3
root: ambiguous conversion from pointer to member of {$arg0 :select s0=|base| s1=|derived|} class {$arg1} to pointer to member of {$arg0 :select s0=|derived| s1=|base|} class {$arg2}:{$arg3}

# err_ambiguous_reference
source: reference to %0 is ambiguous
root: reference to {$arg0} is ambiguous

# err_ambiguous_suitable_delete_member_function_found
source: multiple suitable %0 functions in %1
root: multiple suitable {$arg0} functions in {$arg1}

# err_ambiguous_tag_hiding
source: a type named %0 is hidden by a declaration in a different namespace
root: a type named {$arg0} is hidden by a declaration in a different namespace

# err_anon_bitfield_has_negative_width
source: anonymous bit-field has negative width (%0)
root: anonymous bit-field has negative width ({$arg0})

# err_anonymous_record_bad_member
source: anonymous %select{struct|union}0 can only contain non-static data members
root: anonymous {$arg0 :select s0=|struct| s1=|union|} can only contain non-static data members

# err_anonymous_record_member_redecl
source: member of anonymous %select{struct|union}0 redeclares %1
root: member of anonymous {$arg0 :select s0=|struct| s1=|union|} redeclares {$arg1}

# err_anonymous_record_nonpublic_member
source: anonymous %select{struct|union}0 cannot contain a %select{private|protected}1 data member
root: anonymous {$arg0 :select s0=|struct| s1=|union|} cannot contain a {$arg1 :select s0=|private| s1=|protected|} data member

# err_anonymous_record_with_function
source: functions cannot be declared in an anonymous %select{struct|union}0
root: functions cannot be declared in an anonymous {$arg0 :select s0=|struct| s1=|union|}

# err_anonymous_record_with_static
source: static members cannot be declared in an anonymous %select{struct|union}0
root: static members cannot be declared in an anonymous {$arg0 :select s0=|struct| s1=|union|}

# err_anonymous_record_with_type
source: types cannot be declared in an anonymous %select{struct|union}0
root: types cannot be declared in an anonymous {$arg0 :select s0=|struct| s1=|union|}

# err_anonymous_struct_not_member
source: anonymous %select{structs|structs and classes}0 must be %select{struct or union|class}0 members
root: anonymous {$arg0 :select s0=|structs| s1=|structs and classes|} must be {$arg0 :select s0=|struct or union| s1=|class|} members

# err_anyx86_interrupt_attribute
source: %select{x86|x86-64}0 'interrupt' attribute only applies to functions that have %select{a 'void' return type|only a pointer parameter optionally followed by an integer parameter|a pointer as the first parameter|a %2 type as the second parameter}1
root: {$arg0 :select s0=|x86| s1=|x86-64|} 'interrupt' attribute only applies to functions that have {$arg1 :select s0=|a 'void' return type| s1=|only a pointer parameter optionally followed by an integer parameter| s2=|a pointer as the first parameter| s3=|a {$arg2} type as the second parameter|}

# err_arc_assign_property_ownership
source: existing instance variable %1 for property %0 with %select{unsafe_unretained|assign}2 attribute must be __unsafe_unretained
root: existing instance variable {$arg1} for property {$arg0} with {$arg2 :select s0=|unsafe_unretained| s1=|assign|} attribute must be __unsafe_unretained

# err_arc_atomic_ownership
source: cannot perform atomic operation on a pointer to type %0: type has non-trivial ownership
root: cannot perform atomic operation on a pointer to type {$arg0}: type has non-trivial ownership

# err_arc_autoreleasing_capture
source: cannot capture __autoreleasing variable in a %select{block|lambda by copy}0
root: cannot capture __autoreleasing variable in a {$arg0 :select s0=|block| s1=|lambda by copy|}

# err_arc_autoreleasing_var
source: %select{__block variables|global variables|fields|instance variables}0 cannot have __autoreleasing ownership
root: {$arg0 :select s0=|__block variables| s1=|global variables| s2=|fields| s3=|instance variables|} cannot have __autoreleasing ownership

# err_arc_bridge_cast_incompatible
source: incompatible types casting %0 to %1 with a %select{__bridge|__bridge_transfer|__bridge_retained}2 cast
root: incompatible types casting {$arg0} to {$arg1} with a {$arg2 :select s0=|__bridge| s1=|__bridge_transfer| s2=|__bridge_retained|} cast

# err_arc_bridge_cast_wrong_kind
source: cast of %select{Objective-C|block|C}0 pointer type %1 to %select{Objective-C|block|C}2 pointer type %3 cannot use %select{__bridge|__bridge_transfer|__bridge_retained}4
root: cast of {$arg0 :select s0=|Objective-C| s1=|block| s2=|C|} pointer type {$arg1} to {$arg2 :select s0=|Objective-C| s1=|block| s2=|C|} pointer type {$arg3} cannot use {$arg4 :select s0=|__bridge| s1=|__bridge_transfer| s2=|__bridge_retained|}

# err_arc_cast_requires_bridge
source: %select{cast|implicit conversion}0 of %select{Objective-C|block|C}1 pointer type %2 to %select{Objective-C|block|C}3 pointer type %4 requires a bridged cast
root: {$arg0 :select s0=|cast| s1=|implicit conversion|} of {$arg1 :select s0=|Objective-C| s1=|block| s2=|C|} pointer type {$arg2} to {$arg3 :select s0=|Objective-C| s1=|block| s2=|C|} pointer type {$arg4} requires a bridged cast

# err_arc_collection_forward
source: collection expression type %0 is a forward declaration
root: collection expression type {$arg0} is a forward declaration

# err_arc_convesion_of_weak_unavailable
source: %select{implicit conversion|cast}0 of weak-unavailable object of type %1 to a __weak object of type %2
root: {$arg0 :select s0=|implicit conversion| s1=|cast|} of weak-unavailable object of type {$arg1} to a __weak object of type {$arg2}

# err_arc_illegal_explicit_message
source: ARC forbids explicit message send of %0
root: ARC forbids explicit message send of {$arg0}

# err_arc_illegal_method_def
source: ARC forbids %select{implementation|synthesis}0 of %1
root: ARC forbids {$arg0 :select s0=|implementation| s1=|synthesis|} of {$arg1}

# err_arc_illegal_selector
source: ARC forbids use of %0 in a @selector
root: ARC forbids use of {$arg0} in a @selector

# err_arc_inconsistent_property_ownership
source: %select{|unsafe_unretained|strong|weak}1 property %0 may not also be declared %select{|__unsafe_unretained|__strong|__weak|__autoreleasing}2
root: {$arg1 :select s0=|| s1=|unsafe_unretained| s2=|strong| s3=|weak|} property {$arg0} may not also be declared {$arg2 :select s0=|| s1=|__unsafe_unretained| s2=|__strong| s3=|__weak| s4=|__autoreleasing|}

# err_arc_indirect_no_ownership
source: %select{pointer|reference}1 to non-const type %0 with no explicit ownership
root: {$arg1 :select s0=|pointer| s1=|reference|} to non-const type {$arg0} with no explicit ownership

# err_arc_lost_method_convention
source: method was declared as %select{an 'alloc'|a 'copy'|an 'init'|a 'new'}0 method, but its implementation doesn't match because %select{its result type is not an object pointer|its result type is unrelated to its receiver type}1
root: method was declared as {$arg0 :select s0=|an 'alloc'| s1=|a 'copy'| s2=|an 'init'| s3=|a 'new'|} method, but its implementation doesn't match because {$arg1 :select s0=|its result type is not an object pointer| s1=|its result type is unrelated to its receiver type|}

# err_arc_may_not_respond
source: no visible @interface for %0 declares the selector %1
root: no visible @interface for {$arg0} declares the selector {$arg1}

# err_arc_method_not_found
source: no known %select{instance|class}1 method for selector %0
root: no known {$arg1 :select s0=|instance| s1=|class|} method for selector {$arg0}

# err_arc_mismatched_cast
source: %select{implicit conversion|cast}0 of %select{%2|a non-Objective-C pointer type %2|a block pointer|an Objective-C pointer|an indirect pointer to an Objective-C pointer}1 to %3 is disallowed with ARC
root: {$arg0 :select s0=|implicit conversion| s1=|cast|} of {$arg1 :select s0=|{$arg2}| s1=|a non-Objective-C pointer type {$arg2}| s2=|a block pointer| s3=|an Objective-C pointer| s4=|an indirect pointer to an Objective-C pointer|} to {$arg3} is disallowed with ARC

# err_arc_multiple_method_decl
source: multiple methods named %0 found with mismatched result, parameter type or attributes
root: multiple methods named {$arg0} found with mismatched result, parameter type or attributes

# err_arc_new_array_without_ownership
source: 'new' cannot allocate an array of %0 with no explicit ownership
root: 'new' cannot allocate an array of {$arg0} with no explicit ownership

# err_arc_nonlocal_writeback
source: passing address of %select{non-local|non-scalar}0 object to __autoreleasing parameter for write-back
root: passing address of {$arg0 :select s0=|non-local| s1=|non-scalar|} object to __autoreleasing parameter for write-back

# err_arc_pseudo_dtor_inconstant_quals
source: pseudo-destructor destroys object of type %0 with inconsistently-qualified type %1
root: pseudo-destructor destroys object of type {$arg0} with inconsistently-qualified type {$arg1}

# err_arc_receiver_forward_class
source: receiver %0 for class message is a forward declaration
root: receiver {$arg0} for class message is a forward declaration

# err_arc_receiver_forward_instance
source: receiver type %0 for instance message is a forward declaration
root: receiver type {$arg0} for instance message is a forward declaration

# err_arc_strong_property_ownership
source: existing instance variable %1 for strong property %0 may not be %select{|__unsafe_unretained||__weak}2
root: existing instance variable {$arg1} for strong property {$arg0} may not be {$arg2 :select s0=|| s1=|__unsafe_unretained| s2=|| s3=|__weak|}

# err_arc_thread_ownership
source: thread-local variable has non-trivial ownership: type is %0
root: thread-local variable has non-trivial ownership: type is {$arg0}

# err_arc_typecheck_convert_incompatible_pointer
source: incompatible pointer types passing retainable parameter of type %0to a CF function expecting %1 type
root: incompatible pointer types passing retainable parameter of type {$arg0}to a CF function expecting {$arg1} type

# err_arc_weak_unavailable_property
source: synthesizing __weak instance variable of type %0, which does not support weak references
root: synthesizing __weak instance variable of type {$arg0}, which does not support weak references

# err_arg_is_not_destructurable
source: type %0 cannot be decomposed
root: type {$arg0} cannot be decomposed

# err_argument_invalid_range
source: argument value %0 is outside the valid range [%1, %2]
root: argument value {$arg0} is outside the valid range [{$arg1}, {$arg2}]

# err_argument_not_contiguous_bit_field
source: argument %0 value should represent a contiguous bit field
root: argument {$arg0} value should represent a contiguous bit field

# err_argument_not_multiple
source: argument should be a multiple of %0
root: argument should be a multiple of {$arg0}

# err_arith_conv_enum_float_cxx26
source: invalid %select{arithmetic between|bitwise operation between|comparison of|conditional expression between|compound assignment of}0 %select{floating-point|enumeration}1 type %2 %plural{2:with|4:from|:and}0 %select{enumeration|floating-point}1 type %3
root: invalid {$arg0 :select s0=|arithmetic between| s1=|bitwise operation between| s2=|comparison of| s3=|conditional expression between| s4=|compound assignment of|} {$arg1 :select s0=|floating-point| s1=|enumeration|} type {$arg2} %plural{2:with|4:from|:and}0 {$arg1 :select s0=|enumeration| s1=|floating-point|} type {$arg3}

# err_arithmetic_nonfragile_interface
source: arithmetic on pointer to interface %0, which is not a constant size for this architecture and platform
root: arithmetic on pointer to interface {$arg0}, which is not a constant size for this architecture and platform

# err_arm_invalid_coproc
source: coprocessor %0 must be configured as %select{GCP|CDE}1
root: coprocessor {$arg0} must be configured as {$arg1 :select s0=|GCP| s1=|CDE|}

# err_array_designator_empty_range
source: array designator range [%0, %1] is empty
root: array designator range [{$arg0}, {$arg1}] is empty

# err_array_designator_negative
source: array designator value '%0' is negative
root: array designator value '{$arg0}' is negative

# err_array_designator_non_array
source: array designator cannot initialize non-array type %0
root: array designator cannot initialize non-array type {$arg0}

# err_array_designator_too_large
source: array designator index (%0) exceeds array bounds (%1)
root: array designator index ({$arg0}) exceeds array bounds ({$arg1})

# err_array_element_alignment
source: size of array element of type %0 (%1 bytes) isn't a multiple of its alignment (%2 bytes)
root: size of array element of type {$arg0} ({$arg1} bytes) isn't a multiple of its alignment ({$arg2} bytes)

# err_array_incomplete_or_sizeless_type
source: array has %select{incomplete|sizeless}0 element type %1
root: array has {$arg0 :select s0=|incomplete| s1=|sizeless|} element type {$arg1}

# err_array_init_not_init_list
source: array initializer must be an initializer list%select{| or string literal| or wide string literal}0
root: array initializer must be an initializer list{$arg0 :select s0=|| s1=| or string literal| s2=| or wide string literal|}

# err_array_init_utf8_string_into_char
source: initialization of %select{|signed }0char array with UTF-8 string literal is not permitted by %select{'-fchar8_t'|C++20}1
root: initialization of {$arg0 :select s0=|| s1=|signed |}char array with UTF-8 string literal is not permitted by {$arg1 :select s0=|'-fchar8_t'| s1=|C++20|}

# err_array_of_abstract_type
source: array of abstract class type %0
root: array of abstract class type {$arg0}

# err_array_section_use
source: %select{OpenACC sub-array|OpenMP array section}0 is not allowed here
root: {$arg0 :select s0=|OpenACC sub-array| s1=|OpenMP array section|} is not allowed here

# err_array_size_ambiguous_conversion
source: ambiguous conversion of array size expression of type %0 to an integral or enumeration type
root: ambiguous conversion of array size expression of type {$arg0} to an integral or enumeration type

# err_array_size_explicit_conversion
source: array size expression of type %0 requires explicit conversion to type %1
root: array size expression of type {$arg0} requires explicit conversion to type {$arg1}

# err_array_size_incomplete_type
source: array size expression has incomplete class type %0
root: array size expression has incomplete class type {$arg0}

# err_array_size_non_int
source: size of array has non-integer type %0
root: size of array has non-integer type {$arg0}

# err_array_size_not_integral
source: array size expression must have integral or %select{|unscoped }0enumeration type, not %1
root: array size expression must have integral or {$arg0 :select s0=|| s1=|unscoped |}enumeration type, not {$arg1}

# err_array_static_not_outermost
source: %0 used in non-outermost array type derivation
root: {$arg0} used in non-outermost array type derivation

# err_array_static_outside_prototype
source: %0 used in array declarator outside of function prototype
root: {$arg0} used in array declarator outside of function prototype

# err_array_too_large
source: array is too large (%0 elements)
root: array is too large ({$arg0} elements)

# err_as_qualified_auto_decl
source: automatic variable qualified with an%select{| invalid}0 address space
root: automatic variable qualified with an{$arg0 :select s0=|| s1=| invalid|} address space

# err_asm_incomplete_type
source: asm operand has incomplete type %0
root: asm operand has incomplete type {$arg0}

# err_asm_input_duplicate_match
source: more than one input constraint matches the same output '%0'
root: more than one input constraint matches the same output '{$arg0}'

# err_asm_invalid_global_var_reg
source: register '%0' unsuitable for global register variables on this target
root: register '{$arg0}' unsuitable for global register variables on this target

# err_asm_invalid_input_constraint
source: invalid input constraint '%0' in asm
root: invalid input constraint '{$arg0}' in asm

# err_asm_invalid_input_size
source: invalid input size for constraint '%0'
root: invalid input size for constraint '{$arg0}'

# err_asm_invalid_lvalue_in_input
source: invalid lvalue in asm input for constraint '%0'
root: invalid lvalue in asm input for constraint '{$arg0}'

# err_asm_invalid_output_constraint
source: invalid output constraint '%0' in asm
root: invalid output constraint '{$arg0}' in asm

# err_asm_invalid_output_size
source: invalid output size for constraint '%0'
root: invalid output size for constraint '{$arg0}'

# err_asm_non_addr_value_in_memory_constraint
source: reference to a %select{bit-field|vector element|global register variable}0 in asm %select{input|output}1 with a memory constraint '%2'
root: reference to a {$arg0 :select s0=|bit-field| s1=|vector element| s2=|global register variable|} in asm {$arg1 :select s0=|input| s1=|output|} with a memory constraint '{$arg2}'

# err_asm_register_size_mismatch
source: size of register '%0' does not match variable size
root: size of register '{$arg0}' does not match variable size

# err_asm_unexpected_constraint_alternatives
source: asm constraint has an unexpected number of alternatives: %0 vs %1
root: asm constraint has an unexpected number of alternatives: {$arg0} vs {$arg1}

# err_asm_unknown_register_name
source: unknown register name '%0' in asm
root: unknown register name '{$arg0}' in asm

# err_assoc_compatible_types
source: type %0 in generic association compatible with previously specified type %1
root: type {$arg0} in generic association compatible with previously specified type {$arg1}

# err_assoc_type_nonobject
source: type %0 in generic association not an object type
root: type {$arg0} in generic association not an object type

# err_assoc_type_variably_modified
source: type %0 in generic association is a variably modified type
root: type {$arg0} in generic association is a variably modified type

# err_atomic_builtin_cannot_be_const
source: address argument to atomic builtin cannot be const-qualified (%0 invalid)
root: address argument to atomic builtin cannot be const-qualified ({$arg0} invalid)

# err_atomic_builtin_must_be_pointer
source: address argument to atomic builtin must be a pointer %select{|to a non-zero-sized object }1(%0 invalid)
root: address argument to atomic builtin must be a pointer {$arg1 :select s0=|| s1=|to a non-zero-sized object |}({$arg0} invalid)

# err_atomic_builtin_must_be_pointer_intfltptr
source: address argument to atomic builtin must be a pointer to integer, floating-point or pointer (%0 invalid)
root: address argument to atomic builtin must be a pointer to integer, floating-point or pointer ({$arg0} invalid)
