Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# warn_impcast_int_to_objc_signed_char_bool
source: implicit conversion from integral type %0 to 'BOOL'
root: implicit conversion from integral type {$arg0} to 'BOOL'

# warn_impcast_integer_64_32
source: implicit conversion loses integer precision: %0 to %1
root: implicit conversion loses integer precision: {$arg0} to {$arg1}

# warn_impcast_integer_float_precision
source: implicit conversion from %0 to %1 may lose precision
root: implicit conversion from {$arg0} to {$arg1} may lose precision

# warn_impcast_integer_float_precision_constant
source: implicit conversion from %2 to %3 changes value from %0 to %1
root: implicit conversion from {$arg2} to {$arg3} changes value from {$arg0} to {$arg1}

# warn_impcast_integer_precision
source: implicit conversion loses integer precision: %0 to %1
root: implicit conversion loses integer precision: {$arg0} to {$arg1}

# warn_impcast_integer_precision_constant
source: implicit conversion from %2 to %3 changes value from %0 to %1
root: implicit conversion from {$arg2} to {$arg3} changes value from {$arg0} to {$arg1}

# warn_impcast_integer_sign
source: implicit conversion changes signedness: %0 to %1
root: implicit conversion changes signedness: {$arg0} to {$arg1}

# warn_impcast_integer_sign_conditional
source: operand of ? changes signedness: %0 to %1
root: operand of ? changes signedness: {$arg0} to {$arg1}

# warn_impcast_literal_float_to_integer
source: implicit conversion from %0 to %1 changes value from %2 to %3
root: implicit conversion from {$arg0} to {$arg1} changes value from {$arg2} to {$arg3}

# warn_impcast_literal_float_to_integer_out_of_range
source: implicit conversion of out of range value from %0 to %1 is undefined
root: implicit conversion of out of range value from {$arg0} to {$arg1} is undefined

# warn_impcast_null_pointer_to_integer
source: implicit conversion of %select{NULL|nullptr}0 constant to %1
root: implicit conversion of {$arg0 :select s0=|NULL| s1=|nullptr|} constant to {$arg1}

# warn_impcast_pointer_to_bool
source: address of %select{'%1'|function '%1'|array '%1'|lambda function pointer conversion operator}0 will always evaluate to 'true'
root: address of {$arg0 :select s0=|'{$arg1}'| s1=|function '{$arg1}'| s2=|array '{$arg1}'| s3=|lambda function pointer conversion operator|} will always evaluate to 'true'

# warn_impcast_single_bit_bitield_precision_constant
source: implicit truncation from %2 to a one-bit wide bit-field changes value from %0 to %1
root: implicit truncation from {$arg2} to a one-bit wide bit-field changes value from {$arg0} to {$arg1}

# warn_impcast_string_literal_to_bool
source: implicit conversion turns string literal into bool: %0 to %1
root: implicit conversion turns string literal into bool: {$arg0} to {$arg1}

# warn_impcast_unicode_char_type
source: implicit conversion from %0 to %1 may change the meaning of the represented code unit
root: implicit conversion from {$arg0} to {$arg1} may change the meaning of the represented code unit

# warn_impcast_unicode_char_type_constant
source: implicit conversion from %0 to %1 changes the meaning of the %select{code unit|code point}2 '%3'
root: implicit conversion from {$arg0} to {$arg1} changes the meaning of the {$arg2 :select s0=|code unit| s1=|code point|} '{$arg3}'

# warn_impcast_unicode_precision
source: implicit conversion from %0 to %1 may lose precision and change the meaning of the represented code unit
root: implicit conversion from {$arg0} to {$arg1} may lose precision and change the meaning of the represented code unit

# warn_impcast_vector_scalar
source: implicit conversion turns vector to scalar: %0 to %1
root: implicit conversion turns vector to scalar: {$arg0} to {$arg1}

# warn_impl_required_for_class_property
source: class property %0 requires method %1 to be defined - use @dynamic or provide a method implementation in this class implementation
root: class property {$arg0} requires method {$arg1} to be defined - use @dynamic or provide a method implementation in this class implementation

# warn_impl_required_in_category_for_class_property
source: class property %0 requires method %1 to be defined - use @dynamic or provide a method implementation in this category
root: class property {$arg0} requires method {$arg1} to be defined - use @dynamic or provide a method implementation in this category

# warn_implements_nscopying
source: default assign attribute on property %0 which implements NSCopying protocol is not appropriate with -fobjc-gc[-only]
root: default assign attribute on property {$arg0} which implements NSCopying protocol is not appropriate with -fobjc-gc[-only]

# warn_implicit_decl_no_jmp_buf
source: declaration of built-in function '%0' requires the declaration of the 'jmp_buf' type, commonly provided in the header <setjmp.h>
root: declaration of built-in function '{$arg0}' requires the declaration of the 'jmp_buf' type, commonly provided in the header <setjmp.h>

# warn_implicit_decl_requires_sysheader
source: declaration of built-in function '%1' requires inclusion of the header <%0>
root: declaration of built-in function '{$arg1}' requires inclusion of the header <{$arg0}>

# warn_implicit_function_decl
source: implicit declaration of function %0
root: implicit declaration of function {$arg0}

# warn_import_implementation_partition_unit_in_interface_unit
source: importing an implementation partition unit in a module interface is not recommended. Names from %0 may not be reachable
root: importing an implementation partition unit in a module interface is not recommended. Names from {$arg0} may not be reachable

# warn_import_on_definition
source: import %select{module|name}0 cannot be applied to a function with a definition
root: import {$arg0 :select s0=|module| s1=|name|} cannot be applied to a function with a definition

# warn_inaccessible_base_class
source: direct base %0 is inaccessible due to ambiguity:%1
root: direct base {$arg0} is inaccessible due to ambiguity:{$arg1}

# warn_incomplete_encoded_type
source: encoding of %0 type is incomplete because %1 component has unknown encoding
root: encoding of {$arg0} type is incomplete because {$arg1} component has unknown encoding

# warn_inconsistent_array_form
source: argument %0 of type %1 with mismatched bound
root: argument {$arg0} of type {$arg1} with mismatched bound

# warn_inconsistent_destructor_marked_not_override_overriding
source: %0 overrides a destructor but is not marked 'override'
root: {$arg0} overrides a destructor but is not marked 'override'

# warn_inconsistent_function_marked_not_override_overriding
source: %0 overrides a member function but is not marked 'override'
root: {$arg0} overrides a member function but is not marked 'override'

# warn_init_list_constant_narrowing
source: constant expression evaluates to %0 which cannot be narrowed to type %1 in C++11
root: constant expression evaluates to {$arg0} which cannot be narrowed to type {$arg1} in C++11

# warn_init_list_type_narrowing
source: type %0 cannot be narrowed to %1 in initializer list in C++11
root: type {$arg0} cannot be narrowed to {$arg1} in initializer list in C++11

# warn_init_list_variable_narrowing
source: non-constant-expression cannot be narrowed from type %0 to %1 in initializer list in C++11
root: non-constant-expression cannot be narrowed from type {$arg0} to {$arg1} in initializer list in C++11

# warn_init_priority_reserved
source: requested 'init_priority' %0 is reserved for internal use
root: requested 'init_priority' {$arg0} is reserved for internal use

# warn_init_ptr_member_to_parameter_addr
source: initializing pointer member %0 with the stack address of %select{variable|parameter}2 %1
root: initializing pointer member {$arg0} with the stack address of {$arg2 :select s0=|variable| s1=|parameter|} {$arg1}

# warn_initializer_out_of_order
source: %select{field|base class}0 %1 will be initialized after %select{field|base}2 %3
root: {$arg0 :select s0=|field| s1=|base class|} {$arg1} will be initialized after {$arg2 :select s0=|field| s1=|base|} {$arg3}

# warn_initializer_overrides
source: initializer %select{partially |}0overrides prior initialization of this subobject
root: initializer {$arg0 :select s0=|partially | s1=||}overrides prior initialization of this subobject

# warn_initializer_string_for_char_array_too_long_for_cpp
source: initializer-string for character array is too long for C++, array size is %0 but initializer has size %1 (including the null terminating character)
root: initializer-string for character array is too long for C++, array size is {$arg0} but initializer has size {$arg1} (including the null terminating character)

# warn_initializer_string_for_char_array_too_long_no_nonstring
source: initializer-string for character array is too long, array size is %0 but initializer has size %1 (including the null terminating character); did you mean to use the 'nonstring' attribute?
root: initializer-string for character array is too long, array size is {$arg0} but initializer has size {$arg1} (including the null terminating character); did you mean to use the 'nonstring' attribute?

# warn_instance_method_on_class_found
source: instance method %0 found instead of class method %1
root: instance method {$arg0} found instead of class method {$arg1}

# warn_int_to_pointer_cast
source: cast to %1 from smaller integer type %0
root: cast to {$arg1} from smaller integer type {$arg0}

# warn_int_to_void_pointer_cast
source: cast to %1 from smaller integer type %0
root: cast to {$arg1} from smaller integer type {$arg0}

# warn_interrupt_signal_attribute_invalid
source: %select{MIPS|MSP430|RISC-V|AVR}0 '%select{interrupt|signal}1' attribute only applies to functions that have %select{no parameters|a 'void' return type}2
root: {$arg0 :select s0=|MIPS| s1=|MSP430| s2=|RISC-V| s3=|AVR|} '{$arg1 :select s0=|interrupt| s1=|signal|}' attribute only applies to functions that have {$arg2 :select s0=|no parameters| s1=|a 'void' return type|}

# warn_invalid_add_func_effects
source: attribute '%0' should not be added via type conversion
root: attribute '{$arg0}' should not be added via type conversion

# warn_invalid_specialization
source: %0 cannot be specialized%select{|: %2}1
root: {$arg0} cannot be specialized{$arg1 :select s0=|| s1=|: {$arg2}|}

# warn_ivar_use_hidden
source: local declaration of %0 hides instance variable
root: local declaration of {$arg0} hides instance variable

# warn_kern_is_inline
source: ignored 'inline' attribute on kernel function %0
root: ignored 'inline' attribute on kernel function {$arg0}

# warn_kern_is_method
source: kernel function %0 is a member function; this may not be accepted by nvcc
root: kernel function {$arg0} is a member function; this may not be accepted by nvcc

# warn_left_shift_always
source: converting the result of '<<' to a boolean always evaluates to %select{false|true}0
root: converting the result of '<<' to a boolean always evaluates to {$arg0 :select s0=|false| s1=|true|}

# warn_lock_exclusive_and_shared
source: %0 '%1' is acquired exclusively and shared in the same scope
root: {$arg0} '{$arg1}' is acquired exclusively and shared in the same scope

# warn_lock_some_predecessors
source: %0 '%1' is not held on every path through here
root: {$arg0} '{$arg1}' is not held on every path through here

# warn_logical_instead_of_bitwise
source: use of logical '%0' with constant operand
root: use of logical '{$arg0}' with constant operand

# warn_logical_not_on_lhs_of_check
source: logical not is only applied to the left hand side of this %select{comparison|bitwise operator}0
root: logical not is only applied to the left hand side of this {$arg0 :select s0=|comparison| s1=|bitwise operator|}

# warn_loop_ctrl_binds_to_inner
source: '%0' is bound to current loop, GCC binds it to the enclosing loop
root: '{$arg0}' is bound to current loop, GCC binds it to the enclosing loop

# warn_loop_state_mismatch
source: state of variable '%0' must match at the entry and exit of loop
root: state of variable '{$arg0}' must match at the entry and exit of loop

# warn_max_unsigned_zero
source: taking the max of %select{a value and unsigned zero|unsigned zero and a value}0 is always equal to the other value
root: taking the max of {$arg0 :select s0=|a value and unsigned zero| s1=|unsigned zero and a value|} is always equal to the other value

# warn_maybe_uninit_var
source: variable %0 may be uninitialized when %select{used here|captured by block}1
root: variable {$arg0} may be uninitialized when {$arg1 :select s0=|used here| s1=|captured by block|}

# warn_maynot_respond
source: %0 may not respond to %1
root: {$arg0} may not respond to {$arg1}

# warn_member_extra_qualification
source: extra qualification on member %0
root: extra qualification on member {$arg0}

# warn_memsize_comparison
source: size argument in %0 call is a comparison
root: size argument in {$arg0} call is a comparison

# warn_mismatched_availability_override
source: %select{|overriding }4method %select{introduced after|deprecated before|obsoleted before}0 %select{the protocol method it implements|overridden method}4 on %1 (%2 vs. %3)
root: {$arg4 :select s0=|| s1=|overriding |}method {$arg0 :select s0=|introduced after| s1=|deprecated before| s2=|obsoleted before|} {$arg4 :select s0=|the protocol method it implements| s1=|overridden method|} on {$arg1} ({$arg2} vs. {$arg3})

# warn_mismatched_availability_override_unavail
source: %select{|overriding }1method cannot be unavailable on %0 when %select{the protocol method it implements|its overridden method}1 is available
root: {$arg1 :select s0=|| s1=|overriding |}method cannot be unavailable on {$arg0} when {$arg1 :select s0=|the protocol method it implements| s1=|its overridden method|} is available

# warn_mismatched_delete_new
source: 'delete%select{|[]}0' applied to a pointer that was allocated with 'new%select{[]|}0'; did you mean 'delete%select{[]|}0'?
root: 'delete{$arg0 :select s0=|| s1=|[]|}' applied to a pointer that was allocated with 'new{$arg0 :select s0=|[]| s1=||}'; did you mean 'delete{$arg0 :select s0=|[]| s1=||}'?

# warn_mismatched_func_effect_override
source: attribute '%0' on overriding function does not match base declaration
root: attribute '{$arg0}' on overriding function does not match base declaration

# warn_mismatched_func_effect_redeclaration
source: attribute '%0' on function does not match previous declaration
root: attribute '{$arg0}' on function does not match previous declaration

# warn_mismatched_import
source: import %select{module|name}0 (%1) does not match the import %select{module|name}0 (%2) of the previous declaration
root: import {$arg0 :select s0=|module| s1=|name|} ({$arg1}) does not match the import {$arg0 :select s0=|module| s1=|name|} ({$arg2}) of the previous declaration

# warn_mismatched_nullability_attr
source: nullability specifier %0 conflicts with existing specifier %1
root: nullability specifier {$arg0} conflicts with existing specifier {$arg1}

# warn_mismatched_section
source: %select{codeseg|section}0 does not match previous declaration
root: {$arg0 :select s0=|codeseg| s1=|section|} does not match previous declaration

# warn_missing_case
source: %plural{1:enumeration value %1 not handled in switch|2:enumeration values %1 and %2 not handled in switch|3:enumeration values %1, %2, and %3 not handled in switch|:%0 enumeration values not handled in switch: %1, %2, %3...}0
root: %plural{1:enumeration value {$arg1} not handled in switch|2:enumeration values {$arg1} and {$arg2} not handled in switch|3:enumeration values {$arg1}, {$arg2}, and {$arg3} not handled in switch|:{$arg0} enumeration values not handled in switch: {$arg1}, {$arg2}, {$arg3}...}0

# warn_missing_case_for_condition
source: no case matching constant switch condition '%0'
root: no case matching constant switch condition '{$arg0}'

# warn_missing_designated_field_initializers
source: missing field %0 initializer
root: missing field {$arg0} initializer

# warn_missing_field_initializers
source: missing field %0 initializer
root: missing field {$arg0} initializer

# warn_missing_prototype
source: no previous prototype for function %0
root: no previous prototype for function {$arg0}

# warn_missing_sdksettings_for_availability_checking
source: %0 availability is ignored without a valid 'SDKSettings.json' in the SDK
root: {$arg0} availability is ignored without a valid 'SDKSettings.json' in the SDK

# warn_missing_sentinel
source: missing sentinel in %select{function call|method dispatch|block call}0
root: missing sentinel in {$arg0 :select s0=|function call| s1=|method dispatch| s2=|block call|}

# warn_missing_variable_declarations
source: no previous extern declaration for non-static variable %0
root: no previous extern declaration for non-static variable {$arg0}

# warn_mixed_sign_comparison
source: comparison of integers of different signs: %0 and %1
root: comparison of integers of different signs: {$arg0} and {$arg1}

# warn_modifying_shadowing_decl
source: modifying constructor parameter %0 that shadows a field of %1
root: modifying constructor parameter {$arg0} that shadows a field of {$arg1}

# warn_ms_bitfield_mismatched_storage_packing
source: bit-field %0 of type %1 has a different storage size than the preceding bit-field (%2 vs %3 bytes) and will not be packed under the Microsoft ABI
root: bit-field {$arg0} of type {$arg1} has a different storage size than the preceding bit-field ({$arg2} vs {$arg3} bytes) and will not be packed under the Microsoft ABI

# warn_ms_inline_non_function
source: 'inline' can only appear on functions%select{| and non-local variables}0
root: 'inline' can only appear on functions{$arg0 :select s0=|| s1=| and non-local variables|}

# warn_multiple_method_decl
source: multiple methods named %0 found
root: multiple methods named {$arg0} found

# warn_multiple_selectors
source: several methods with selector %0 of mismatched types are found for the @selector expression
root: several methods with selector {$arg0} of mismatched types are found for the @selector expression

# warn_musttail_local_temp_addr_ref
source: passing %select{address of|reference to}0 local temporary object to musttail function
root: passing {$arg0 :select s0=|address of| s1=|reference to|} local temporary object to musttail function

# warn_namespace_member_extra_qualification
source: extra qualification on member %0
root: extra qualification on member {$arg0}

# warn_new_dangling_initializer_list
source: array backing %select{initializer list subobject of the allocated object|the allocated initializer list}0 will be destroyed at the end of the full-expression
root: array backing {$arg0 :select s0=|initializer list subobject of the allocated object| s1=|the allocated initializer list|} will be destroyed at the end of the full-expression

# warn_no_autosynthesis_property
source: auto property synthesis will not synthesize property %0 because it is 'readwrite' but it will be synthesized 'readonly' via another property
root: auto property synthesis will not synthesize property {$arg0} because it is 'readwrite' but it will be synthesized 'readonly' via another property

# warn_no_autosynthesis_shared_ivar_property
source: auto property synthesis will not synthesize property %0 because it cannot share an ivar with another synthesized property
root: auto property synthesis will not synthesize property {$arg0} because it cannot share an ivar with another synthesized property

# warn_no_constructor_for_refconst
source: %select{struct|interface|union|class|enum}0 %1 does not declare any constructor to initialize its non-modifiable members
root: {$arg0 :select s0=|struct| s1=|interface| s2=|union| s3=|class| s4=|enum|} {$arg1} does not declare any constructor to initialize its non-modifiable members

# warn_no_dynamic_cast_with_rtti_disabled
source: dynamic_cast will not work since RTTI data is disabled by %select{-fno-rtti-data|/GR-}0
root: dynamic_cast will not work since RTTI data is disabled by {$arg0 :select s0=|-fno-rtti-data| s1=|/GR-|}

# warn_no_typeid_with_rtti_disabled
source: typeid will not work since RTTI data is disabled by %select{-fno-rtti-data|/GR-}0
root: typeid will not work since RTTI data is disabled by {$arg0 :select s0=|-fno-rtti-data| s1=|/GR-|}

# warn_no_underlying_type_specified_for_enum_bitfield
source: enums in the Microsoft ABI are signed integers by default; consider giving the enum %0 an unsigned underlying type to make this code portable
root: enums in the Microsoft ABI are signed integers by default; consider giving the enum {$arg0} an unsigned underlying type to make this code portable

# warn_no_unlock
source: %0 '%1' is still held at the end of function
root: {$arg0} '{$arg1}' is still held at the end of function

# warn_non_aligned_allocation_function
source: under -fcoro-aligned-allocation, the non-aligned allocation function for the promise type %0 has higher precedence than the global aligned allocation function
root: under -fcoro-aligned-allocation, the non-aligned allocation function for the promise type {$arg0} has higher precedence than the global aligned allocation function

# warn_non_contravariant_overriding_param_types
source: conflicting parameter types in declaration of %0: %1 vs %2
root: conflicting parameter types in declaration of {$arg0}: {$arg1} vs {$arg2}

# warn_non_contravariant_param_types
source: conflicting parameter types in implementation of %0: %1 vs %2
root: conflicting parameter types in implementation of {$arg0}: {$arg1} vs {$arg2}

# warn_non_covariant_overriding_ret_types
source: conflicting return type in declaration of %0: %1 vs %2
root: conflicting return type in declaration of {$arg0}: {$arg1} vs {$arg2}

# warn_non_covariant_ret_types
source: conflicting return type in implementation of %0: %1 vs %2
root: conflicting return type in implementation of {$arg0}: {$arg1} vs {$arg2}

# warn_non_literal_null_pointer
source: expression which evaluates to zero treated as a null pointer constant of type %0
root: expression which evaluates to zero treated as a null pointer constant of type {$arg0}

# warn_non_pod_vararg_with_format_string
source: cannot pass %select{non-POD|non-trivial}0 object of type %1 to variadic %select{function|block|method|constructor}2; expected type from format string was %3
root: cannot pass {$arg0 :select s0=|non-POD| s1=|non-trivial|} object of type {$arg1} to variadic {$arg2 :select s0=|function| s1=|block| s2=|method| s3=|constructor|}; expected type from format string was {$arg3}

# warn_non_prototype_changes_behavior
source: a function %select{declaration|definition}0 without a prototype is deprecated in all versions of C %select{and is not supported in C23|and is treated as a zero-parameter prototype in C23, conflicting with a %select{previous|subsequent}2 %select{declaration|definition}3}1
root: a function {$arg0 :select s0=|declaration| s1=|definition|} without a prototype is deprecated in all versions of C %select{and is not supported in C23|and is treated as a zero-parameter prototype in C23, conflicting with a {$arg2 :select s0=|previous| s1=|subsequent|} {$arg1 :select s0=|declaration| s1=|definition}3|}

# warn_non_virtual_dtor
source: %0 has virtual functions but non-virtual destructor
root: {$arg0} has virtual functions but non-virtual destructor

# warn_nonnull_expr_compare
source: comparison of nonnull %select{function call|parameter}0 '%1' %select{not |}2equal to a null pointer is '%select{true|false}2' on first encounter
root: comparison of nonnull {$arg0 :select s0=|function call| s1=|parameter|} '{$arg1}' {$arg2 :select s0=|not | s1=||}equal to a null pointer is '{$arg2 :select s0=|true| s1=|false|}' on first encounter

# warn_noreturn_coroutine
source: coroutine %0 cannot be declared 'noreturn' as it always returns a coroutine handle
root: coroutine {$arg0} cannot be declared 'noreturn' as it always returns a coroutine handle
