Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSerializationKinds.xlf
Languages: root

# err_ast_file_diagopt_mismatch
source: %0 is currently enabled, but was not in the AST file '%1'
root: {$arg0} is currently enabled, but was not in the AST file '{$arg1}'

# err_ast_file_different_branch
source: %select{PCH|module|AST}0 file '%1' built from a different branch (%2) than the compiler (%3)
root: {$arg0 :select s0=|PCH| s1=|module| s2=|AST|} file '{$arg1}' built from a different branch ({$arg2}) than the compiler ({$arg3})

# err_ast_file_invalid
source: file '%1' is not a valid precompiled %select{PCH|module|AST}0 file: %2
root: file '{$arg1}' is not a valid precompiled {$arg0 :select s0=|PCH| s1=|module| s2=|AST|} file: {$arg2}

# err_ast_file_langopt_mismatch
source: %0 was %select{disabled|enabled}1 in AST file '%3' but is currently %select{disabled|enabled}2
root: {$arg0} was {$arg1 :select s0=|disabled| s1=|enabled|} in AST file '{$arg3}' but is currently {$arg2 :select s0=|disabled| s1=|enabled|}

# err_ast_file_langopt_value_mismatch
source: %0 differs in AST file '%1' vs. current file
root: {$arg0} differs in AST file '{$arg1}' vs. current file

# err_ast_file_macro_def_conflict
source: definition of macro '%0' differs between the AST file '%3' ('%1') and the command line ('%2')
root: definition of macro '{$arg0}' differs between the AST file '{$arg3}' ('{$arg1}') and the command line ('{$arg2}')

# err_ast_file_macro_def_undef
source: macro '%0' was %select{defined|undef'd}1 in the AST file '%2' but %select{undef'd|defined}1 on the command line
root: macro '{$arg0}' was {$arg1 :select s0=|defined| s1=|undef'd|} in the AST file '{$arg2}' but {$arg1 :select s0=|undef'd| s1=|defined|} on the command line

# err_ast_file_modulecache_mismatch
source: AST file '%2' was compiled with module cache path '%0', but the path is currently '%1'
root: AST file '{$arg2}' was compiled with module cache path '{$arg0}', but the path is currently '{$arg1}'

# err_ast_file_not_found
source: %select{PCH|module|AST}0 file '%1' not found%select{|: %3}2
root: {$arg0 :select s0=|PCH| s1=|module| s2=|AST|} file '{$arg1}' not found{$arg2 :select s0=|| s1=|: {$arg3}|}

# err_ast_file_out_of_date
source: %select{PCH|module|AST}0 file '%1' is out of date and needs to be rebuilt%select{|: %3}2
root: {$arg0 :select s0=|PCH| s1=|module| s2=|AST|} file '{$arg1}' is out of date and needs to be rebuilt{$arg2 :select s0=|| s1=|: {$arg3}|}

# err_ast_file_pp_detailed_record
source: %select{command line contains|AST file '%1' was built with}0 '-detailed-preprocessing-record' but %select{AST file '%1' was not built with it|it is not present on the command line}0
root: {$arg0 :select s0=|command line contains| s1=|AST file '{$arg1}' was built with|} '-detailed-preprocessing-record' but {$arg0 :select s0=|AST file '{$arg1}' was not built with it| s1=|it is not present on the command line|}

# err_ast_file_targetopt_feature_mismatch
source: %select{AST file '%1' was|current translation unit is}0 compiled with the target feature '%2' but the %select{current translation unit is|AST file '%1' was}0 not
root: {$arg0 :select s0=|AST file '{$arg1}' was| s1=|current translation unit is|} compiled with the target feature '{$arg2}' but the {$arg0 :select s0=|current translation unit is| s1=|AST file '{$arg1}' was|} not

# err_ast_file_targetopt_mismatch
source: AST file '%0' was compiled for the %1 '%2' but the current translation unit is being compiled for target '%3'
root: AST file '{$arg0}' was compiled for the {$arg1} '{$arg2}' but the current translation unit is being compiled for target '{$arg3}'

# err_ast_file_undef
source: %select{command line contains|AST file '%1' was built with}0 '-undef' but %select{AST file '%1' was not built with it|it is not present on the command line}0
root: {$arg0 :select s0=|command line contains| s1=|AST file '{$arg1}' was built with|} '-undef' but {$arg0 :select s0=|AST file '{$arg1}' was not built with it| s1=|it is not present on the command line|}

# err_ast_file_version_too_new
source: %select{PCH|module|AST}0 file '%1' uses a newer format that cannot be read
root: {$arg0 :select s0=|PCH| s1=|module| s2=|AST|} file '{$arg1}' uses a newer format that cannot be read

# err_ast_file_version_too_old
source: %select{PCH|module|AST}0 file '%1' uses an older format that is no longer supported
root: {$arg0 :select s0=|PCH| s1=|module| s2=|AST|} file '{$arg1}' uses an older format that is no longer supported

# err_ast_file_with_compiler_errors
source: %select{PCH|module|AST}0 file '%1' contains compiler errors
root: {$arg0 :select s0=|PCH| s1=|module| s2=|AST|} file '{$arg1}' contains compiler errors

# err_failed_to_find_module_file
source: failed to find module file for module '%0'
root: failed to find module file for module '{$arg0}'

# err_fe_ast_file_modified
source: file '%0' has been modified since the %select{precompiled header|module file|AST file}1 '%2' was built: %select{size|mtime|content}3 changed%select{| (was %5, now %6)}4
root: file '{$arg0}' has been modified since the {$arg1 :select s0=|precompiled header| s1=|module file| s2=|AST file|} '{$arg2}' was built: {$arg3 :select s0=|size| s1=|mtime| s2=|content|} changed{$arg4 :select s0=|| s1=| (was {$arg5}, now {$arg6})|}

# err_fe_not_a_pch_file
source: input is not a PCH file: '%0'
root: input is not a PCH file: '{$arg0}'

# err_fe_pch_file_overridden
source: file '%0' from the precompiled header has been overridden
root: file '{$arg0}' from the precompiled header has been overridden

# err_fe_pch_malformed
source: malformed or corrupted AST file: '%0'
root: malformed or corrupted AST file: '{$arg0}'

# err_fe_pch_malformed_block
source: malformed block record in PCH file: '%0'
root: malformed block record in PCH file: '{$arg0}'

# err_fe_unable_to_read_pch_file
source: unable to read PCH file %0: '%1'
root: unable to read PCH file {$arg0}: '{$arg1}'

# err_imported_module_modmap_changed
source: module '%0' %select{in|imported by}4 AST file '%1' found in a different module map file (%2) than when the importing AST file was built (%3)
root: module '{$arg0}' {$arg4 :select s0=|in| s1=|imported by|} AST file '{$arg1}' found in a different module map file ({$arg2}) than when the importing AST file was built ({$arg3})

# err_imported_module_not_found
source: module '%0' in AST file '%1' %select{(imported by AST file '%2') |}4is not defined in any loaded module map file; maybe you need to load '%3'?
root: module '{$arg0}' in AST file '{$arg1}' {$arg4 :select s0=|(imported by AST file '{$arg2}') | s1=||}is not defined in any loaded module map file; maybe you need to load '{$arg3}'?

# err_imported_module_relocated
source: module '%0' was built in directory '%1' but now resides in directory '%2'
root: module '{$arg0}' was built in directory '{$arg1}' but now resides in directory '{$arg2}'

# err_module_different_modmap
source: module '%0' %select{uses|does not use}1 additional module map '%2'%select{| not}1 used when the module was built
root: module '{$arg0}' {$arg1 :select s0=|uses| s1=|does not use|} additional module map '{$arg2}'{$arg1 :select s0=|| s1=| not|} used when the module was built

# err_module_file_conflict
source: module '%0' is defined in both '%1' and '%2'
root: module '{$arg0}' is defined in both '{$arg1}' and '{$arg2}'

# err_module_file_missing_top_level_submodule
source: module file '%0' is missing its top-level submodule
root: module file '{$arg0}' is missing its top-level submodule

# err_module_file_not_module
source: AST file '%0' was not built as a module
root: AST file '{$arg0}' was not built as a module

# err_module_no_size_mtime_for_header
source: cannot emit module %0: %select{size|mtime}1 must be explicitly specified for missing header file "%2"
root: cannot emit module {$arg0}: {$arg1 :select s0=|size| s1=|mtime|} must be explicitly specified for missing header file "{$arg2}"

# err_module_odr_violation_different_instantiations
source: instantiation of %q0 is different in different modules
root: instantiation of {$arg0 :q} is different in different modules

# err_module_odr_violation_missing_decl
source: %q0 from module '%1' is not present in definition of %q2%select{ in module '%4'| provided earlier}3
root: {$arg0 :q} from module '{$arg1}' is not present in definition of {$arg2 :q}{$arg3 :select s0=| in module '{$arg4}'| s1=| provided earlier|}

# err_module_unable_to_hash_content
source: failed to hash content for '%0' because memory buffer cannot be retrieved
root: failed to hash content for '{$arg0}' because memory buffer cannot be retrieved

# note_imported_by_pch_module_not_found
source: consider adding '%0' to the header search path
root: consider adding '{$arg0}' to the header search path

# note_module_cache_path
source: after modifying system headers, please delete the module cache at '%0'
root: after modifying system headers, please delete the module cache at '{$arg0}'

# note_module_file_imported_by
source: imported by %select{|module '%2' in }1'%0'
root: imported by {$arg1 :select s0=|| s1=|module '{$arg2}' in |}'{$arg0}'

# note_module_odr_violation_no_possible_decls
source: definition has no member %0
root: definition has no member {$arg0}

# note_module_odr_violation_possible_decl
source: declaration of %0 does not match
root: declaration of {$arg0} does not match

# note_pch_rebuild_required
source: please rebuild precompiled header '%0'
root: please rebuild precompiled header '{$arg0}'

# note_pch_required_by
source: '%0' required by '%1'
root: '{$arg0}' required by '{$arg1}'

# note_pch_vfsoverlay_empty
source: %select{PCH|current translation unit}0 has no VFS overlays
root: {$arg0 :select s0=|PCH| s1=|current translation unit|} has no VFS overlays

# note_pch_vfsoverlay_files
source: %select{PCH|current translation unit}0 has the following VFS overlays: %1
root: {$arg0 :select s0=|PCH| s1=|current translation unit|} has the following VFS overlays: {$arg1}

# remark_module_import
source: importing module '%0'%select{| into '%3'}2 from '%1'
root: importing module '{$arg0}'{$arg2 :select s0=|| s1=| into '{$arg3}'|} from '{$arg1}'

# warn_decls_in_multiple_modules
source: declaration %0 is detected to be defined in multiple module units, first is from '%1' and second is from '%2'; the compiler may not be good at merging the definitions.
root: declaration {$arg0} is detected to be defined in multiple module units, first is from '{$arg1}' and second is from '{$arg2}'; the compiler may not be good at merging the definitions.

# warn_duplicate_module_file_extension
source: duplicate module file extension block name '%0'
root: duplicate module file extension block name '{$arg0}'

# warn_module_file_mapping_mismatch
source: loaded module file '%0' conflicts with imported file '%1'
root: loaded module file '{$arg0}' conflicts with imported file '{$arg1}'

# warn_module_system_bit_conflict
source: module file '%0' was validated as a system module and is now being imported as a non-system module; any difference in diagnostic options will be ignored
root: module file '{$arg0}' was validated as a system module and is now being imported as a non-system module; any difference in diagnostic options will be ignored

# warn_module_uses_date_time
source: %select{precompiled header|module}0 uses __DATE__ or __TIME__
root: {$arg0 :select s0=|precompiled header| s1=|module|} uses __DATE__ or __TIME__
