Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# err_temp_copy_deleted
source: %select{copying variable|copying parameter|initializing template parameter|returning object|initializing statement expression result|throwing object|copying member subobject|copying array element|allocating object|copying temporary|initializing base subobject|initializing vector element|capturing value}0 of type %1 invokes deleted constructor
root: {$arg0 :select s0=|copying variable| s1=|copying parameter| s2=|initializing template parameter| s3=|returning object| s4=|initializing statement expression result| s5=|throwing object| s6=|copying member subobject| s7=|copying array element| s8=|allocating object| s9=|copying temporary| s10=|initializing base subobject| s11=|initializing vector element| s12=|capturing value|} of type {$arg1} invokes deleted constructor

# err_temp_copy_incomplete
source: copying a temporary object of incomplete type %0
root: copying a temporary object of incomplete type {$arg0}

# err_temp_copy_no_viable
source: no viable constructor %select{copying variable|copying parameter|initializing template parameter|returning object|initializing statement expression result|throwing object|copying member subobject|copying array element|allocating object|copying temporary|initializing base subobject|initializing vector element|capturing value}0 of type %1
root: no viable constructor {$arg0 :select s0=|copying variable| s1=|copying parameter| s2=|initializing template parameter| s3=|returning object| s4=|initializing statement expression result| s5=|throwing object| s6=|copying member subobject| s7=|copying array element| s8=|allocating object| s9=|copying temporary| s10=|initializing base subobject| s11=|initializing vector element| s12=|capturing value|} of type {$arg1}

# err_template_arg_address_of_non_pointer
source: address taken in non-type template argument for template parameter of reference type %0
root: address taken in non-type template argument for template parameter of reference type {$arg0}

# err_template_arg_deduced_incomplete_pack
source: deduced incomplete pack %0 for template parameter %1
root: deduced incomplete pack {$arg0} for template parameter {$arg1}

# err_template_arg_field
source: non-type template argument refers to non-static data member %0
root: non-type template argument refers to non-static data member {$arg0}

# err_template_arg_invalid
source: non-type template argument '%0' is invalid
root: non-type template argument '{$arg0}' is invalid

# err_template_arg_list_constraints_not_satisfied
source: constraints not satisfied for %select{class template|function template|variable template|alias template|template template parameter|template}0 %1%2
root: constraints not satisfied for {$arg0 :select s0=|class template| s1=|function template| s2=|variable template| s3=|alias template| s4=|template template parameter| s5=|template|} {$arg1}{$arg2}

# err_template_arg_list_different_arity
source: %select{too few|too many}0 template arguments for %select{class template|function template|variable template|alias template|template template parameter|concept|template}1 %2
root: {$arg0 :select s0=|too few| s1=|too many|} template arguments for {$arg1 :select s0=|class template| s1=|function template| s2=|variable template| s3=|alias template| s4=|template template parameter| s5=|concept| s6=|template|} {$arg2}

# err_template_arg_method
source: non-type template argument refers to non-static member function %0
root: non-type template argument refers to non-static member function {$arg0}

# err_template_arg_must_be_template
source: template argument for template template parameter must be a class template%select{| or type alias template}0
root: template argument for template template parameter must be a class template{$arg0 :select s0=|| s1=| or type alias template|}

# err_template_arg_nontype_ambig
source: template argument for non-type template parameter is treated as function type %0
root: template argument for non-type template parameter is treated as function type {$arg0}

# err_template_arg_not_address_constant
source: non-type template argument of type %0 is not a constant expression
root: non-type template argument of type {$arg0} is not a constant expression

# err_template_arg_not_address_of
source: non-type template argument for template parameter of pointer type %0 must have its address taken
root: non-type template argument for template parameter of pointer type {$arg0} must have its address taken

# err_template_arg_not_convertible
source: non-type template argument of type %0 cannot be converted to a value of type %1
root: non-type template argument of type {$arg0} cannot be converted to a value of type {$arg1}

# err_template_arg_not_ice
source: non-type template argument of type %0 is not an integral constant expression
root: non-type template argument of type {$arg0} is not an integral constant expression

# err_template_arg_not_integral_or_enumeral
source: non-type template argument of type %0 must have an integral or enumeration type
root: non-type template argument of type {$arg0} must have an integral or enumeration type

# err_template_arg_object_no_linkage
source: non-type template argument refers to %select{function|object}0 %1 that does not have linkage
root: non-type template argument refers to {$arg0 :select s0=|function| s1=|object|} {$arg1} that does not have linkage

# err_template_arg_reference_var
source: non-type template argument of reference type %0 is not an object
root: non-type template argument of reference type {$arg0} is not an object

# err_template_arg_untyped_null_constant
source: null non-type template argument must be cast to template parameter type %0
root: null non-type template argument must be cast to template parameter type {$arg0}

# err_template_arg_wrongtype_null_constant
source: null non-type template argument of type %0 does not match template parameter of type %1
root: null non-type template argument of type {$arg0} does not match template parameter of type {$arg1}

# err_template_expansion_into_fixed_list
source: pack expansion used as argument for non-pack parameter of %select{alias template|concept}0
root: pack expansion used as argument for non-pack parameter of {$arg0 :select s0=|alias template| s1=|concept|}

# err_template_id_not_a_type
source: template name refers to non-type template %0
root: template name refers to non-type template {$arg0}

# err_template_instantiate_undefined
source: %select{implicit|explicit}0 instantiation of undefined template %1
root: {$arg0 :select s0=|implicit| s1=|explicit|} instantiation of undefined template {$arg1}

# err_template_instantiate_within_definition
source: %select{implicit|explicit}0 instantiation of template %1 within its own definition
root: {$arg0 :select s0=|implicit| s1=|explicit|} instantiation of template {$arg1} within its own definition

# err_template_kw_refers_to_dependent_non_template
source: %0%select{| following the 'template' keyword}1 cannot refer to a dependent template
root: {$arg0}{$arg1 :select s0=|| s1=| following the 'template' keyword|} cannot refer to a dependent template

# err_template_kw_refers_to_non_template
source: %0%select{| following the 'template' keyword}1 does not refer to a template
root: {$arg0}{$arg1 :select s0=|| s1=| following the 'template' keyword|} does not refer to a template

# err_template_member_noparams
source: extraneous 'template<>' in declaration of member %0
root: extraneous 'template<>' in declaration of member {$arg0}

# err_template_missing_args
source: use of %select{class template|function template|variable template|alias template|template template parameter|concept|template}0 %1 requires template arguments
root: use of {$arg0 :select s0=|class template| s1=|function template| s2=|variable template| s3=|alias template| s4=|template template parameter| s5=|concept| s6=|template|} {$arg1} requires template arguments

# err_template_nontype_parm_bad_structural_type
source: a non-type template parameter cannot have type %0 before C++20
root: a non-type template parameter cannot have type {$arg0} before C++20

# err_template_nontype_parm_bad_type
source: a non-type template parameter cannot have type %0
root: a non-type template parameter cannot have type {$arg0}

# err_template_nontype_parm_different_type
source: template non-type parameter has a different type %0 in template %select{|template parameter }1redeclaration
root: template non-type parameter has a different type {$arg0} in template {$arg1 :select s0=|| s1=|template parameter |}redeclaration

# err_template_nontype_parm_incomplete
source: non-type template parameter has incomplete type %0
root: non-type template parameter has incomplete type {$arg0}

# err_template_nontype_parm_not_literal
source: non-type template parameter has non-literal type %0
root: non-type template parameter has non-literal type {$arg0}

# err_template_nontype_parm_not_structural
source: type %0 of non-type template parameter is not a structural type
root: type {$arg0} of non-type template parameter is not a structural type

# err_template_nontype_parm_rvalue_ref
source: non-type template parameter has rvalue reference type %0
root: non-type template parameter has rvalue reference type {$arg0}

# err_template_param_different_kind
source: template parameter has a different kind in template %select{|template parameter }0redeclaration
root: template parameter has a different kind in template {$arg0 :select s0=|| s1=|template parameter |}redeclaration

# err_template_param_list_different_arity
source: %select{too few|too many}0 template parameters in template %select{|template parameter }1redeclaration
root: {$arg0 :select s0=|too few| s1=|too many|} template parameters in template {$arg1 :select s0=|| s1=|template parameter |}redeclaration

# err_template_param_list_matches_nontemplate
source: template parameter list matching the non-templated nested type %0 should be empty ('template<>')
root: template parameter list matching the non-templated nested type {$arg0} should be empty ('template<>')

# err_template_param_shadow
source: declaration of %0 shadows template parameter
root: declaration of {$arg0} shadows template parameter

# err_template_parameter_pack_non_pack
source: %select{template type|non-type template|template template}0 parameter%select{| pack}1 conflicts with previous %select{template type|non-type template|template template}0 parameter%select{ pack|}1
root: {$arg0 :select s0=|template type| s1=|non-type template| s2=|template template|} parameter{$arg1 :select s0=|| s1=| pack|} conflicts with previous {$arg0 :select s0=|template type| s1=|non-type template| s2=|template template|} parameter{$arg1 :select s0=| pack| s1=||}

# err_template_recursion_depth_exceeded
source: recursive template instantiation exceeded maximum depth of %0
root: recursive template instantiation exceeded maximum depth of {$arg0}

# err_template_spec_decl_function_scope
source: explicit specialization of %0 in function scope
root: explicit specialization of {$arg0} in function scope

# err_template_spec_default_arg
source: default argument not permitted on an explicit %select{instantiation|specialization}0 of function %1
root: default argument not permitted on an explicit {$arg0 :select s0=|instantiation| s1=|specialization|} of function {$arg1}

# err_template_spec_needs_template_parameters
source: template specialization or definition requires a template parameter list corresponding to the nested type %0
root: template specialization or definition requires a template parameter list corresponding to the nested type {$arg0}

# err_template_spec_redecl_global_scope
source: %select{class template|class template partial|variable template|variable template partial|function template|member function|static data member|member class|member enumeration}0 specialization of %1 must occur at global scope
root: {$arg0 :select s0=|class template| s1=|class template partial| s2=|variable template| s3=|variable template partial| s4=|function template| s5=|member function| s6=|static data member| s7=|member class| s8=|member enumeration|} specialization of {$arg1} must occur at global scope

# err_template_spec_redecl_out_of_scope
source: %select{class template|class template partial|variable template|variable template partial|function template|member function|static data member|member class|member enumeration}0 specialization of %1 not in %select{a namespace enclosing %2|class %2 or an enclosing namespace}3
root: {$arg0 :select s0=|class template| s1=|class template partial| s2=|variable template| s3=|variable template partial| s4=|function template| s5=|member function| s6=|static data member| s7=|member class| s8=|member enumeration|} specialization of {$arg1} not in {$arg3 :select s0=|a namespace enclosing {$arg2}| s1=|class {$arg2} or an enclosing namespace|}

# err_template_spec_unknown_kind
source: can only provide an explicit specialization for a class template, function template, variable template, or a member function, static data member, %select{or member class|member class, or member enumeration}0 of a class template
root: can only provide an explicit specialization for a class template, function template, variable template, or a member function, static data member, {$arg0 :select s0=|or member class| s1=|member class, or member enumeration|} of a class template

# err_template_tag_noparams
source: extraneous 'template<>' in declaration of %0 %1
root: extraneous 'template<>' in declaration of {$arg0} {$arg1}

# err_template_template_parameter_not_at_least_as_constrained
source: template template argument %0 is more constrained than template template parameter %1
root: template template argument {$arg0} is more constrained than template template parameter {$arg1}

# err_template_variable_noparams
source: extraneous 'template<>' in declaration of variable %0
root: extraneous 'template<>' in declaration of variable {$arg0}

# err_tentative_def_incomplete_type
source: tentative definition has type %0 that is never completed
root: tentative definition has type {$arg0} that is never completed

# err_this_capture
source: 'this' cannot be %select{implicitly |}0captured in this context
root: 'this' cannot be {$arg0 :select s0=|implicitly | s1=||}captured in this context

# err_this_static_member_func
source: 'this' cannot be%select{| implicitly}0 used in a static member function declaration
root: 'this' cannot be{$arg0 :select s0=|| s1=| implicitly|} used in a static member function declaration

# err_thread_non_global
source: '%0' variables must have global storage
root: '{$arg0}' variables must have global storage

# err_thread_non_thread
source: thread-local declaration of %0 follows non-thread-local declaration
root: thread-local declaration of {$arg0} follows non-thread-local declaration

# err_thread_thread_different_kind
source: thread-local declaration of %0 with %select{static|dynamic}1 initialization follows declaration with %select{dynamic|static}1 initialization
root: thread-local declaration of {$arg0} with {$arg1 :select s0=|static| s1=|dynamic|} initialization follows declaration with {$arg1 :select s0=|dynamic| s1=|static|} initialization

# err_throw_abstract_type
source: cannot throw an object of abstract type %0
root: cannot throw an object of abstract type {$arg0}

# err_throw_incomplete
source: cannot throw object of incomplete type %0
root: cannot throw object of incomplete type {$arg0}

# err_throw_incomplete_ptr
source: cannot throw pointer to object of incomplete type %0
root: cannot throw pointer to object of incomplete type {$arg0}

# err_throw_object_throwing_dtor
source: cannot throw object of type %0 with a potentially-throwing destructor
root: cannot throw object of type {$arg0} with a potentially-throwing destructor

# err_throw_sizeless
source: cannot throw object of sizeless type %0
root: cannot throw object of sizeless type {$arg0}

# err_tls_var_aligned_over_maximum
source: alignment (%0) of thread-local variable %1 is greater than the maximum supported alignment (%2) for a thread-local variable on this target
root: alignment ({$arg0}) of thread-local variable {$arg1} is greater than the maximum supported alignment ({$arg2}) for a thread-local variable on this target

# err_trailing_return_without_auto
source: function with trailing return type must specify return type 'auto', not %0
root: function with trailing return type must specify return type 'auto', not {$arg0}

# err_type_attribute_wrong_type
source: '%0' only applies to %select{function|pointer|Objective-C object or block pointer}1 types; type here is %2
root: '{$arg0}' only applies to {$arg1 :select s0=|function| s1=|pointer| s2=|Objective-C object or block pointer|} types; type here is {$arg2}

# err_type_available_only_in_default_eval_method
source: cannot use type '%0' within '#pragma clang fp eval_method'; type is set according to the default eval method for the translation unit
root: cannot use type '{$arg0}' within '#pragma clang fp eval_method'; type is set according to the default eval method for the translation unit

# err_type_aware_allocator_missing_matching_operator
source: declaration of type aware %0 in %1 must have matching type aware %2
root: declaration of type aware {$arg0} in {$arg1} must have matching type aware {$arg2}

# err_type_constraint_missing_arguments
source: %0 requires more than 1 template argument; provide the remaining arguments explicitly to use it here
root: {$arg0} requires more than 1 template argument; provide the remaining arguments explicitly to use it here

# err_type_defined_in_alias_template
source: %0 cannot be defined in a type alias template
root: {$arg0} cannot be defined in a type alias template

# err_type_defined_in_condition
source: %0 cannot be defined in a condition
root: {$arg0} cannot be defined in a condition

# err_type_defined_in_enum
source: %0 cannot be defined in an enumeration
root: {$arg0} cannot be defined in an enumeration

# err_type_defined_in_param_type
source: %0 cannot be defined in a parameter type
root: {$arg0} cannot be defined in a parameter type

# err_type_defined_in_result_type
source: %0 cannot be defined in the result type of a function
root: {$arg0} cannot be defined in the result type of a function

# err_type_defined_in_type_specifier
source: %0 cannot be defined in a type specifier
root: {$arg0} cannot be defined in a type specifier

# err_type_mismatch_continuation_class
source: type of property %0 in class extension does not match property type in primary class
root: type of property {$arg0} in class extension does not match property type in primary class

# err_type_tag_for_datatype_not_ice
source: 'type_tag_for_datatype' attribute requires the initializer to be an %select{integer|integral}0 constant expression
root: 'type_tag_for_datatype' attribute requires the initializer to be an {$arg0 :select s0=|integer| s1=|integral|} constant expression

# err_type_tag_for_datatype_too_large
source: 'type_tag_for_datatype' attribute requires the initializer to be an %select{integer|integral}0 constant expression that can be represented by a 64 bit integer
root: 'type_tag_for_datatype' attribute requires the initializer to be an {$arg0 :select s0=|integer| s1=|integral|} constant expression that can be represented by a 64 bit integer

# err_type_unsupported
source: %0 is not supported on this target
root: {$arg0} is not supported on this target

# err_typecheck_address_of
source: address of %select{bit-field|vector element|property expression|register variable|matrix element}0 requested
root: address of {$arg0 :select s0=|bit-field| s1=|vector element| s2=|property expression| s3=|register variable| s4=|matrix element|} requested

# err_typecheck_addrof_temporary
source: taking the address of a temporary object of type %0
root: taking the address of a temporary object of type {$arg0}

# err_typecheck_arithmetic_incomplete_or_sizeless_type
source: arithmetic on a pointer to %select{an incomplete|sizeless}0 type %1
root: arithmetic on a pointer to {$arg0 :select s0=|an incomplete| s1=|sizeless|} type {$arg1}

# err_typecheck_array_not_modifiable_lvalue
source: array type %0 is not assignable
root: array type {$arg0} is not assignable

# err_typecheck_assign_const
source: %select{cannot assign to return value because function %1 returns a const value|cannot assign to variable %1 with const-qualified type %2|cannot assign to %select{non-|}1static data member %2 with const-qualified type %3|cannot assign to non-static data member within const member function %1|cannot assign to %select{variable %2|non-static data member %2|lvalue}1 with %select{|nested }3const-qualified data member %4|read-only variable is not assignable}0
root: %select{cannot assign to return value because function {$arg1} returns a const value|cannot assign to variable {$arg1} with const-qualified type {$arg2}|cannot assign to {$arg1 :select s0=|non-| s1=||}static data member {$arg2} with const-qualified type {$arg3}|cannot assign to non-static data member within const member function {$arg1}|cannot assign to {$arg1 :select s0=|variable {$arg2}| s1=|non-static data member {$arg2}| s2=|lvalue|} with {$arg0 :select s0=|| s1=|nested }3const-qualified data member {$arg4}| s2=|read-only variable is not assignable|}

# err_typecheck_bool_condition
source: value of type %0 is not contextually convertible to 'bool'
root: value of type {$arg0} is not contextually convertible to 'bool'

# err_typecheck_call_invalid_unary_fp
source: floating point classification requires argument of floating point type (passed in %0)
root: floating point classification requires argument of floating point type (passed in {$arg0})

# err_typecheck_call_not_function
source: called object type %0 is not a function or function pointer
root: called object type {$arg0} is not a function or function pointer

# err_typecheck_call_requires_real_fp
source: argument type %0 is not a real floating point type
root: argument type {$arg0} is not a real floating point type

# err_typecheck_call_too_few_args
source: too few %select{|||execution configuration }0%select{|non-object }3arguments to %select{function|block|method|kernel function}0 call, expected %1, have %2
root: too few {$arg0 :select s0=|| s1=|| s2=|| s3=|execution configuration |}{$arg3 :select s0=|| s1=|non-object |}arguments to {$arg0 :select s0=|function| s1=|block| s2=|method| s3=|kernel function|} call, expected {$arg1}, have {$arg2}

# err_typecheck_call_too_few_args_at_least
source: too few %select{|||execution configuration }0%select{|non-object }3arguments to %select{function|block|method|kernel function}0 call, expected at least %1, have %2
root: too few {$arg0 :select s0=|| s1=|| s2=|| s3=|execution configuration |}{$arg3 :select s0=|| s1=|non-object |}arguments to {$arg0 :select s0=|function| s1=|block| s2=|method| s3=|kernel function|} call, expected at least {$arg1}, have {$arg2}

# err_typecheck_call_too_few_args_at_least_one
source: too few %select{|||execution configuration }0%select{|non-object }2arguments to %select{function|block|method|kernel function}0 call, at least argument %1 must be specified
root: too few {$arg0 :select s0=|| s1=|| s2=|| s3=|execution configuration |}{$arg2 :select s0=|| s1=|non-object |}arguments to {$arg0 :select s0=|function| s1=|block| s2=|method| s3=|kernel function|} call, at least argument {$arg1} must be specified
