Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# err_typecheck_call_too_few_args_at_least_suggest
source: too few %select{|||execution configuration }0%select{|non-object }3arguments to %select{function|block|method|kernel function}0 call, expected at least %1, have %2; did you mean %4?
root: too few {$arg0 :select s0=|| s1=|| s2=|| s3=|execution configuration |}{$arg3 :select s0=|| s1=|non-object |}arguments to {$arg0 :select s0=|function| s1=|block| s2=|method| s3=|kernel function|} call, expected at least {$arg1}, have {$arg2}; did you mean {$arg4}?

# err_typecheck_call_too_few_args_one
source: too few %select{|||execution configuration }0%select{|non-object }2arguments to %select{function|block|method|kernel function}0 call, single argument %1 was not specified
root: too few {$arg0 :select s0=|| s1=|| s2=|| s3=|execution configuration |}{$arg2 :select s0=|| s1=|non-object |}arguments to {$arg0 :select s0=|function| s1=|block| s2=|method| s3=|kernel function|} call, single argument {$arg1} was not specified

# err_typecheck_call_too_few_args_suggest
source: too few %select{|||execution configuration }0%select{|non-object }3arguments to %select{function|block|method|kernel function}0 call, expected %1, have %2; did you mean %4?
root: too few {$arg0 :select s0=|| s1=|| s2=|| s3=|execution configuration |}{$arg3 :select s0=|| s1=|non-object |}arguments to {$arg0 :select s0=|function| s1=|block| s2=|method| s3=|kernel function|} call, expected {$arg1}, have {$arg2}; did you mean {$arg4}?

# err_typecheck_call_too_many_args
source: too many %select{|||execution configuration }0%select{|non-object }3arguments to %select{function|block|method|kernel function}0 call, expected %1, have %2
root: too many {$arg0 :select s0=|| s1=|| s2=|| s3=|execution configuration |}{$arg3 :select s0=|| s1=|non-object |}arguments to {$arg0 :select s0=|function| s1=|block| s2=|method| s3=|kernel function|} call, expected {$arg1}, have {$arg2}

# err_typecheck_call_too_many_args_at_most
source: too many %select{|||execution configuration }0%select{|non-object }3arguments to %select{function|block|method|kernel function}0 call, expected at most %1, have %2
root: too many {$arg0 :select s0=|| s1=|| s2=|| s3=|execution configuration |}{$arg3 :select s0=|| s1=|non-object |}arguments to {$arg0 :select s0=|function| s1=|block| s2=|method| s3=|kernel function|} call, expected at most {$arg1}, have {$arg2}

# err_typecheck_call_too_many_args_at_most_one
source: too many %select{|||execution configuration }0arguments to %select{function|block|method|kernel function}0 call, expected at most single %select{|non-object }3argument %1, have %2%select{|non-object}3 arguments
root: too many {$arg0 :select s0=|| s1=|| s2=|| s3=|execution configuration |}arguments to {$arg0 :select s0=|function| s1=|block| s2=|method| s3=|kernel function|} call, expected at most single {$arg3 :select s0=|| s1=|non-object |}argument {$arg1}, have {$arg2}{$arg3 :select s0=|| s1=|non-object|} arguments

# err_typecheck_call_too_many_args_at_most_suggest
source: too many %select{|||execution configuration }0%select{|non-object }3arguments to %select{function|block|method|kernel function}0 call, expected at most %1, have %2; did you mean %4?
root: too many {$arg0 :select s0=|| s1=|| s2=|| s3=|execution configuration |}{$arg3 :select s0=|| s1=|non-object |}arguments to {$arg0 :select s0=|function| s1=|block| s2=|method| s3=|kernel function|} call, expected at most {$arg1}, have {$arg2}; did you mean {$arg4}?

# err_typecheck_call_too_many_args_one
source: too many %select{|||execution configuration }0%select{|non-object }3arguments to %select{function|block|method|kernel function}0 call, expected single argument %1, have %2 arguments
root: too many {$arg0 :select s0=|| s1=|| s2=|| s3=|execution configuration |}{$arg3 :select s0=|| s1=|non-object |}arguments to {$arg0 :select s0=|function| s1=|block| s2=|method| s3=|kernel function|} call, expected single argument {$arg1}, have {$arg2} arguments

# err_typecheck_call_too_many_args_suggest
source: too many %select{|||execution configuration }0%select{|non-object }3arguments to %select{function|block|method|kernel function}0 call, expected %1, have %2; did you mean %4?
root: too many {$arg0 :select s0=|| s1=|| s2=|| s3=|execution configuration |}{$arg3 :select s0=|| s1=|non-object |}arguments to {$arg0 :select s0=|function| s1=|block| s2=|method| s3=|kernel function|} call, expected {$arg1}, have {$arg2}; did you mean {$arg4}?

# err_typecheck_cast_to_incomplete
source: cast to incomplete type %0
root: cast to incomplete type {$arg0}

# err_typecheck_cast_to_union_no_type
source: cast to union type from type %0 not present in union
root: cast to union type from type {$arg0} not present in union

# err_typecheck_comparison_of_fptr_to_void
source: equality comparison between function pointer and void pointer (%0 and %1)
root: equality comparison between function pointer and void pointer ({$arg0} and {$arg1})

# err_typecheck_comparison_of_pointer_integer
source: comparison between pointer and integer (%0 and %1)
root: comparison between pointer and integer ({$arg0} and {$arg1})

# err_typecheck_cond_expect_int_float
source: used type %0 where integer or floating point type is required
root: used type {$arg0} where integer or floating point type is required

# err_typecheck_cond_expect_nonfloat
source: used type %0 where floating point type is not allowed
root: used type {$arg0} where floating point type is not allowed

# err_typecheck_cond_expect_scalar
source: used type %0 where arithmetic or pointer type is required
root: used type {$arg0} where arithmetic or pointer type is required

# err_typecheck_cond_incompatible_operands_null
source: non-pointer operand type %0 incompatible with %select{NULL|nullptr}1
root: non-pointer operand type {$arg0} incompatible with {$arg1 :select s0=|NULL| s1=|nullptr|}

# err_typecheck_convert_incompatible
source: %select{%diff{assigning to $ from incompatible type $|assigning to type from incompatible type}0,1|%diff{passing $ to parameter of incompatible type $|passing type to parameter of incompatible type}0,1|%diff{returning $ from a function with incompatible result type $|returning type from a function with incompatible result type}0,1|%diff{converting $ to incompatible type $|converting type to incompatible type}0,1|%diff{initializing $ with an expression of incompatible type $|initializing type with an expression of incompatible type}0,1|%diff{sending $ to parameter of incompatible type $|sending type to parameter of incompatible type}0,1|%diff{casting $ to incompatible type $|casting type to incompatible type}0,1}2%select{|; dereference with *|; take the address with &|; remove *|; remove &}3%select{|: different classes%diff{ ($ vs $)|}5,6|: different number of parameters (%5 vs %6)|: type mismatch at %ordinal5 parameter%diff{ ($ vs $)|}6,7|: different return type%diff{ ($ vs $)|}5,6|: different qualifiers (%5 vs %6)|: different exception specifications}4
root: %select{%diff{assigning to $ from incompatible type $|assigning to type from incompatible type}0,1|%diff{passing $ to parameter of incompatible type $|passing type to parameter of incompatible type}0,1|%diff{returning $ from a function with incompatible result type $|returning type from a function with incompatible result type}0,1|%diff{converting $ to incompatible type $|converting type to incompatible type}0,1|%diff{initializing $ with an expression of incompatible type $|initializing type with an expression of incompatible type}0,1|%diff{sending $ to parameter of incompatible type $|sending type to parameter of incompatible type}0,1|%diff{casting $ to incompatible type $|casting type to incompatible type}0,1}2{$arg3 :select s0=|| s1=|; dereference with *| s2=|; take the address with &| s3=|; remove *| s4=|; remove &|}%select{|: different classes%diff{ ($ vs $)|}5,6|: different number of parameters ({$arg5} vs {$arg6})|: type mismatch at %ordinal5 parameter%diff{ ($ vs $)|}6,7|: different return type%diff{ ($ vs $)|}5,6|: different qualifiers ({$arg5} vs {$arg6})|: different exception specifications}4

# err_typecheck_convert_incompatible_function_pointer
source: incompatible function pointer types %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2%select{|; dereference with *|; take the address with &|; remove *|; remove &}3
root: incompatible function pointer types %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2{$arg3 :select s0=|| s1=|; dereference with *| s2=|; take the address with &| s3=|; remove *| s4=|; remove &|}

# err_typecheck_convert_incompatible_pointer
source: incompatible pointer types %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2%select{|; dereference with *|; take the address with &|; remove *|; remove &}3
root: incompatible pointer types %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2{$arg3 :select s0=|| s1=|; dereference with *| s2=|; take the address with &| s3=|; remove *| s4=|; remove &|}

# err_typecheck_convert_incompatible_pointer_sign
source: %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2 converts between pointers to integer types %select{with different sign|where one is of the unique plain 'char' type and the other is not}3
root: %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2 converts between pointers to integer types {$arg3 :select s0=|with different sign| s1=|where one is of the unique plain 'char' type and the other is not|}

# err_typecheck_convert_int_pointer
source: incompatible integer to pointer conversion %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2%select{|; dereference with *|; take the address with &|; remove *|; remove &}3
root: incompatible integer to pointer conversion %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2{$arg3 :select s0=|| s1=|; dereference with *| s2=|; take the address with &| s3=|; remove *| s4=|; remove &|}

# err_typecheck_convert_pointer_int
source: incompatible pointer to integer conversion %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2%select{|; dereference with *|; take the address with &|; remove *|; remove &}3
root: incompatible pointer to integer conversion %select{%diff{assigning to $ from $|assigning to different types}0,1|%diff{passing $ to parameter of type $|passing to parameter of different type}0,1|%diff{returning $ from a function with result type $|returning from function with different return type}0,1|%diff{converting $ to type $|converting between types}0,1|%diff{initializing $ with an expression of type $|initializing with expression of different type}0,1|%diff{sending $ to parameter of type $|sending to parameter of different type}0,1|%diff{casting $ to type $|casting between types}0,1}2{$arg3 :select s0=|| s1=|; dereference with *| s2=|; take the address with &| s3=|; remove *| s4=|; remove &|}

# err_typecheck_converted_constant_expression
source: value of type %0 is not implicitly convertible to %1
root: value of type {$arg0} is not implicitly convertible to {$arg1}

# err_typecheck_converted_constant_expression_disallowed
source: conversion from %0 to %1 is not allowed in a converted constant expression
root: conversion from {$arg0} to {$arg1} is not allowed in a converted constant expression

# err_typecheck_converted_constant_expression_indirect
source: conversion from %0 to %1 in converted constant expression would bind reference to a temporary
root: conversion from {$arg0} to {$arg1} in converted constant expression would bind reference to a temporary

# err_typecheck_decl_incomplete_type
source: variable has incomplete type %0
root: variable has incomplete type {$arg0}

# err_typecheck_deleted_function
source: conversion function %diff{from $ to $|between types}0,1 invokes a deleted function%select{|: %3}2
root: conversion function %diff{from $ to $|between types}0,1 invokes a deleted function{$arg2 :select s0=|| s1=|: {$arg3}|}

# err_typecheck_expect_any_scalar_or_vector
source: invalid operand of type %0%select{| where a scalar or vector is required}1
root: invalid operand of type {$arg0}{$arg1 :select s0=|| s1=| where a scalar or vector is required|}

# err_typecheck_expect_flt_or_vector
source: invalid operand of type %0 where floating, complex or a vector of such types is required
root: invalid operand of type {$arg0} where floating, complex or a vector of such types is required

# err_typecheck_expect_hlsl_resource
source: used type %0 where __hlsl_resource_t is required
root: used type {$arg0} where __hlsl_resource_t is required

# err_typecheck_expect_int
source: used type %0 where integer is required
root: used type {$arg0} where integer is required

# err_typecheck_expect_scalar_operand
source: operand of type %0 where arithmetic or pointer type is required
root: operand of type {$arg0} where arithmetic or pointer type is required

# err_typecheck_expect_scalar_or_vector
source: invalid operand of type %0 where %1 or a vector of such type is required
root: invalid operand of type {$arg0} where {$arg1} or a vector of such type is required

# err_typecheck_illegal_increment_decrement
source: cannot %select{decrement|increment}1 value of type %0
root: cannot {$arg1 :select s0=|decrement| s1=|increment|} value of type {$arg0}

# err_typecheck_incomplete_tag
source: incomplete definition of type %0
root: incomplete definition of type {$arg0}

# err_typecheck_incomplete_type_not_modifiable_lvalue
source: incomplete type %0 is not assignable
root: incomplete type {$arg0} is not assignable

# err_typecheck_indirection_requires_pointer
source: indirection requires pointer operand (%0 invalid)
root: indirection requires pointer operand ({$arg0} invalid)

# err_typecheck_indirection_through_void_pointer_cpp
source: indirection not permitted on operand of type %0
root: indirection not permitted on operand of type {$arg0}

# err_typecheck_invalid_lvalue_addrof
source: cannot take the address of an rvalue of type %0
root: cannot take the address of an rvalue of type {$arg0}

# err_typecheck_invalid_operands
source: invalid operands to binary expression (%0 and %1)
root: invalid operands to binary expression ({$arg0} and {$arg1})

# err_typecheck_invalid_restrict_invalid_pointee
source: pointer to function type %0 may not be 'restrict' qualified
root: pointer to function type {$arg0} may not be 'restrict' qualified

# err_typecheck_invalid_restrict_not_pointer
source: restrict requires a pointer or reference (%0 is invalid)
root: restrict requires a pointer or reference ({$arg0} is invalid)

# err_typecheck_logical_vector_expr_gnu_cpp_restrict
source: logical expression with vector %select{type %1 and non-vector type %2|types %1 and %2}0 is only supported in C++
root: logical expression with vector {$arg0 :select s0=|type {$arg1} and non-vector type {$arg2}| s1=|types {$arg1} and {$arg2}|} is only supported in C++

# err_typecheck_member_reference_arrow
source: member reference type %0 is not a pointer
root: member reference type {$arg0} is not a pointer

# err_typecheck_member_reference_ivar
source: %0 does not have a member named %1
root: {$arg0} does not have a member named {$arg1}

# err_typecheck_member_reference_ivar_suggest
source: %0 does not have a member named %1; did you mean %2?
root: {$arg0} does not have a member named {$arg1}; did you mean {$arg2}?

# err_typecheck_member_reference_struct_union
source: member reference base type %0 is not a structure or union
root: member reference base type {$arg0} is not a structure or union

# err_typecheck_member_reference_suggestion
source: member reference type %0 is %select{a|not a}1 pointer; did you mean to use '%select{->|.}1'?
root: member reference type {$arg0} is {$arg1 :select s0=|a| s1=|not a|} pointer; did you mean to use '{$arg1 :select s0=|->| s1=|.|}'?

# err_typecheck_member_reference_type
source: cannot refer to type member %0 in %1 with '%select{.|->}2'
root: cannot refer to type member {$arg0} in {$arg1} with '{$arg2 :select s0=|.| s1=|->|}'

# err_typecheck_member_reference_unknown
source: cannot refer to member %0 in %1 with '%select{.|->}2'
root: cannot refer to member {$arg0} in {$arg1} with '{$arg2 :select s0=|.| s1=|->|}'

# err_typecheck_missing_return_type_incompatible
source: %diff{return type $ must match previous return type $|return type must match previous return type}0,1 when %select{block literal|lambda expression}2 has unspecified explicit return type
root: %diff{return type $ must match previous return type $|return type must match previous return type}0,1 when {$arg2 :select s0=|block literal| s1=|lambda expression|} has unspecified explicit return type

# err_typecheck_non_object_not_modifiable_lvalue
source: non-object type %0 is not assignable
root: non-object type {$arg0} is not assignable

# err_typecheck_ordered_comparison_of_function_pointers
source: ordered comparison of function pointers (%0 and %1)
root: ordered comparison of function pointers ({$arg0} and {$arg1})

# err_typecheck_ordered_comparison_of_pointer_and_zero
source: ordered comparison between pointer and zero (%0 and %1)
root: ordered comparison between pointer and zero ({$arg0} and {$arg1})

# err_typecheck_pointer_arith_function_type
source: arithmetic on%select{ a|}0 pointer%select{|s}0 to%select{ the|}2 function type%select{|s}2 %1%select{| and %3}2
root: arithmetic on{$arg0 :select s0=| a| s1=||} pointer{$arg0 :select s0=|| s1=|s|} to{$arg2 :select s0=| the| s1=||} function type{$arg2 :select s0=|| s1=|s|} {$arg1}{$arg2 :select s0=|| s1=| and {$arg3}|}

# err_typecheck_pointer_arith_void_type
source: arithmetic on%select{ a|}0 pointer%select{|s}0 to void
root: arithmetic on{$arg0 :select s0=| a| s1=||} pointer{$arg0 :select s0=|| s1=|s|} to void

# err_typecheck_statement_requires_integer
source: statement requires expression of integer type (%0 invalid)
root: statement requires expression of integer type ({$arg0} invalid)

# err_typecheck_statement_requires_scalar
source: statement requires expression of scalar type (%0 invalid)
root: statement requires expression of scalar type ({$arg0} invalid)

# err_typecheck_sve_rvv_ambiguous
source: cannot combine fixed-length and sizeless %select{SVE|RVV}0 vectors in expression, result is ambiguous (%1 and %2)
root: cannot combine fixed-length and sizeless {$arg0 :select s0=|SVE| s1=|RVV|} vectors in expression, result is ambiguous ({$arg1} and {$arg2})

# err_typecheck_sve_rvv_gnu_ambiguous
source: cannot combine GNU and %select{SVE|RVV}0 vectors in expression, result is ambiguous (%1 and %2)
root: cannot combine GNU and {$arg0 :select s0=|SVE| s1=|RVV|} vectors in expression, result is ambiguous ({$arg1} and {$arg2})

# err_typecheck_unary_expr
source: invalid argument type %0 to unary expression
root: invalid argument type {$arg0} to unary expression

# err_typecheck_vector_lengths_not_equal
source: vector operands do not have the same number of elements (%0 and %1)
root: vector operands do not have the same number of elements ({$arg0} and {$arg1})

# err_typecheck_vector_not_convertable
source: cannot convert between vector values of different size (%0 and %1)
root: cannot convert between vector values of different size ({$arg0} and {$arg1})
