Repository: paperchalice/llvm-i18n
Catalog: xliff/*/US/DiagnosticSemaKinds.xlf
Languages: root

# note_deduction_guide_template_access
source: member template declared %0 here
root: member template declared {$arg0} here

# note_default_arg_instantiation_here
source: in instantiation of default argument for '%0' required here
root: in instantiation of default argument for '{$arg0}' required here

# note_default_constructed_field
source: default constructed field %0 declared here
root: default constructed field {$arg0} declared here

# note_default_function_arg_instantiation_here
source: in instantiation of default function argument expression for '%0' required here
root: in instantiation of default function argument expression for '{$arg0}' required here

# note_default_init_const_member
source: member %0 declared 'const' here
root: member {$arg0} declared 'const' here

# note_defaulted_comparison_ambiguous
source: defaulted %0 is implicitly deleted because implied %select{|'==' |'<' }1comparison %select{|for member %3 |for base class %3 }2is ambiguous
root: defaulted {$arg0} is implicitly deleted because implied {$arg1 :select s0=|| s1=|'==' | s2=|'<' |}comparison {$arg2 :select s0=|| s1=|for member {$arg3} | s2=|for base class {$arg3} |}is ambiguous

# note_defaulted_comparison_calls_deleted
source: defaulted %0 is implicitly deleted because it would invoke a deleted comparison function%select{| for member %2| for base class %2}1
root: defaulted {$arg0} is implicitly deleted because it would invoke a deleted comparison function{$arg1 :select s0=|| s1=| for member {$arg2}| s2=| for base class {$arg2}|}

# note_defaulted_comparison_cannot_deduce
source: return type of defaulted 'operator<=>' cannot be deduced because return type %2 of three-way comparison for %select{|member|base class}0 %1 is not a standard comparison category type
root: return type of defaulted 'operator<=>' cannot be deduced because return type {$arg2} of three-way comparison for {$arg0 :select s0=|| s1=|member| s2=|base class|} {$arg1} is not a standard comparison category type

# note_defaulted_comparison_cannot_deduce_callee
source: selected 'operator<=>' for %select{|member|base class}0 %1 declared here
root: selected 'operator<=>' for {$arg0 :select s0=|| s1=|member| s2=|base class|} {$arg1} declared here

# note_defaulted_comparison_cannot_deduce_undeduced_auto
source: %select{|member|base class}0 %1 declared here
root: {$arg0 :select s0=|| s1=|member| s2=|base class|} {$arg1} declared here

# note_defaulted_comparison_inaccessible
source: defaulted %0 is implicitly deleted because it would invoke a %select{private|protected}3 %4%select{ member of %6| member of %6 to compare member %2| to compare base class %2}1
root: defaulted {$arg0} is implicitly deleted because it would invoke a {$arg3 :select s0=|private| s1=|protected|} {$arg4}{$arg1 :select s0=| member of {$arg6}| s1=| member of {$arg6} to compare member {$arg2}| s2=| to compare base class {$arg2}|}

# note_defaulted_comparison_no_viable_function
source: defaulted %0 is implicitly deleted because there is no viable %select{three-way comparison function|'operator=='}1 for %select{|member |base class }2%3
root: defaulted {$arg0} is implicitly deleted because there is no viable {$arg1 :select s0=|three-way comparison function| s1=|'operator=='|} for {$arg2 :select s0=|| s1=|member | s2=|base class |}{$arg3}

# note_defaulted_comparison_no_viable_function_synthesized
source: three-way comparison cannot be synthesized because there is no viable function for %select{'=='|'<'}0 comparison
root: three-way comparison cannot be synthesized because there is no viable function for {$arg0 :select s0=|'=='| s1=|'<'|} comparison

# note_defaulted_comparison_not_constexpr
source: non-constexpr comparison function would be used to compare %select{|member %1|base class %1}0
root: non-constexpr comparison function would be used to compare {$arg0 :select s0=|| s1=|member {$arg1}| s2=|base class {$arg1}|}

# note_defaulted_comparison_not_rewritten_callee
source: defaulted %0 is implicitly deleted because this non-rewritten comparison function would be the best match for the comparison
root: defaulted {$arg0} is implicitly deleted because this non-rewritten comparison function would be the best match for the comparison

# note_defaulted_comparison_not_rewritten_conversion
source: defaulted %0 is implicitly deleted because a builtin comparison function using this conversion would be the best match for the comparison
root: defaulted {$arg0} is implicitly deleted because a builtin comparison function using this conversion would be the best match for the comparison

# note_defaulted_comparison_reference_member
source: defaulted %0 is implicitly deleted because class %1 has a reference member
root: defaulted {$arg0} is implicitly deleted because class {$arg1} has a reference member

# note_defaulted_comparison_union
source: defaulted %0 is implicitly deleted because %2 is a %select{union-like class|union}1 with variant members
root: defaulted {$arg0} is implicitly deleted because {$arg2} is a {$arg1 :select s0=|union-like class| s1=|union|} with variant members

# note_defaulted_comparison_vector_types
source: defaulted %0 is implicitly deleted because defaulted comparison of vector types is not supported
root: defaulted {$arg0} is implicitly deleted because defaulted comparison of vector types is not supported

# note_defined_here
source: %0 defined here
root: {$arg0} defined here

# note_delete_conversion
source: conversion to pointer type %0
root: conversion to pointer type {$arg0}

# note_deleted_assign_field
source: %select{copy|move}0 assignment operator of %1 is implicitly deleted because field %2 is of %select{reference|const-qualified}4 type %3
root: {$arg0 :select s0=|copy| s1=|move|} assignment operator of {$arg1} is implicitly deleted because field {$arg2} is of {$arg4 :select s0=|reference| s1=|const-qualified|} type {$arg3}

# note_deleted_copy_ctor_rvalue_reference
source: copy constructor of %0 is implicitly deleted because field %1 is of rvalue reference type %2
root: copy constructor of {$arg0} is implicitly deleted because field {$arg1} is of rvalue reference type {$arg2}

# note_deleted_copy_user_declared_move
source: copy %select{constructor|assignment operator}0 is implicitly deleted because %1 has a user-declared move %select{constructor|assignment operator}2
root: copy {$arg0 :select s0=|constructor| s1=|assignment operator|} is implicitly deleted because {$arg1} has a user-declared move {$arg2 :select s0=|constructor| s1=|assignment operator|}

# note_deleted_default_ctor_all_const
source: %select{default constructor of|constructor inherited by}0 %1 is implicitly deleted because all %select{data members|data members of an anonymous union member}2 are const-qualified
root: {$arg0 :select s0=|default constructor of| s1=|constructor inherited by|} {$arg1} is implicitly deleted because all {$arg2 :select s0=|data members| s1=|data members of an anonymous union member|} are const-qualified

# note_deleted_default_ctor_uninit_field
source: %select{default constructor of|constructor inherited by}0 %1 is implicitly deleted because field %2 of %select{reference|const-qualified}4 type %3 would not be initialized
root: {$arg0 :select s0=|default constructor of| s1=|constructor inherited by|} {$arg1} is implicitly deleted because field {$arg2} of {$arg4 :select s0=|reference| s1=|const-qualified|} type {$arg3} would not be initialized

# note_deleted_type_mismatch
source: function is implicitly deleted because its declared type does not match the type of an implicit %select{default constructor|copy constructor|move constructor|copy assignment operator|move assignment operator|destructor}0
root: function is implicitly deleted because its declared type does not match the type of an implicit {$arg0 :select s0=|default constructor| s1=|copy constructor| s2=|move constructor| s3=|copy assignment operator| s4=|move assignment operator| s5=|destructor|}

# note_dependent_function_template_spec_discard_reason
source: candidate ignored: %select{not a function template|not a member of the enclosing %select{class template|namespace; did you mean to explicitly qualify the specialization?}1}0
root: candidate ignored: %select{not a function template|not a member of the enclosing {$arg0 :select s0=|class template| s1=|namespace; did you mean to explicitly qualify the specialization?}1|}

# note_destructor_type_here
source: type %0 found by destructor name lookup
root: type {$arg0} found by destructor name lookup

# note_direct_method_declared_at
source: direct method %0 declared here
root: direct method {$arg0} declared here

# note_due_to_dllexported_class
source: due to %0 being dllexported%select{|; try compiling in C++11 mode}1
root: due to {$arg0} being dllexported{$arg1 :select s0=|| s1=|; try compiling in C++11 mode|}

# note_duplicate_asm_operand_name
source: asm operand name "%0" first referenced here
root: asm operand name "{$arg0}" first referenced here

# note_duplicate_element
source: element %0 also has value %1
root: element {$arg0} also has value {$arg1}

# note_empty_parens_function_call
source: change this ',' to a ';' to call %0
root: change this ',' to a ';' to call {$arg0}

# note_entity_declared_at
source: %0 declared here
root: {$arg0} declared here

# note_enum_friend
source: remove 'enum%select{| struct| class}0' to befriend an enum
root: remove 'enum{$arg0 :select s0=|| s1=| struct| s2=| class|}' to befriend an enum

# note_enum_specialized_here
source: enum %0 was explicitly specialized here
root: enum {$arg0} was explicitly specialized here

# note_equivalent_internal_linkage_decl
source: declared here%select{ in module '%1'|}0
root: declared here{$arg0 :select s0=| in module '{$arg1}'| s1=||}

# note_evaluating_exception_spec_here
source: in evaluation of exception specification for %q0 needed here
root: in evaluation of exception specification for {$arg0 :q} needed here

# note_explicit_ctor_deduction_guide_here
source: explicit %select{constructor|deduction guide}0 declared here
root: explicit {$arg0 :select s0=|constructor| s1=|deduction guide|} declared here

# note_explicit_instantiation_candidate
source: explicit instantiation candidate function %q0 template here %1
root: explicit instantiation candidate function {$arg0 :q} template here {$arg1}

# note_explicit_template_arg_substitution_here
source: while substituting explicitly-specified template arguments into function template %0 %1
root: while substituting explicitly-specified template arguments into function template {$arg0} {$arg1}

# note_explicit_template_spec_does_not_need_header
source: 'template<>' header not required for explicitly-specialized class %0 declared here
root: 'template<>' header not required for explicitly-specialized class {$arg0} declared here

# note_expr_evaluates_to
source: expression evaluates to '%0 %1 %2'
root: expression evaluates to '{$arg0} {$arg1} {$arg2}'

# note_expr_requirement_constraints_not_satisfied_simple
source: %select{and|because}0 %1 does not satisfy %2:
root: {$arg0 :select s0=|and| s1=|because|} {$arg1} does not satisfy {$arg2}:

# note_expr_requirement_expr_substitution_error
source: %select{and|because}0 '%1' would be invalid: %2
root: {$arg0 :select s0=|and| s1=|because|} '{$arg1}' would be invalid: {$arg2}

# note_expr_requirement_expr_unknown_substitution_error
source: %select{and|because}0 '%1' would be invalid
root: {$arg0 :select s0=|and| s1=|because|} '{$arg1}' would be invalid

# note_expr_requirement_type_requirement_substitution_error
source: %select{and|because}0 '%1' would be invalid: %2
root: {$arg0 :select s0=|and| s1=|because|} '{$arg1}' would be invalid: {$arg2}

# note_expr_requirement_type_requirement_unknown_substitution_error
source: %select{and|because}0 '%1' would be invalid
root: {$arg0 :select s0=|and| s1=|because|} '{$arg1}' would be invalid

# note_extern_c_global_conflict
source: declared %select{in global scope|with C language linkage}0 here
root: declared {$arg0 :select s0=|in global scope| s1=|with C language linkage|} here

# note_final_dtor_non_final_class_silence
source: mark %0 as '%select{final|sealed}1' to silence this warning
root: mark {$arg0} as '{$arg1 :select s0=|final| s1=|sealed|}' to silence this warning

# note_final_overrider
source: final overrider of %q0 in %1
root: final overrider of {$arg0 :q} in {$arg1}

# note_flexible_array_counted_by_attr_field
source: field %0 declared here
root: field {$arg0} declared here

# note_flexible_array_member
source: initialized flexible array member %0 is here
root: initialized flexible array member {$arg0} is here

# note_for_range_begin_end
source: selected '%select{begin|end}0' %select{function|template }1%2 with iterator type %3
root: selected '{$arg0 :select s0=|begin| s1=|end|}' {$arg1 :select s0=|function| s1=|template |}{$arg2} with iterator type {$arg3}

# note_for_range_invalid_iterator
source: in implicit call to 'operator%select{!=|*|++}0' for iterator of type %1
root: in implicit call to 'operator{$arg0 :select s0=|!=| s1=|*| s2=|++|}' for iterator of type {$arg1}

# note_for_range_member_begin_end_ignored
source: member is not a candidate because range type %0 has no '%select{end|begin}1' member
root: member is not a candidate because range type {$arg0} has no '{$arg1 :select s0=|end| s1=|begin|}' member

# note_format_cmp_with
source: comparing with this %select{specifier|format string}0
root: comparing with this {$arg0 :select s0=|specifier| s1=|format string|}

# note_format_fix_specifier
source: did you mean to use '%0'?
root: did you mean to use '{$arg0}'?

# note_forward_class_conversion
source: %0 is not defined, but forward declared here; conversion would be valid if it was derived from %1
root: {$arg0} is not defined, but forward declared here; conversion would be valid if it was derived from {$arg1}

# note_found_mutex_near_match
source: found near match '%0'
root: found near match '{$arg0}'

# note_from_diagnose_if
source: from 'diagnose_if' attribute on %0:
root: from 'diagnose_if' attribute on {$arg0}:

# note_func_effect_call_disallows_inference
source: %select{function|constructor|destructor|lambda|block}0 does not permit inference of '%1' because it is declared '%2'
root: {$arg0 :select s0=|function| s1=|constructor| s2=|destructor| s3=|lambda| s4=|block|} does not permit inference of '{$arg1}' because it is declared '{$arg2}'

# note_func_effect_call_extern
source: declaration cannot be inferred '%0' because it has no definition in this translation unit
root: declaration cannot be inferred '{$arg0}' because it has no definition in this translation unit

# note_func_effect_call_indirect
source: %select{virtual method|function pointer}0 cannot be inferred '%1'
root: {$arg0 :select s0=|virtual method| s1=|function pointer|} cannot be inferred '{$arg1}'

# note_func_effect_calls_func_without_effect
source: %select{function|constructor|destructor|lambda|block|member initializer}0 cannot be inferred '%1' because it calls non-'%1' %select{function|constructor|destructor|lambda|block}2 '%3'
root: {$arg0 :select s0=|function| s1=|constructor| s2=|destructor| s3=|lambda| s4=|block| s5=|member initializer|} cannot be inferred '{$arg1}' because it calls non-'{$arg1}' {$arg2 :select s0=|function| s1=|constructor| s2=|destructor| s3=|lambda| s4=|block|} '{$arg3}'

# note_func_effect_in_constructor
source: in%select{| implicit}0 constructor here
root: in{$arg0 :select s0=|| s1=| implicit|} constructor here

# note_func_effect_violation
source: %select{function|constructor|destructor|lambda|block|member initializer}0 cannot be inferred '%1' because it %select{allocates or deallocates memory|throws or catches exceptions|has a static local variable|uses a thread-local variable|accesses an ObjC method or property}2
root: {$arg0 :select s0=|function| s1=|constructor| s2=|destructor| s3=|lambda| s4=|block| s5=|member initializer|} cannot be inferred '{$arg1}' because it {$arg2 :select s0=|allocates or deallocates memory| s1=|throws or catches exceptions| s2=|has a static local variable| s3=|uses a thread-local variable| s4=|accesses an ObjC method or property|}

# note_function_member_spec_matched
source: member function specialization matches %0
root: member function specialization matches {$arg0}

# note_function_suggestion
source: did you mean %0?
root: did you mean {$arg0}?

# note_function_template_deduction_instantiation_here
source: while substituting deduced template arguments into function template %0 %1
root: while substituting deduced template arguments into function template {$arg0} {$arg1}

# note_function_template_spec_here
source: in instantiation of function template specialization %q0 requested here
root: in instantiation of function template specialization {$arg0 :q} requested here

# note_function_template_spec_matched
source: function template %q0 matches specialization %1
root: function template {$arg0 :q} matches specialization {$arg1}

# note_getter_unavailable
source: or because setter is declared here, but no getter method %0 is found
root: or because setter is declared here, but no getter method {$arg0} is found

# note_goto_ms_asm_label
source: inline assembly label %0 declared here
root: inline assembly label {$arg0} declared here

# note_hidden_overloaded_virtual_declared_here
source: hidden overloaded virtual function %q0 declared here%select{|: different classes%diff{ ($ vs $)|}2,3|: different number of parameters (%2 vs %3)|: type mismatch at %ordinal2 parameter%diff{ ($ vs $)|}3,4|: different return type%diff{ ($ vs $)|}2,3|: different qualifiers (%2 vs %3)|: different exception specifications}1
root: hidden overloaded virtual function {$arg0 :q} declared here%select{|: different classes%diff{ ($ vs $)|}2,3|: different number of parameters ({$arg2} vs {$arg3})|: type mismatch at %ordinal2 parameter%diff{ ($ vs $)|}3,4|: different return type%diff{ ($ vs $)|}2,3|: different qualifiers ({$arg2} vs {$arg3})|: different exception specifications}1

# note_ice_conversion_here
source: conversion to %select{integral|enumeration}0 type %1 declared here
root: conversion to {$arg0 :select s0=|integral| s1=|enumeration|} type {$arg1} declared here

# note_illegal_field_declared_here
source: field of illegal %select{type|pointer type}0 %1 declared here
root: field of illegal {$arg0 :select s0=|type| s1=|pointer type|} {$arg1} declared here

# note_immediate_function_reason
source: %0 is an immediate %select{function|constructor}5 because %select{its body|the%select{| default}7 initializer of %8}6 %select{evaluates the address of %select{an immediate|a consteval}2 function %1|contains a call to %select{an immediate|a consteval}2 %select{function|constructor}4 %1 and that call is not a constant expression}3
root: {$arg0} is an immediate {$arg5 :select s0=|function| s1=|constructor|} because %select{its body|the{$arg6 :select s0=|| s1=| default}7 initializer of {$arg8}|} %select{evaluates the address of {$arg2 :select s0=|an immediate| s1=|a consteval|} function {$arg1}|contains a call to {$arg2 :select s0=|an immediate| s1=|a consteval|} {$arg3 :select s0=|function| s1=|constructor}4 {$arg1} and that call is not a constant expression|}

# note_implemented_by_class
source: when implemented by class %0
root: when implemented by class {$arg0}

# note_implicit_deduction_guide
source: implicit deduction guide declared as '%0'
root: implicit deduction guide declared as '{$arg0}'

# note_implicit_member_target_infer_collision
source: implicit %select{default constructor|copy constructor|move constructor|copy assignment operator|move assignment operator|destructor}0 inferred target collision: call to both %select{__device__|__global__|__host__|__host__ __device__}1 and %select{__device__|__global__|__host__|__host__ __device__}2 members
root: implicit {$arg0 :select s0=|default constructor| s1=|copy constructor| s2=|move constructor| s3=|copy assignment operator| s4=|move assignment operator| s5=|destructor|} inferred target collision: call to both {$arg1 :select s0=|__device__| s1=|__global__| s2=|__host__| s3=|__host__ __device__|} and {$arg2 :select s0=|__device__| s1=|__global__| s2=|__host__| s3=|__host__ __device__|} members

# note_implicit_param_decl
source: %0 is an implicit parameter
root: {$arg0} is an implicit parameter

# note_in_binding_decl_init
source: in implicit initialization of binding declaration %0
root: in implicit initialization of binding declaration {$arg0}

# note_in_declaration_of_implicit_special_member
source: while declaring the implicit %select{default constructor|copy constructor|move constructor|copy assignment operator|move assignment operator|destructor}1 for %0
root: while declaring the implicit {$arg1 :select s0=|default constructor| s1=|copy constructor| s2=|move constructor| s3=|copy assignment operator| s4=|move assignment operator| s5=|destructor|} for {$arg0}

# note_in_for_range
source: when looking up '%select{begin|end}0' function for range expression of type %1
root: when looking up '{$arg0 :select s0=|begin| s1=|end|}' function for range expression of type {$arg1}

# note_in_omitted_aggregate_initializer
source: in implicit initialization of %select{array element %1 with omitted initializer|field %1 with omitted initializer|trailing array elements in runtime-sized array new}0
root: in implicit initialization of {$arg0 :select s0=|array element {$arg1} with omitted initializer| s1=|field {$arg1} with omitted initializer| s2=|trailing array elements in runtime-sized array new|}

# note_in_reference_temporary_list_initializer
source: in initialization of temporary of type %0 created to list-initialize this reference
root: in initialization of temporary of type {$arg0} created to list-initialize this reference

# note_include_header_or_declare
source: include the header <%0> or explicitly provide a declaration for '%1'
root: include the header <{$arg0}> or explicitly provide a declaration for '{$arg1}'

# note_indirect_goto_target
source: possible target of %select{indirect|asm}0 goto statement
root: possible target of {$arg0 :select s0=|indirect| s1=|asm|} goto statement

# note_init_with_default_argument
source: initializing parameter %0 with default argument
root: initializing parameter {$arg0} with default argument

# note_init_with_default_member_initializer
source: initializing field %0 with default member initializer
root: initializing field {$arg0} with default member initializer

# note_initializer_out_of_order
source: %select{field|base class}0 %1 will be initialized after %select{field|base}2 %3
root: {$arg0 :select s0=|field| s1=|base class|} {$arg1} will be initialized after {$arg2 :select s0=|field| s1=|base|} {$arg3}

# note_insert_fallthrough_fixit
source: insert '%0;' to silence this warning
root: insert '{$arg0};' to silence this warning

# note_inst_declaration_hint
source: add an explicit instantiation declaration to suppress this warning if %q0 is explicitly instantiated in another translation unit
root: add an explicit instantiation declaration to suppress this warning if {$arg0 :q} is explicitly instantiated in another translation unit

# note_instantiation_contexts_suppressed
source: (skipping %0 context%s0 in backtrace; use -ftemplate-backtrace-limit=0 to see all)
root: (skipping {$arg0} context%s0 in backtrace; use -ftemplate-backtrace-limit=0 to see all)

# note_instantiation_required_here
source: %select{implicit|explicit}0 instantiation first required here
root: {$arg0 :select s0=|implicit| s1=|explicit|} instantiation first required here

# note_invalid_consteval_initializer
source: in the default initializer of %0
root: in the default initializer of {$arg0}

# note_invalid_consteval_initializer_here
source: initialized here %0
root: initialized here {$arg0}
