Repository: paperchalice/llvm-i18n
Catalog: xliff/root/DiagnosticInstallAPIKinds.xlf
Languages: root

# err_allowable_clients_mismatch
source: allowable clients do not match: '%0' (provided) vs '%1' (found)
root: allowable clients do not match: '{$arg0}' (provided) vs '{$arg1}' (found)

# err_allowable_clients_missing
source: allowable client missing from %0: '%1'
root: allowable client missing from {$arg0}: '{$arg1}'

# err_appextension_safe_mismatch
source: the ApplicationExtensionSafe flag does not match: '%0' (provided) vs '%1' (found)
root: the ApplicationExtensionSafe flag does not match: '{$arg0}' (provided) vs '{$arg1}' (found)

# err_architecture_mismatch
source: architectures do not match: '%0' (provided) vs '%1' (found)
root: architectures do not match: '{$arg0}' (provided) vs '{$arg1}' (found)

# err_cannot_read_input_list
source: could not read %0 input list '%1': %2
root: could not read {$arg0} input list '{$arg1}': {$arg2}

# err_cannot_write_file
source: cannot write file '%0': %1
root: cannot write file '{$arg0}': {$arg1}

# err_compatibility_version_mismatch
source: compatibility_version does not match: '%0' (provided) vs '%1' (found)
root: compatibility_version does not match: '{$arg0}' (provided) vs '{$arg1}' (found)

# err_current_version_mismatch
source: current_version does not match: '%0' (provided) vs '%1' (found)
root: current_version does not match: '{$arg0}' (provided) vs '{$arg1}' (found)

# err_directory_scanning
source: could not read directory '%0': %1
root: could not read directory '{$arg0}': {$arg1}

# err_header_hidden_symbol
source: symbol exported in dynamic library, but marked hidden in declaration '%0'
root: symbol exported in dynamic library, but marked hidden in declaration '{$arg0}'

# err_header_symbol_missing
source: no declaration found for exported symbol '%0' in dynamic library
root: no declaration found for exported symbol '{$arg0}' in dynamic library

# err_install_name_mismatch
source: install_name does not match: '%0' (provided) vs '%1' (found)
root: install_name does not match: '{$arg0}' (provided) vs '{$arg1}' (found)

# err_invalid_label
source: label '%0' is reserved: use a different label name for -X<label>
root: label '{$arg0}' is reserved: use a different label name for -X<label>

# err_library_hidden_symbol
source: declaration has external linkage, but symbol has internal linkage in dynamic library '%0'
root: declaration has external linkage, but symbol has internal linkage in dynamic library '{$arg0}'

# err_library_missing_symbol
source: declaration has external linkage, but dynamic library doesn't have symbol '%0'
root: declaration has external linkage, but dynamic library doesn't have symbol '{$arg0}'

# err_no_matching_target
source: no matching target found for target variant '%0'
root: no matching target found for target variant '{$arg0}'

# err_parent_umbrella_mismatch
source: parent umbrella does not match: '%0' (provided) vs '%1' (found)
root: parent umbrella does not match: '{$arg0}' (provided) vs '{$arg1}' (found)

# err_parent_umbrella_missing
source: parent umbrella missing from %0: '%1'
root: parent umbrella missing from {$arg0}: '{$arg1}'

# err_platform_mismatch
source: platform does not match: '%0' (provided) vs '%1' (found)
root: platform does not match: '{$arg0}' (provided) vs '{$arg1}' (found)

# err_reexported_libraries_mismatch
source: re-exported libraries do not match: '%0' (provided) vs '%1' (found)
root: re-exported libraries do not match: '{$arg0}' (provided) vs '{$arg1}' (found)

# err_reexported_libraries_missing
source: re-exported library missing from %0: '%1'
root: re-exported library missing from {$arg0}: '{$arg1}'

# err_shared_cache_eligiblity_mismatch
source: the NotForDyldSharedCache flag does not match: '%0' (provided) vs '%1' (found)
root: the NotForDyldSharedCache flag does not match: '{$arg0}' (provided) vs '{$arg1}' (found)

# err_unsupported_environment
source: environment '%0' is not supported: '%1'
root: environment '{$arg0}' is not supported: '{$arg1}'

# err_unsupported_os
source: os '%0' is not supported: '%1'
root: os '{$arg0}' is not supported: '{$arg1}'

# err_unsupported_vendor
source: vendor '%0' is not supported: '%1'
root: vendor '{$arg0}' is not supported: '{$arg1}'

# warn_glob_did_not_match
source: glob '%0' did not match any header file
root: glob '{$arg0}' did not match any header file

# warn_header_hidden_symbol
source: symbol exported in dynamic library, but marked hidden in declaration '%0'
root: symbol exported in dynamic library, but marked hidden in declaration '{$arg0}'

# warn_header_symbol_missing
source: no declaration was found for exported symbol '%0' in dynamic library
root: no declaration was found for exported symbol '{$arg0}' in dynamic library

# warn_library_hidden_symbol
source: declaration has external linkage, but symbol has internal linkage in dynamic library '%0'
root: declaration has external linkage, but symbol has internal linkage in dynamic library '{$arg0}'

# warn_library_missing_symbol
source: declaration has external linkage, but dynamic library doesn't have symbol '%0'
root: declaration has external linkage, but dynamic library doesn't have symbol '{$arg0}'

# warn_platform_mismatch
source: platform does not match: '%0' (provided) vs '%1' (found)
root: platform does not match: '{$arg0}' (provided) vs '{$arg1}' (found)

# warn_rpaths_mismatch
source: runpath search paths do not match: '%0' (provided) vs '%1' (found)
root: runpath search paths do not match: '{$arg0}' (provided) vs '{$arg1}' (found)

# warn_rpaths_missing
source: runpath search paths missing from %0: '%1'
root: runpath search paths missing from {$arg0}: '{$arg1}'

# warn_target
source: violations found for %0
root: violations found for {$arg0}
